[NoCoverage] ConditionalExpression
src/game/MainScene.ts:140:9
-       if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+       if (true) return "Run ended. The undercrypt claims you.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:140:9
-       if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+       if (false) return "Run ended. The undercrypt claims you.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:140:9
-       if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+       if (event.type !== "runDefeated") return "Run ended. The undercrypt claims you.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:140:24
-       if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+       if (event.type === "") return "Run ended. The undercrypt claims you.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:140:46
-       if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+       if (event.type === "runDefeated") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:141:9
-       if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+       if (true) return "The undercrypt yields. You are victorious.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:141:9
-       if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+       if (false) return "The undercrypt yields. You are victorious.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:141:9
-       if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+       if (event.type !== "runVictorious") return "The undercrypt yields. You are victorious.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:141:24
-       if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+       if (event.type === "") return "The undercrypt yields. You are victorious.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:141:48
-       if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+       if (event.type === "runVictorious") return "";

[NoCoverage] CallExpression
src/game/seed.ts:11:3
-     crypto.getRandomValues(values);
+     ;

[Survived] ArrayDeclaration
src/renderer/assets/dungeonAtlas.ts:28:12
-     regions: [
-       { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
-       { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
-       { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
-       { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
-       { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
-       { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
-       { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
-       { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
-     ]
+     regions: []
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:29:5
-       { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:29:11
-       { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
+       { id: "", x: 1, y: 1, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ConditionalExpression
src/renderer/materials.ts:37:10
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return true ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:37:10
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return false ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:37:10
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation !== 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:37:44
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "crypt-stone" : true ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:37:28
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "" : variation === 1 ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:37:44
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "crypt-stone" : false ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:37:44
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "crypt-stone" : variation !== 1 ? "burial-masonry" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:37:62
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "crypt-stone" : variation === 1 ? "" : "basalt";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:37:81
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 3 more tests!

[Survived] ObjectLiteral
src/renderer/materials.ts:21:76
-   export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
-     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
-     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
-     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
-     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
-     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
-     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
-     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
-     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
-   };
+   export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {};
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:22:18
-     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+     "crypt-stone": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:22:24
-     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+     "crypt-stone": { id: "", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:22:52
-     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+     "crypt-stone": { id: "crypt-stone", atlasRegion: "", fallbackColor: 0x4a4a2c, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:22:100
-     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+     "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "" },
Ran all tests for this mutant.

[NoCoverage] StringLiteral
src/main.ts:35:16
-   <div class="hud" data-hud hidden aria-label="Run information">
-     <header class="hud-header"><div><span class="eyebrow">THE UNDERCRYPT</span><strong data-floor></strong></div><div class="location" data-location></div><div class="objective" data-objective></div><button type="button" class="pause-button" data-pause>PAUSE <span>ESC</span></button></header>
-     <aside class="equipment equipment-left" aria-label="Left hand equipment"><span class="slot-label">LEFT HAND</span><strong data-left>EMPTY</strong><small data-left-detail>—</small></aside>
-     <aside class="equipment equipment-right" aria-label="Right hand equipment"><span class="slot-label">RIGHT HAND</span><strong data-right>EMPTY</strong><small data-right-detail>—</small></aside>
-     <section class="vitals" aria-label="Player vitality"><span class="slot-label">VITALITY</span><strong data-health></strong><div class="health-bar"><i data-health-bar></i></div></section>
-     <p class="feedback" data-feedback aria-live="polite"></p>
-     <p class="controls">W/S MOVE <i>·</i> A/D TURN <i>·</i> Q/E RING <i>·</i> P PICK UP <i>·</i> ESC PAUSE</p>
-   </div>
+   ui.innerHTML = ``;

[NoCoverage] ConditionalExpression
src/main.ts:95:7
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (true) { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] ConditionalExpression
src/main.ts:95:7
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (false) { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] EqualityOperator
src/main.ts:95:7
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode !== "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] StringLiteral
src/main.ts:95:16
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode === "") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] BlockStatement
src/main.ts:95:28
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode === "defeated") {}

[NoCoverage] StringLiteral
src/main.ts:95:60
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode === "defeated") { terminalEyebrow.textContent = ""; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] StringLiteral
src/main.ts:95:101
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = ""; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] StringLiteral
src/main.ts:95:149
-     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+     if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = ""; }

[NoCoverage] ConditionalExpression
src/main.ts:96:7
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (true) { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] ConditionalExpression
src/main.ts:96:7
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (false) { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] EqualityOperator
src/main.ts:96:7
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode !== "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] StringLiteral
src/main.ts:96:16
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode === "") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] BlockStatement
src/main.ts:96:30
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode === "victorious") {}

[NoCoverage] StringLiteral
src/main.ts:96:62
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode === "victorious") { terminalEyebrow.textContent = ""; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] StringLiteral
src/main.ts:96:106
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = ""; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }

[NoCoverage] StringLiteral
src/main.ts:96:158
-     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = "This run is victorious. The next descent awaits."; }
+     if (mode === "victorious") { terminalEyebrow.textContent = "RUN COMPLETE"; terminalTitle.textContent = "THE UNDERCRYPT YIELDS"; terminalCopy.textContent = ""; }
