[Survived] UnaryOperator
src/sim/state.ts:17:121
 export interface DoorState { readonly position: Point; readonly open: boolean; }
 
-const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: +1, y: 0 } };
 const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };

[Survived] UnaryOperator
src/sim/state.ts:17:59
 export interface DoorState { readonly position: Point; readonly open: boolean; }
 
-const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+const DELTAS: Record<Facing, Point> = { north: { x: 0, y: +1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
 const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };

[Survived] StringLiteral
src/sim/state.ts:18:77
 export interface DoorState { readonly position: Point; readonly open: boolean; }
 
 const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
-const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "", east: "north" };
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
 const key = (point: Point): string => `${point.x},${point.y}`;

[Survived] StringLiteral
src/sim/state.ts:18:91
 export interface DoorState { readonly position: Point; readonly open: boolean; }
 
 const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
-const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "" };
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
 const key = (point: Point): string => `${point.x},${point.y}`;

[Survived] StringLiteral
src/sim/state.ts:19:62
 
 const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
 const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
-const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+const RIGHT: Record<Facing, Facing> = { north: "east", east: "", south: "west", west: "north" };
 const key = (point: Point): string => `${point.x},${point.y}`;
 const CAPACITY = 6;

[Survived] StringLiteral
src/sim/state.ts:19:78
 
 const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
 const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
-const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "", west: "north" };
 const key = (point: Point): string => `${point.x},${point.y}`;
 const CAPACITY = 6;

[Survived] ArrowFunction
src/sim/state.ts:20:13
 const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
 const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
-const key = (point: Point): string => `${point.x},${point.y}`;
+const key = () => undefined;
 const CAPACITY = 6;
 export const EXIT_POSITION: Point = { x: 2, y: 4 };

[Survived] ObjectLiteral
src/sim/state.ts:22:37
 const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
 const key = (point: Point): string => `${point.x},${point.y}`;
 const CAPACITY = 6;
-export const EXIT_POSITION: Point = { x: 2, y: 4 };
+export const EXIT_POSITION: Point = {};
 export const OBJECTIVE_ITEM_ID = "star-forged-seal" as const;
 const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });

[Survived] ArrowFunction
src/sim/state.ts:24:14
 const CAPACITY = 6;
 export const EXIT_POSITION: Point = { x: 2, y: 4 };
 export const OBJECTIVE_ITEM_ID = "star-forged-seal" as const;
-const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });
+const item = () => undefined;
 
 function encounterFromMonster(monster: MonsterInstance): CombatState {

[Survived] BlockStatement
src/sim/state.ts:26:70
 export const OBJECTIVE_ITEM_ID = "star-forged-seal" as const;
 const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });
 
-function encounterFromMonster(monster: MonsterInstance): CombatState {
-  const definition = monsterById(monster.definitionId)!;
-  return { id: monster.id, definitionId: definition.id, name: definition.name, health: monster.health, maxHealth: definition.vitality, attack: definition.attack, position: monster.position };
-}
+function encounterFromMonster(monster: MonsterInstance): CombatState {}
 
 function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {

[Survived] ObjectLiteral
src/sim/state.ts:28:10
 
 function encounterFromMonster(monster: MonsterInstance): CombatState {
   const definition = monsterById(monster.definitionId)!;
-  return { id: monster.id, definitionId: definition.id, name: definition.name, health: monster.health, maxHealth: definition.vitality, attack: definition.attack, position: monster.position };
+  return {};
 }
 

[Survived] BlockStatement
src/sim/state.ts:31:84
   return { id: monster.id, definitionId: definition.id, name: definition.name, health: monster.health, maxHealth: definition.vitality, attack: definition.attack, position: monster.position };
 }
 
-function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {
-  return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
-}
+function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {}
 
 function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {

[Survived] LogicalOperator
src/sim/state.ts:32:43
 }
 
 function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {
-  return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+  return state.monsters.find((monster) => !monster.defeated || key(monster.position) === key(position));
 }
 

[Survived] EqualityOperator
src/sim/state.ts:32:64
 }
 
 function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {
-  return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+  return state.monsters.find((monster) => !monster.defeated && key(monster.position) !== key(position));
 }
 

[Survived] BlockStatement
src/sim/state.ts:35:115
   return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
 }
 
-function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {
-  return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
-}
+function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {}
 
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {

[Survived] ConditionalExpression
src/sim/state.ts:36:42
 }
 
 function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {
-  return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+  return state.monsters.map((monster) => true ? { ...monster, ...patch } : monster);
 }
 

[Survived] EqualityOperator
src/sim/state.ts:36:42
 }
 
 function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {
-  return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+  return state.monsters.map((monster) => monster.id !== id ? { ...monster, ...patch } : monster);
 }
 

[Survived] BlockStatement
src/sim/state.ts:39:120
   return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
 }
 
-function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
-  const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
-  let cursor = (rollValue - 1) % totalWeight;
-  for (const entry of table) {
-    if (cursor < entry.weight) return entry.itemId;
-    cursor -= entry.weight;
-  }
-  return table[table.length - 1].itemId;
-}
+function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {}
 
 export function createInitialState(seed = 7391): GameState {

[Survived] ArrowFunction
src/sim/state.ts:40:36
 }
 
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
-  const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
+  const totalWeight = table.reduce(() => undefined, 0);
   let cursor = (rollValue - 1) % totalWeight;
   for (const entry of table) {

[Survived] ArithmeticOperator
src/sim/state.ts:40:54
 }
 
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
-  const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
+  const totalWeight = table.reduce((total, entry) => total - entry.weight, 0);
   let cursor = (rollValue - 1) % totalWeight;
   for (const entry of table) {

[Survived] ArithmeticOperator
src/sim/state.ts:41:16
 
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
   const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
-  let cursor = (rollValue - 1) % totalWeight;
+  let cursor = (rollValue - 1) * totalWeight;
   for (const entry of table) {
     if (cursor < entry.weight) return entry.itemId;

[Survived] ArithmeticOperator
src/sim/state.ts:41:17
 
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
   const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
-  let cursor = (rollValue - 1) % totalWeight;
+  let cursor = (rollValue + 1) % totalWeight;
   for (const entry of table) {
     if (cursor < entry.weight) return entry.itemId;

[Survived] BlockStatement
src/sim/state.ts:42:30
 function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
   const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
   let cursor = (rollValue - 1) % totalWeight;
-  for (const entry of table) {
-    if (cursor < entry.weight) return entry.itemId;
-    cursor -= entry.weight;
-  }
+  for (const entry of table) {}
   return table[table.length - 1].itemId;
 }

[Survived] ConditionalExpression
src/sim/state.ts:43:9
   const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
   let cursor = (rollValue - 1) % totalWeight;
   for (const entry of table) {
-    if (cursor < entry.weight) return entry.itemId;
+    if (true) return entry.itemId;
     cursor -= entry.weight;
   }

[Survived] EqualityOperator
src/sim/state.ts:43:9
   const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
   let cursor = (rollValue - 1) % totalWeight;
   for (const entry of table) {
-    if (cursor < entry.weight) return entry.itemId;
+    if (cursor >= entry.weight) return entry.itemId;
     cursor -= entry.weight;
   }

[NoCoverage] AssignmentOperator
src/sim/state.ts:44:5
   let cursor = (rollValue - 1) % totalWeight;
   for (const entry of table) {
     if (cursor < entry.weight) return entry.itemId;
-    cursor -= entry.weight;
+    cursor += entry.weight;
   }
   return table[table.length - 1].itemId;

[NoCoverage] ArithmeticOperator
src/sim/state.ts:46:16
     if (cursor < entry.weight) return entry.itemId;
     cursor -= entry.weight;
   }
-  return table[table.length - 1].itemId;
+  return table[table.length + 1].itemId;
 }
 

[Survived] CallExpression
src/sim/state.ts:50:3
 }
 
 export function createInitialState(seed = 7391): GameState {
-  assertValidContent();
+  ;
   const monsters: readonly MonsterInstance[] = [

[Survived] ArrayDeclaration
src/sim/state.ts:52:48
 export function createInitialState(seed = 7391): GameState {
   assertValidContent();
-  const monsters: readonly MonsterInstance[] = [
-    { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
-    { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
-    { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
-    { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
-    { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
-    { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
-    { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
-  ];
+  const monsters: readonly MonsterInstance[] = [];
 }

[Survived] BooleanLiteral
src/sim/state.ts:53:111
   assertValidContent();
   const monsters: readonly MonsterInstance[] = [
-    { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+    { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: true },
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },

[Survived] StringLiteral
src/sim/state.ts:53:11
   assertValidContent();
   const monsters: readonly MonsterInstance[] = [
-    { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+    { id: "", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },

[Survived] BooleanLiteral
src/sim/state.ts:54:112
   const monsters: readonly MonsterInstance[] = [
     { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
-    { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+    { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: true },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },

[Survived] ObjectLiteral
src/sim/state.ts:54:75
   const monsters: readonly MonsterInstance[] = [
     { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
-    { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+    { id: "monster-mireling-1", definitionId: "glass-mireling", position: {}, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },

[Survived] BooleanLiteral
src/sim/state.ts:55:112
   const monsters: readonly MonsterInstance[] = [
     { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
-    { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+    { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: true },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
     { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },

[Survived] BooleanLiteral
src/sim/state.ts:56:112
     { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
-    { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+    { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: true },
     { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },

[Survived] ObjectLiteral
src/sim/state.ts:56:5
     { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
-    { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+    {},
     { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },

[Survived] BooleanLiteral
src/sim/state.ts:57:114
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
-    { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+    { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: true },
     { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }

[Survived] StringLiteral
src/sim/state.ts:57:11
     { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
-    { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+    { id: "", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }

[Survived] BooleanLiteral
src/sim/state.ts:58:114
     { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
     { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
-    { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+    { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: true },
     { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
   ];

[Survived] BooleanLiteral
src/sim/state.ts:59:114
     { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
     { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
     { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
-    { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+    { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: true }
   ];

[Survived] BlockStatement
src/sim/state.ts:64:53
 }
 
-export function restartRun(seed: number): GameState { return createInitialState(seed); }
+export function restartRun(seed: number): GameState {}
 
 export function completeRun(state: GameState): CommandResult {

[Survived] BlockStatement
src/sim/state.ts:66:62
 
 export function restartRun(seed: number): GameState { return createInitialState(seed); }
 
-export function completeRun(state: GameState): CommandResult {
-  if (state.runStatus !== "playing") return { state, events: [] };
-  if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
-  return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
-}
+export function completeRun(state: GameState): CommandResult {}
 
 const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));

[Survived] ConditionalExpression
src/sim/state.ts:67:7
 export function restartRun(seed: number): GameState { return createInitialState(seed); }
 
 export function completeRun(state: GameState): CommandResult {
-  if (state.runStatus !== "playing") return { state, events: [] };
+  if (false) return { state, events: [] };
   if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };

[Survived] EqualityOperator
src/sim/state.ts:67:7
 export function restartRun(seed: number): GameState { return createInitialState(seed); }
 
 export function completeRun(state: GameState): CommandResult {
-  if (state.runStatus !== "playing") return { state, events: [] };
+  if (state.runStatus === "playing") return { state, events: [] };
   if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };

[Survived] ConditionalExpression
src/sim/state.ts:68:7
 
 export function completeRun(state: GameState): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [] };
-  if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+  if (false) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
 }

[Survived] ConditionalExpression
src/sim/state.ts:68:7
 
 export function completeRun(state: GameState): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [] };
-  if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+  if (true) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
 }

[Survived] BooleanLiteral
src/sim/state.ts:69:124
 export function completeRun(state: GameState): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [] };
   if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
-  return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+  return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: false } }, {}), events: [{ type: "runVictorious" }] };
 }
 

[Survived] ObjectLiteral
src/sim/state.ts:69:10
 export function completeRun(state: GameState): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [] };
   if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
-  return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+  return {};
 }
 

[Survived] ArrowFunction
src/sim/state.ts:72:92
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
 }
 
-const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find(() => undefined);
 const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
 const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });

[Survived] EqualityOperator
src/sim/state.ts:72:102
   return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
 }
 
-const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) !== key(point));
 const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
 const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });

[Survived] LogicalOperator
src/sim/state.ts:73:55
 }
 
 const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
-const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
+const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] && null;
 const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
 
