[Survived] ArrowFunction
src/sim/state.ts:73:18
 }
 
 const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
-const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
+const selected = () => undefined;
 const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
 

[Survived] ArithmeticOperator
src/sim/state.ts:74:106
 
 const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
 const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
-const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
+const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn - 1 });
 
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {

[Survived] ArrowFunction
src/sim/state.ts:74:17
 
 const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
 const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
-const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
+const advance = () => undefined;
 
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {

[Survived] EqualityOperator
src/sim/state.ts:78:18
 
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {
   const target = state.encounter;
-  const itemId = hand === "left" ? state.leftHand : state.rightHand;
+  const itemId = hand !== "left" ? state.leftHand : state.rightHand;
   const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
   events.push({ type: "attackAttempt", hand });

[Survived] ConditionalExpression
src/sim/state.ts:78:18
 
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {
   const target = state.encounter;
-  const itemId = hand === "left" ? state.leftHand : state.rightHand;
+  const itemId = false ? state.leftHand : state.rightHand;
   const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
   events.push({ type: "attackAttempt", hand });

[Survived] LogicalOperator
src/sim/state.ts:79:31
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {
   const target = state.encounter;
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
-  const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+  const definition = itemById(state.items.find(value => value.id === itemId)?.definitionId && "");
   events.push({ type: "attackAttempt", hand });
   if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }

[Survived] ArrowFunction
src/sim/state.ts:79:48
 function combat(state: GameState, hand: HandSlot, events: GameEvent[]): GameState {
   const target = state.encounter;
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
-  const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+  const definition = itemById(state.items.find(() => undefined)?.definitionId ?? "");
   events.push({ type: "attackAttempt", hand });
   if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }

[Survived] ObjectLiteral
src/sim/state.ts:80:15
   const target = state.encounter;
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
   const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-  events.push({ type: "attackAttempt", hand });
+  events.push({});
   if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
   let rng = { state: state.rngState };

[Survived] BooleanLiteral
src/sim/state.ts:81:18
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
   const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
   events.push({ type: "attackAttempt", hand });
-  if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+  if (!target || definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
   let rng = { state: state.rngState };
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;

[Survived] ConditionalExpression
src/sim/state.ts:81:7
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
   const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
   events.push({ type: "attackAttempt", hand });
-  if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+  if (true) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
   let rng = { state: state.rngState };
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;

[Survived] ConditionalExpression
src/sim/state.ts:84:7
   if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
   let rng = { state: state.rngState };
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;
-  if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+  if (true) return advance({ ...state, rngState: rng.state }, {});
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
   const health = target.health - damage.value;

[Survived] ConditionalExpression
src/sim/state.ts:84:7
   if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
   let rng = { state: state.rngState };
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;
-  if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+  if (false) return advance({ ...state, rngState: rng.state }, {});
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
   const health = target.health - damage.value;

[Survived] ArithmeticOperator
src/sim/state.ts:85:47
   let rng = { state: state.rngState };
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;
   if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
-  const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
+  const damage = roll(rng, definition.attack, definition.attack - 1); rng = damage.rng;
   const health = target.health - damage.value;
   events.push({ type: "hit", target: target.id, damage: damage.value });

[Survived] ArithmeticOperator
src/sim/state.ts:86:18
   const accuracy = roll(rng, 1, 100); rng = accuracy.rng;
   if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
-  const health = target.health - damage.value;
+  const health = target.health + damage.value;
   events.push({ type: "hit", target: target.id, damage: damage.value });
   if (health <= 0) {

[Survived] StringLiteral
src/sim/state.ts:87:23
   if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
   const health = target.health - damage.value;
-  events.push({ type: "hit", target: target.id, damage: damage.value });
+  events.push({ type: "", target: target.id, damage: damage.value });
   if (health <= 0) {
     events.push({ type: "monsterDefeated", monsterId: target.id });

[Survived] ConditionalExpression
src/sim/state.ts:88:7
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
   const health = target.health - damage.value;
   events.push({ type: "hit", target: target.id, damage: damage.value });
-  if (health <= 0) {
+  if (false) {
     events.push({ type: "monsterDefeated", monsterId: target.id });
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];

[Survived] ConditionalExpression
src/sim/state.ts:88:7
   const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
   const health = target.health - damage.value;
   events.push({ type: "hit", target: target.id, damage: damage.value });
-  if (health <= 0) {
+  if (true) {
     events.push({ type: "monsterDefeated", monsterId: target.id });
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];

[Survived] ArithmeticOperator
src/sim/state.ts:91:66
   if (health <= 0) {
     events.push({ type: "monsterDefeated", monsterId: target.id });
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];
-    const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
+    const lootRoll = roll(rng, 1, table.reduce((total, entry) => total - entry.weight, 0)); rng = lootRoll.rng;
     const lootItemId = chooseLoot(table, lootRoll.value);
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);

[Survived] ArrowFunction
src/sim/state.ts:91:48
   if (health <= 0) {
     events.push({ type: "monsterDefeated", monsterId: target.id });
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];
-    const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
+    const lootRoll = roll(rng, 1, table.reduce(() => undefined, 0)); rng = lootRoll.rng;
     const lootItemId = chooseLoot(table, lootRoll.value);
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);

[Survived] ConditionalExpression
src/sim/state.ts:93:45
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];
     const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
     const lootItemId = chooseLoot(table, lootRoll.value);
-    const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+    const lootEntry = table.find((entry) => true);
     const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
     if (lootEntry) {

[Survived] EqualityOperator
src/sim/state.ts:93:45
     const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];
     const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
     const lootItemId = chooseLoot(table, lootRoll.value);
-    const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+    const lootEntry = table.find((entry) => entry.itemId !== lootItemId);
     const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
     if (lootEntry) {

[Survived] BooleanLiteral
src/sim/state.ts:94:77
     const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
     const lootItemId = chooseLoot(table, lootRoll.value);
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);
-    const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
+    const defeated = updateMonster(state, target.id, { health: 0, defeated: false });
     if (lootEntry) {
       const lootId = `item-loot-${state.turn + 1}`;

[Survived] ConditionalExpression
src/sim/state.ts:95:9
     const lootItemId = chooseLoot(table, lootRoll.value);
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);
     const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
-    if (lootEntry) {
+    if (false) {
       const lootId = `item-loot-${state.turn + 1}`;
       events.push({ type: "itemAcquired", itemId: lootId });

[Survived] ConditionalExpression
src/sim/state.ts:95:9
     const lootItemId = chooseLoot(table, lootRoll.value);
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);
     const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
-    if (lootEntry) {
+    if (true) {
       const lootId = `item-loot-${state.turn + 1}`;
       events.push({ type: "itemAcquired", itemId: lootId });

[Survived] ArithmeticOperator
src/sim/state.ts:96:35
     const lootEntry = table.find((entry) => entry.itemId === lootItemId);
     const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
     if (lootEntry) {
-      const lootId = `item-loot-${state.turn + 1}`;
+      const lootId = `item-loot-${state.turn - 1}`;
       events.push({ type: "itemAcquired", itemId: lootId });

[Survived] MethodExpression
src/sim/state.ts:103:24
     return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null }, {});
   }
-  const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
+  const playerHealth = Math.min(0, state.playerHealth - retaliation.value);
   if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
   if (!playerHealth) {

[Survived] ArithmeticOperator
src/sim/state.ts:103:36
     return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null }, {});
   }
-  const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
+  const playerHealth = Math.max(0, state.playerHealth + retaliation.value);
   if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
   if (!playerHealth) {

[Survived] ConditionalExpression
src/sim/state.ts:104:7
   }
   const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
-  if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+  if (false) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
   if (!playerHealth) {
     events.push({ type: "playerDefeated" }, { type: "runDefeated" });

[Survived] ConditionalExpression
src/sim/state.ts:104:7
   }
   const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
-  if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+  if (true) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
   if (!playerHealth) {
     events.push({ type: "playerDefeated" }, { type: "runDefeated" });

[Survived] BooleanLiteral
src/sim/state.ts:105:7
   const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
   if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
-  if (!playerHealth) {
+  if (playerHealth) {
     events.push({ type: "playerDefeated" }, { type: "runDefeated" });
     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});

[Survived] ConditionalExpression
src/sim/state.ts:105:7
   const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
   if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
-  if (!playerHealth) {
+  if (false) {
     events.push({ type: "playerDefeated" }, { type: "runDefeated" });
     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});

[Survived] ConditionalExpression
src/sim/state.ts:113:7
 }
 
 export function executeCommand(state: GameState, command: Command): CommandResult {
-  if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+  if (false) return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
   if (state.encounter) {

[Survived] EqualityOperator
src/sim/state.ts:113:7
 }
 
 export function executeCommand(state: GameState, command: Command): CommandResult {
-  if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+  if (state.runStatus === "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
   if (state.encounter) {

[Survived] BlockStatement
src/sim/state.ts:115:24
 export function executeCommand(state: GameState, command: Command): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
-  if (state.encounter) {
-    if (command === "retreat") return { state: advance(state, { encounter: null }), events };
-    if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
-    return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
-  }
+  if (state.encounter) {}
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };

[Survived] ConditionalExpression
src/sim/state.ts:115:7
 export function executeCommand(state: GameState, command: Command): CommandResult {
   if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
-  if (state.encounter) {
+  if (false) {
     if (command === "retreat") return { state: advance(state, { encounter: null }), events };
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };

[Survived] ConditionalExpression
src/sim/state.ts:116:9
   if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
   if (state.encounter) {
-    if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+    if (true) return { state: advance(state, { encounter: null }), events };
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };

[Survived] EqualityOperator
src/sim/state.ts:116:9
   if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
   const events: GameEvent[] = [];
   if (state.encounter) {
-    if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+    if (command !== "retreat") return { state: advance(state, { encounter: null }), events };
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };

[Survived] EqualityOperator
src/sim/state.ts:117:33
   const events: GameEvent[] = [];
   if (state.encounter) {
     if (command === "retreat") return { state: advance(state, { encounter: null }), events };
-    if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+    if (command === "attack" || command !== "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }

[Survived] EqualityOperator
src/sim/state.ts:117:118
   const events: GameEvent[] = [];
   if (state.encounter) {
     if (command === "retreat") return { state: advance(state, { encounter: null }), events };
-    if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+    if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command !== "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }

[Survived] StringLiteral
src/sim/state.ts:118:38
   if (state.encounter) {
     if (command === "retreat") return { state: advance(state, { encounter: null }), events };
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
-    return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+    return { state, events: [{ type: "", reason: "encounter" }] };
   }
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {

[Survived] ConditionalExpression
src/sim/state.ts:120:7
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }
-  if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+  if (false) {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;

[Survived] ConditionalExpression
src/sim/state.ts:120:7
     if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }
-  if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+  if (false || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;

[Survived] ConditionalExpression
src/sim/state.ts:121:9
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
-    if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+    if (false) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;

[Survived] BooleanLiteral
src/sim/state.ts:121:9
     return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
   }
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
-    if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+    if (state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;

[Survived] EqualityOperator
src/sim/state.ts:122:19
   }
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
-    const delta = command === "rotateInventoryNext" ? 1 : -1;
+    const delta = command !== "rotateInventoryNext" ? 1 : -1;
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };

[Survived] ConditionalExpression
src/sim/state.ts:122:19
   }
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
-    const delta = command === "rotateInventoryNext" ? 1 : -1;
+    const delta = true ? 1 : -1;
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };

[Survived] ArithmeticOperator
src/sim/state.ts:123:19
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;
-    const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
+    const index = (state.selectedRingIndex + delta + state.ring.length) * state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }

[Survived] ArithmeticOperator
src/sim/state.ts:123:20
   if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
     if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
     const delta = command === "rotateInventoryNext" ? 1 : -1;
-    const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
+    const index = (state.selectedRingIndex + delta - state.ring.length) % state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }

[Survived] BlockStatement
src/sim/state.ts:126:76
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }
-  if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
-    const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
-    const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-    if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const slot = hand === "left" ? "leftHand" : "rightHand";
-    return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
-  }
+  if (command === "equipSelectedLeft" || command === "equipSelectedRight") {}
   if (command === "useSelected") {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");

[Survived] LogicalOperator
src/sim/state.ts:126:7
     const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }
-  if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+  if (command === "equipSelectedLeft" && command === "equipSelectedRight") {
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");

[Survived] EqualityOperator
src/sim/state.ts:127:60
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
-    const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+    const itemId = selected(state); const hand: HandSlot = command !== "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[Survived] ConditionalExpression
src/sim/state.ts:127:60
     return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
   }
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
-    const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+    const itemId = selected(state); const hand: HandSlot = false ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
