[Survived] ConditionalExpression
src/sim/state.ts:128:61
   }
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
-    const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+    const definition = itemById(state.items.find((value) => true)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const slot = hand === "left" ? "leftHand" : "rightHand";

[Survived] EqualityOperator
src/sim/state.ts:128:61
   }
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
-    const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+    const definition = itemById(state.items.find((value) => value.id !== itemId)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const slot = hand === "left" ? "leftHand" : "rightHand";

[Survived] OptionalChaining
src/sim/state.ts:129:21
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-    if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (!itemId || !definition.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const slot = hand === "left" ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };

[Survived] LogicalOperator
src/sim/state.ts:129:9
   if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-    if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (!itemId && !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const slot = hand === "left" ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };

[Survived] ConditionalExpression
src/sim/state.ts:130:18
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const slot = hand === "left" ? "leftHand" : "rightHand";
+    const slot = false ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }

[Survived] ConditionalExpression
src/sim/state.ts:130:18
     const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const slot = hand === "left" ? "leftHand" : "rightHand";
+    const slot = true ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }

[Survived] ConditionalExpression
src/sim/state.ts:133:7
     const slot = hand === "left" ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }
-  if (command === "useSelected") {
+  if (true) {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[Survived] ConditionalExpression
src/sim/state.ts:133:7
     const slot = hand === "left" ? "leftHand" : "rightHand";
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }
-  if (command === "useSelected") {
+  if (false) {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[Survived] OptionalChaining
src/sim/state.ts:134:65
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }
   if (command === "useSelected") {
-    const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+    const itemId = selected(state); const definition = itemById(state.items.find(value => value.id === itemId).definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[Survived] ConditionalExpression
src/sim/state.ts:134:93
     return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
   }
   if (command === "useSelected") {
-    const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+    const itemId = selected(state); const definition = itemById(state.items.find((value) => true)?.definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[Survived] BooleanLiteral
src/sim/state.ts:135:20
   }
   if (command === "useSelected") {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-    if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (!itemId || definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[Survived] BooleanLiteral
src/sim/state.ts:135:9
   }
   if (command === "useSelected") {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-    if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[Survived] ArrowFunction
src/sim/state.ts:136:36
   if (command === "useSelected") {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const ring = state.ring.filter((id) => id !== itemId);
+    const ring = state.ring.filter(() => undefined);
   }

[Survived] MethodExpression
src/sim/state.ts:136:18
   if (command === "useSelected") {
     const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
     if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const ring = state.ring.filter((id) => id !== itemId);
+    const ring = state.ring;
   }

[Survived] ConditionalExpression
src/sim/state.ts:139:7
     const ring = state.ring.filter((id) => id !== itemId);
   }
-  if (command === "pickup") {
+  if (true) {
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };

[Survived] ConditionalExpression
src/sim/state.ts:139:7
     const ring = state.ring.filter((id) => id !== itemId);
   }
-  if (command === "pickup") {
+  if (false) {
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };

[Survived] ConditionalExpression
src/sim/state.ts:141:9
   }
   if (command === "pickup") {
-    if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+    if (true) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
     if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
     const pickedItem = state.items.find((value) => value.id === itemId);

[Survived] ConditionalExpression
src/sim/state.ts:141:9
   }
   if (command === "pickup") {
-    if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+    if (false) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
     if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
     const pickedItem = state.items.find((value) => value.id === itemId);

[Survived] EqualityOperator
src/sim/state.ts:142:9
   if (command === "pickup") {
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
-    if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+    if (state.ring.length > CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
     const pickedItem = state.items.find((value) => value.id === itemId);

[Survived] ConditionalExpression
src/sim/state.ts:142:9
   if (command === "pickup") {
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
-    if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+    if (true) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
     const pickedItem = state.items.find((value) => value.id === itemId);

[Survived] ConditionalExpression
src/sim/state.ts:143:52
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
     if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
-    const pickedItem = state.items.find((value) => value.id === itemId);
+    const pickedItem = state.items.find((value) => false);
   }

[Survived] EqualityOperator
src/sim/state.ts:143:52
     if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
     if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
-    const pickedItem = state.items.find((value) => value.id === itemId);
+    const pickedItem = state.items.find((value) => value.id !== itemId);
   }

[Survived] EqualityOperator
src/sim/state.ts:146:7
     const pickedItem = state.items.find((value) => value.id === itemId);
   }
-  if (command === "dropSelected") {
+  if (command !== "dropSelected") {
     const itemId = selected(state);
     if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[Survived] ConditionalExpression
src/sim/state.ts:146:7
     const pickedItem = state.items.find((value) => value.id === itemId);
   }
-  if (command === "dropSelected") {
+  if (false) {
     const itemId = selected(state);
     if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] BooleanLiteral
src/sim/state.ts:148:9
   }
   if (command === "dropSelected") {
     const itemId = selected(state);
-    if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:9
   }
   if (command === "dropSelected") {
     const itemId = selected(state);
-    if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+    if (true) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
     const ring = state.ring.filter((id) => id !== itemId);

[NoCoverage] EqualityOperator
src/sim/state.ts:149:44
   if (command === "dropSelected") {
     const itemId = selected(state);
     if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const ring = state.ring.filter((id) => id !== itemId);
+    const ring = state.ring.filter((id) => id === itemId);
   }

[NoCoverage] ArrowFunction
src/sim/state.ts:149:36
   if (command === "dropSelected") {
     const itemId = selected(state);
     if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-    const ring = state.ring.filter((id) => id !== itemId);
+    const ring = state.ring.filter(() => undefined);
   }

[Survived] ConditionalExpression
src/sim/state.ts:152:18
     const ring = state.ring.filter((id) => id !== itemId);
   }
-  const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+  const facing = true ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {

[Survived] EqualityOperator
src/sim/state.ts:152:18
     const ring = state.ring.filter((id) => id !== itemId);
   }
-  const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+  const facing = command !== "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {

[Survived] EqualityOperator
src/sim/state.ts:154:36
   }
   const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
-  if (command === "moveForward" || command === "moveBackward") {
+  if (command === "moveForward" || command !== "moveBackward") {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);

[Survived] ConditionalExpression
src/sim/state.ts:154:7
   }
   const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
-  if (command === "moveForward" || command === "moveBackward") {
+  if (true) {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);

[Survived] UnaryOperator
src/sim/state.ts:155:109
   const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {
-    const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+    const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: +forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {

[Survived] ConditionalExpression
src/sim/state.ts:155:51
   const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {
-    const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+    const forward = DELTAS[facing]; const delta = false ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {

[Survived] ArithmeticOperator
src/sim/state.ts:156:23
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
-    const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
+    const next = { x: position.x - delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {
       const monster = command === "moveForward" ? monsterAt(state, next) : undefined;

[Survived] ArithmeticOperator
src/sim/state.ts:156:48
   let position = state.player.position;
   if (command === "moveForward" || command === "moveBackward") {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
-    const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
+    const next = { x: position.x + delta.x, y: position.y - delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {
       const monster = command === "moveForward" ? monsterAt(state, next) : undefined;

[Survived] ConditionalExpression
src/sim/state.ts:157:9
   if (command === "moveForward" || command === "moveBackward") {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
-    if (!state.walls.includes(key(next)) && (!door || door.open)) {
+    if (false) {
       const monster = command === "moveForward" ? monsterAt(state, next) : undefined;

[Survived] BooleanLiteral
src/sim/state.ts:157:46
   if (command === "moveForward" || command === "moveBackward") {
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
-    if (!state.walls.includes(key(next)) && (!door || door.open)) {
+    if (!state.walls.includes(key(next)) && (door || door.open)) {
       const monster = command === "moveForward" ? monsterAt(state, next) : undefined;

[Survived] ConditionalExpression
src/sim/state.ts:158:23
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {
-      const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+      const monster = false ? monsterAt(state, next) : undefined;
       position = next; events.push({ type: "moved", position });

[Survived] ConditionalExpression
src/sim/state.ts:158:23
     const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
     const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
     if (!state.walls.includes(key(next)) && (!door || door.open)) {
-      const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+      const monster = true ? monsterAt(state, next) : undefined;
       position = next; events.push({ type: "moved", position });

[Survived] StringLiteral
src/sim/state.ts:160:44
     if (!state.walls.includes(key(next)) && (!door || door.open)) {
       const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
-      position = next; events.push({ type: "moved", position });
+      position = next; events.push({ type: "", position });
     } else events.push({ type: "movementBlocked", position: next });
   }

[Survived] ConditionalExpression
src/sim/state.ts:163:7
       position = next; events.push({ type: "moved", position });
     } else events.push({ type: "movementBlocked", position: next });
   }
-  if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+  if (true) events.push({ type: "turned", facing });
   const movedState = advance(state, { player: { position, facing } });
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {

[Survived] EqualityOperator
src/sim/state.ts:163:7
       position = next; events.push({ type: "moved", position });
     } else events.push({ type: "movementBlocked", position: next });
   }
-  if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+  if (command !== "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
   const movedState = advance(state, { player: { position, facing } });
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {

[Survived] ObjectLiteral
src/sim/state.ts:164:37
     } else events.push({ type: "movementBlocked", position: next });
   }
   if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
-  const movedState = advance(state, { player: { position, facing } });
+  const movedState = advance(state, {});
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);

[Survived] LogicalOperator
src/sim/state.ts:165:7
   }
   if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
   const movedState = advance(state, { player: { position, facing } });
-  if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+  if (command === "moveForward" || command === "moveBackward" || key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);
     if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };

[Survived] ConditionalExpression
src/sim/state.ts:165:8
   }
   if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
   const movedState = advance(state, { player: { position, facing } });
-  if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+  if ((true) && key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);
     if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };

[Survived] ConditionalExpression
src/sim/state.ts:167:9
   const movedState = advance(state, { player: { position, facing } });
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);
-    if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+    if (false) return { state: completion.state, events: [...events, ...completion.events] };
     events.push(...completion.events);
   }

[Survived] EqualityOperator
src/sim/state.ts:167:9
   const movedState = advance(state, { player: { position, facing } });
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);
-    if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+    if (completion.events[0]?.type !== "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
     events.push(...completion.events);
   }

[Survived] CallExpression
src/sim/state.ts:168:5
   if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
     const completion = completeRun(movedState);
     if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
-    events.push(...completion.events);
+    ;
   }
   return { state: movedState, events };

[Survived] BlockStatement
src/sim/state.ts:173:77
   return { state: movedState, events };
 }
 
-export function applyCommand(state: GameState, command: Command): GameState { return executeCommand(state, command).state; }
+export function applyCommand(state: GameState, command: Command): GameState {}
 export function visibleCells(state: GameState): readonly { distance: number; point: Point; blocked: boolean }[] {
   const delta = DELTAS[state.player.facing];
