[Survived] BlockStatement
src/game/seed.ts:1:63
-export function normalizeSeed(value: string | number): number {
-  const text = String(value).trim();
-  if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
-  let hash = 2166136261;
-  for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
-  return (hash >>> 0) || 1;
-}
+export function normalizeSeed(value: string | number): number {}
 
 export function createBrowserSeed(): number {

[Survived] MethodExpression
src/game/seed.ts:2:16
 export function normalizeSeed(value: string | number): number {
-  const text = String(value).trim();
+  const text = String(value);
   if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;

[Survived] ConditionalExpression
src/game/seed.ts:3:7
 export function normalizeSeed(value: string | number): number {
   const text = String(value).trim();
-  if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+  if (true) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;
   for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }

[Survived] ConditionalExpression
src/game/seed.ts:3:7
 export function normalizeSeed(value: string | number): number {
   const text = String(value).trim();
-  if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+  if (false) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;
   for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }

[Survived] BlockStatement
src/game/seed.ts:5:33
   const text = String(value).trim();
   if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;
-  for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
+  for (const character of text) {}
   return (hash >>> 0) || 1;
 }

[Survived] LogicalOperator
src/game/seed.ts:6:10
   if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;
   for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
-  return (hash >>> 0) || 1;
+  return hash >>> 0 && 1;
 }
 

[Survived] ConditionalExpression
src/game/seed.ts:6:10
   if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
   let hash = 2166136261;
   for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
-  return (hash >>> 0) || 1;
+  return true;
 }
 

[NoCoverage] BlockStatement
src/game/seed.ts:9:45
   return (hash >>> 0) || 1;
 }
 
-export function createBrowserSeed(): number {
-  const values = new Uint32Array(1);
-  crypto.getRandomValues(values);
-  return normalizeSeed(values[0]);
-}
+export function createBrowserSeed(): number {}
 

[NoCoverage] CallExpression
src/game/seed.ts:11:3
 
 export function createBrowserSeed(): number {
   const values = new Uint32Array(1);
-  crypto.getRandomValues(values);
+  ;
   return normalizeSeed(values[0]);
 }
