[NoCoverage] BlockStatement
src/game/portalProjection.ts:13:95
   { left: 0.448, right: 0.562, top: 0.455, bottom: 0.59 }
 ] as const;
 
-export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {
-  return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
-}
+export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {}
 
 export function intervalQuads(near: PortalFrame, far: PortalFrame): Readonly<{

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:18
 ] as const;
 
 export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {
-  return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+  return { left: frame.left / width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
 }
 

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:45
 ] as const;
 
 export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {
-  return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+  return { left: frame.left * width, right: frame.right / width, top: frame.top * height, bottom: frame.bottom * height };
 }
 

[Survived] BlockStatement
src/game/portalProjection.ts:22:4
   rightWall: PortalQuad;
   ceiling: PortalQuad;
   floor: PortalQuad;
-}> {
-  const tl = { x: near.left, y: near.top };
-  const tr = { x: near.right, y: near.top };
-  const bl = { x: near.left, y: near.bottom };
-  const br = { x: near.right, y: near.bottom };
-  const ftl = { x: far.left, y: far.top };
-  const ftr = { x: far.right, y: far.top };
-  const fbl = { x: far.left, y: far.bottom };
-  const fbr = { x: far.right, y: far.bottom };
-  return {
-    leftWall: [tl, ftl, fbl, bl],
-    rightWall: [ftr, tr, br, fbr],
-    ceiling: [tl, tr, ftr, ftl],
-    floor: [bl, fbl, fbr, br]
-  };
-}
+}> {}
 

[Survived] ObjectLiteral
src/game/portalProjection.ts:23:14
   ceiling: PortalQuad;
   floor: PortalQuad;
 }> {
-  const tl = { x: near.left, y: near.top };
+  const tl = {};
   const tr = { x: near.right, y: near.top };
   const bl = { x: near.left, y: near.bottom };

[Survived] ObjectLiteral
src/game/portalProjection.ts:26:14
   const tl = { x: near.left, y: near.top };
   const tr = { x: near.right, y: near.top };
   const bl = { x: near.left, y: near.bottom };
-  const br = { x: near.right, y: near.bottom };
+  const br = {};
   const ftl = { x: far.left, y: far.top };
   const ftr = { x: far.right, y: far.top };

[Survived] ObjectLiteral
src/game/portalProjection.ts:31:10
   const ftr = { x: far.right, y: far.top };
   const fbl = { x: far.left, y: far.bottom };
   const fbr = { x: far.right, y: far.bottom };
-  return {
-    leftWall: [tl, ftl, fbl, bl],
-    rightWall: [ftr, tr, br, fbr],
-    ceiling: [tl, tr, ftr, ftl],
-    floor: [bl, fbl, fbr, br]
-  };
+  return {};
 }
 

[Survived] ArrayDeclaration
src/game/portalProjection.ts:34:14
   return {
     leftWall: [tl, ftl, fbl, bl],
     rightWall: [ftr, tr, br, fbr],
-    ceiling: [tl, tr, ftr, ftl],
+    ceiling: [],
     floor: [bl, fbl, fbr, br]
   };
