[NoCoverage] BlockStatement
src/game/palette.ts:21:51
   boundary: 0x586044
 } as const;
 
-export function paletteHex(color: number): string {
-  return `#${color.toString(16).padStart(6, "0")}`;
-}
+export function paletteHex(color: number): string {}
 
 export function shadeColor(color: number, amount: number): number {

[NoCoverage] BlockStatement
src/game/palette.ts:25:67
   return `#${color.toString(16).padStart(6, "0")}`;
 }
 
-export function shadeColor(color: number, amount: number): number {
-  const red = (color >> 16) & 0xff;
-  const green = (color >> 8) & 0xff;
-  const blue = color & 0xff;
-  return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
-}
+export function shadeColor(color: number, amount: number): number {}
 

[NoCoverage] ArithmeticOperator
src/game/palette.ts:29:57
   const red = (color >> 16) & 0xff;
   const green = (color >> 8) & 0xff;
   const blue = color & 0xff;
-  return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
+  return (Math.round(red * amount) << 16) | (Math.round(green / amount) << 8) | Math.round(blue * amount);
 }
 

[NoCoverage] ArithmeticOperator
src/game/palette.ts:29:92
   const red = (color >> 16) & 0xff;
   const green = (color >> 8) & 0xff;
   const blue = color & 0xff;
-  return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
+  return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue / amount);
 }
 
