[NoCoverage] BlockStatement
src/game/renderFixtures.ts:9:57
 ] as const;
 export type RenderFixture = typeof RENDER_FIXTURES[number];
 
-function fixtureWalls(fixture: RenderFixture): string[] {
-  const walls: string[] = [];
-  const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
-  for (let depth = 1; depth <= 4; depth += 1) {
-    wall(depth, -1);
-    wall(depth, 1);
-  }
-  if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
-  if (fixture === "t-intersection" || fixture === "four-way-intersection") {
-    walls.splice(walls.indexOf("1,-1"), 1);
-    walls.splice(walls.indexOf("1,1"), 1);
-  }
-  if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
-    walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
-  }
-  if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
-  return walls;
-}
+function fixtureWalls(fixture: RenderFixture): string[] {}
 
 export function createRenderFixture(fixture: RenderFixture): GameState {

[NoCoverage] ArrayDeclaration
src/game/renderFixtures.ts:10:27
 export type RenderFixture = typeof RENDER_FIXTURES[number];
 
 function fixtureWalls(fixture: RenderFixture): string[] {
-  const walls: string[] = [];
+  const walls: string[] = ["Stryker was here"];
   const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
   for (let depth = 1; depth <= 4; depth += 1) {

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:11:48
 
 function fixtureWalls(fixture: RenderFixture): string[] {
   const walls: string[] = [];
-  const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
+  const wall = (x: number, y: number): void => {};
   for (let depth = 1; depth <= 4; depth += 1) {
     wall(depth, -1);

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:12:47
 function fixtureWalls(fixture: RenderFixture): string[] {
   const walls: string[] = [];
   const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
-  for (let depth = 1; depth <= 4; depth += 1) {
-    wall(depth, -1);
-    wall(depth, 1);
-  }
+  for (let depth = 1; depth <= 4; depth += 1) {}
   if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
   if (fixture === "t-intersection" || fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:12:23
 function fixtureWalls(fixture: RenderFixture): string[] {
   const walls: string[] = [];
   const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
-  for (let depth = 1; depth <= 4; depth += 1) {
+  for (let depth = 1; false; depth += 1) {
     wall(depth, -1);
     wall(depth, 1);

[NoCoverage] UnaryOperator
src/game/renderFixtures.ts:13:17
   const walls: string[] = [];
   const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
   for (let depth = 1; depth <= 4; depth += 1) {
-    wall(depth, -1);
+    wall(depth, +1);
     wall(depth, 1);
   }

[NoCoverage] CallExpression
src/game/renderFixtures.ts:14:5
   const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
   for (let depth = 1; depth <= 4; depth += 1) {
     wall(depth, -1);
-    wall(depth, 1);
+    ;
   }
   if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:16:7
     wall(depth, -1);
     wall(depth, 1);
   }
-  if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+  if (false) wall(Number(fixture.slice(5)), 0);
   if (fixture === "t-intersection" || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf("1,-1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:16:7
     wall(depth, -1);
     wall(depth, 1);
   }
-  if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+  if (true) wall(Number(fixture.slice(5)), 0);
   if (fixture === "t-intersection" || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf("1,-1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:7
     wall(depth, 1);
   }
   if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
-  if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+  if (false) {
     walls.splice(walls.indexOf("1,-1"), 1);
     walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:7
     wall(depth, 1);
   }
   if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
-  if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+  if (false || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf("1,-1"), 1);
     walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:21:39
     walls.splice(walls.indexOf("1,-1"), 1);
     walls.splice(walls.indexOf("1,1"), 1);
   }
-  if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+  if (fixture === "left-opening-1" || fixture !== "left-opening-2" || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
   }

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:21:7
     walls.splice(walls.indexOf("1,-1"), 1);
     walls.splice(walls.indexOf("1,1"), 1);
   }
-  if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+  if ((fixture === "left-opening-1" || fixture === "left-opening-2") && fixture === "four-way-intersection") {
     walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
   }

[NoCoverage] MethodExpression
src/game/renderFixtures.ts:22:35
     walls.splice(walls.indexOf("1,1"), 1);
   }
   if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
-    walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
+    walls.splice(walls.indexOf(`${fixture.startsWith("-2") ? 2 : 1},-1`), 1);
   }
   if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:22:32
     walls.splice(walls.indexOf("1,1"), 1);
   }
   if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
-    walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
+    walls.splice(walls.indexOf(``), 1);
   }
   if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:40
   if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
   }
-  if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+  if (fixture === "right-opening-1" || false) walls.splice(walls.indexOf("1,1"), 1);
   return walls;
 }

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:7
   if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
     walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
   }
-  if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+  if (false) walls.splice(walls.indexOf("1,1"), 1);
   return walls;
 }

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:28:72
   return walls;
 }
 
-export function createRenderFixture(fixture: RenderFixture): GameState {
-  const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
-  const initial = createInitialState(7391);
-  return {
-    ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
-    player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
-    walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
-    doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
-  };
-}
+export function createRenderFixture(fixture: RenderFixture): GameState {}
 
 export function renderFixtureFromLocation(): RenderFixture | null {

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:29:18
 }
 
 export function createRenderFixture(fixture: RenderFixture): GameState {
-  const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+  const status = fixture === "defeated" && fixture === "victorious" ? fixture : "playing";
   const initial = createInitialState(7391);
   return {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:29:18
 }
 
 export function createRenderFixture(fixture: RenderFixture): GameState {
-  const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+  const status = fixture !== "defeated" || fixture === "victorious" ? fixture : "playing";
   const initial = createInitialState(7391);
   return {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:32:78
   const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
   const initial = createInitialState(7391);
   return {
-    ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+    ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : true ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:32:50
   const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
   const initial = createInitialState(7391);
   return {
-    ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+    ...initial, runStatus: status, playerHealth: status !== "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:33:25
   const initial = createInitialState(7391);
   return {
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
-    player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+    player: { position: false ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
     doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:33:25
   const initial = createInitialState(7391);
   return {
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
-    player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+    player: { position: true ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
     doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:34:12
   return {
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
-    walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+    walls: false ? initial.walls : fixtureWalls(fixture),
     doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
   };

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:34:12
   return {
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
-    walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+    walls: true ? initial.walls : fixtureWalls(fixture),
     doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
   };

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:102
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
-    doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+    doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: false }] : []
   };
 }

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:41
     ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
     player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
     walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
-    doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+    doors: fixture === "closed-door" || false ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
   };
 }

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:39:67
   };
 }
 
-export function renderFixtureFromLocation(): RenderFixture | null {
-  const value = new URLSearchParams(window.location.search).get("fixture");
-  return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
-}
+export function renderFixtureFromLocation(): RenderFixture | null {}
 

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:40:65
 }
 
 export function renderFixtureFromLocation(): RenderFixture | null {
-  const value = new URLSearchParams(window.location.search).get("fixture");
+  const value = new URLSearchParams(window.location.search).get("");
   return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
 }

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:41:58
 
 export function renderFixtureFromLocation(): RenderFixture | null {
   const value = new URLSearchParams(window.location.search).get("fixture");
-  return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
+  return (RENDER_FIXTURES as readonly string[]).includes(value && "") ? value as RenderFixture : null;
 }
 
