[NoCoverage] BlockStatement
src/game/MainScene.ts:17:127
 import { resolveFirstPersonPresentation } from "../renderer/firstPerson/handPresentation";
 import { clearCheckpoint, loadCheckpoint, saveCheckpoint } from "../save/checkpoint";
 
-function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {
-  const pixels = frameToPixels(frame, viewport.width, viewport.height);
-  return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
-}
+function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {}
 
 function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:54
 
 function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {
   const pixels = frameToPixels(frame, viewport.width, viewport.height);
-  return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+  return { left: pixels.left + viewport.left, right: pixels.right - viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
 }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:89
 
 function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {
   const pixels = frameToPixels(frame, viewport.width, viewport.height);
-  return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+  return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top - viewport.top, bottom: pixels.bottom + viewport.top };
 }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:22:118
   return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
 }
 
-function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {
-  return { left: 72, top: 72, width: width - 144, height: height - 212 };
-}
+function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {}
 
 export class MainScene extends Phaser.Scene {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:23:38
 }
 
 function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {
-  return { left: 72, top: 72, width: width - 144, height: height - 212 };
+  return { left: 72, top: 72, width: width + 144, height: height - 212 };
 }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:23:59
 }
 
 function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {
-  return { left: 72, top: 72, width: width - 144, height: height - 212 };
+  return { left: 72, top: 72, width: width - 144, height: height + 212 };
 }
 

[NoCoverage] LogicalOperator
src/game/MainScene.ts:27:112
 }
 
 export class MainScene extends Phaser.Scene {
-  private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
+  private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() && createInitialState();
   private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
   private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:28:39
 
 export class MainScene extends Phaser.Scene {
   private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
-  private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+  private readonly perspectiveDebug = false;
   private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
   private reducedMotion = false;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:28:39
 
 export class MainScene extends Phaser.Scene {
   private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
-  private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+  private readonly perspectiveDebug = true;
   private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
   private reducedMotion = false;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:29:68
 export class MainScene extends Phaser.Scene {
   private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
   private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
-  private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+  private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus !== "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
   private reducedMotion = false;
   private feedback = "A corridor waits beyond the torchlight.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:29:68
 export class MainScene extends Phaser.Scene {
   private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
   private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
-  private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+  private mode: InputMode = this.state.runStatus === "defeated" || false ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
   private reducedMotion = false;
   private feedback = "A corridor waits beyond the torchlight.";

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:30:27
   private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
   private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
   private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
-  private reducedMotion = false;
+  private reducedMotion = true;
   private feedback = "A corridor waits beyond the torchlight.";
   private presentationTimeMs = 0;

[NoCoverage] BlockStatement
src/game/MainScene.ts:39:19
 
   constructor() { super("main"); }
 
-  preload(): void {
-    this.load.image("dungeon-surfaces", DUNGEON_SURFACE_ATLAS.source);
-    this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
-    this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
-    this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
-    this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
-    this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
-    this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
-    this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
-  }
+  preload(): void {}
 
   update(time: number): void {

[NoCoverage] StringLiteral
src/game/MainScene.ts:42:37
   preload(): void {
     this.load.image("dungeon-surfaces", DUNGEON_SURFACE_ATLAS.source);
     this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
-    this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
+    this.load.image("torch-sconce", "");
     this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
     this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");

[NoCoverage] StringLiteral
src/game/MainScene.ts:43:36
     this.load.image("dungeon-surfaces", DUNGEON_SURFACE_ATLAS.source);
     this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
     this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
-    this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
+    this.load.image("torch-flame", "");
     this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
     this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");

[NoCoverage] StringLiteral
src/game/MainScene.ts:45:40
     this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
     this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
     this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
-    this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
+    this.load.image("ashbound-warden", "");
     this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
     this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");

[NoCoverage] StringLiteral
src/game/MainScene.ts:46:21
     this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
     this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
     this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
-    this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
+    this.load.image("", "/assets/entities/glass-mireling.svg");
     this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
   }

[NoCoverage] StringLiteral
src/game/MainScene.ts:47:40
     this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
     this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
     this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
-    this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
+    this.load.image("gloam-scavenger", "");
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:50:30
     this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
   }
 
-  update(time: number): void {
-    this.presentationTimeMs = time;
-    const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
-    const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
-    this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
-    this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
-  }
+  update(time: number): void {}
 
   create(): void {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:53:60
   update(time: number): void {
     this.presentationTimeMs = time;
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
-    const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
+    const flameFrame = this.reducedMotion ? 0 : Math.floor(time * 180) % 4;
     this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
     this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:53:49
   update(time: number): void {
     this.presentationTimeMs = time;
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
-    const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
+    const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) * 4;
     this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
     this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:54:59
     this.presentationTimeMs = time;
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
     const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
-    this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
+    this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame / 32, 0, 32, 48));
     this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
   }

[NoCoverage] ArrowFunction
src/game/MainScene.ts:54:32
     this.presentationTimeMs = time;
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
     const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
-    this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
+    this.entitySprites.forEach(() => undefined);
     this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
   }

[NoCoverage] ArrowFunction
src/game/MainScene.ts:55:31
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
     const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
     this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
-    this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
+    this.flameSprites.forEach(() => undefined);
   }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:55:58
     const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
     const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
     this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
-    this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
+    this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame / 32, 0, 32, 48));
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:58:18
     this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
   }
 
-  create(): void {
-    this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
-    this.configureAtmosphere();
-    this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
-    this.inputController.attach();
-    window.addEventListener("tarmin-start", this.onStart);
-    window.addEventListener("tarmin-continue", this.onContinue);
-    window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
-    window.addEventListener("tarmin-motion", this.onMotion);
-    this.publishMode();
-    this.renderState();
-    this.publishCheckpointAvailability();
-  }
+  create(): void {}
 
   private readonly onStart = (event: Event): void => {

[NoCoverage] CallExpression
src/game/MainScene.ts:59:5
   }
 
   create(): void {
-    this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
+    ;
     this.configureAtmosphere();
     this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });

[NoCoverage] CallExpression
src/game/MainScene.ts:60:5
 
   create(): void {
     this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
-    this.configureAtmosphere();
+    ;
     this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
     this.inputController.attach();

[NoCoverage] ArrowFunction
src/game/MainScene.ts:61:148
   create(): void {
     this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
     this.configureAtmosphere();
-    this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+    this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => undefined });
     this.inputController.attach();
     window.addEventListener("tarmin-start", this.onStart);

[NoCoverage] ArrowFunction
src/game/MainScene.ts:61:118
   create(): void {
     this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
     this.configureAtmosphere();
-    this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+    this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => undefined, togglePause: () => this.togglePause() });
     this.inputController.attach();
     window.addEventListener("tarmin-start", this.onStart);

[NoCoverage] CallExpression
src/game/MainScene.ts:62:5
     this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
     this.configureAtmosphere();
     this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
-    this.inputController.attach();
+    ;
     window.addEventListener("tarmin-start", this.onStart);
     window.addEventListener("tarmin-continue", this.onContinue);

[NoCoverage] StringLiteral
src/game/MainScene.ts:63:29
     this.configureAtmosphere();
     this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
     this.inputController.attach();
-    window.addEventListener("tarmin-start", this.onStart);
+    window.addEventListener("", this.onStart);
     window.addEventListener("tarmin-continue", this.onContinue);
     window.addEventListener("tarmin-toggle-pause", this.onTogglePause);

[NoCoverage] StringLiteral
src/game/MainScene.ts:65:29
     this.inputController.attach();
     window.addEventListener("tarmin-start", this.onStart);
     window.addEventListener("tarmin-continue", this.onContinue);
-    window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
+    window.addEventListener("", this.onTogglePause);
     window.addEventListener("tarmin-motion", this.onMotion);
     this.publishMode();

[NoCoverage] CallExpression
src/game/MainScene.ts:67:5
     window.addEventListener("tarmin-continue", this.onContinue);
     window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
     window.addEventListener("tarmin-motion", this.onMotion);
-    this.publishMode();
+    ;
     this.renderState();
     this.publishCheckpointAvailability();

[NoCoverage] CallExpression
src/game/MainScene.ts:68:5
     window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
     window.addEventListener("tarmin-motion", this.onMotion);
     this.publishMode();
-    this.renderState();
+    ;
     this.publishCheckpointAvailability();
   }

[NoCoverage] CallExpression
src/game/MainScene.ts:69:5
     window.addEventListener("tarmin-motion", this.onMotion);
     this.publishMode();
     this.renderState();
-    this.publishCheckpointAvailability();
+    ;
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:72:54
     this.publishCheckpointAvailability();
   }
 
-  private readonly onStart = (event: Event): void => {
-    const seed = (event as CustomEvent<number>).detail;
-    this.state = restartRun(seed);
-    saveCheckpoint(this.state);
-    this.feedback = `Seed ${seed} · the descent begins.`;
-    this.mode = "active";
-    this.publishMode(); this.renderState();
-  };
+  private readonly onStart = (event: Event): void => {};
   private readonly onContinue = (): void => {
     const checkpoint = loadCheckpoint();

[NoCoverage] CallExpression
src/game/MainScene.ts:75:5
   private readonly onStart = (event: Event): void => {
     const seed = (event as CustomEvent<number>).detail;
     this.state = restartRun(seed);
-    saveCheckpoint(this.state);
+    ;
     this.feedback = `Seed ${seed} · the descent begins.`;
     this.mode = "active";

[NoCoverage] CallExpression
src/game/MainScene.ts:78:25
     saveCheckpoint(this.state);
     this.feedback = `Seed ${seed} · the descent begins.`;
     this.mode = "active";
-    this.publishMode(); this.renderState();
+    this.publishMode(); ;
   };
   private readonly onContinue = (): void => {

[NoCoverage] CallExpression
src/game/MainScene.ts:78:5
     saveCheckpoint(this.state);
     this.feedback = `Seed ${seed} · the descent begins.`;
     this.mode = "active";
-    this.publishMode(); this.renderState();
+    ; this.renderState();
   };
   private readonly onContinue = (): void => {

[NoCoverage] BlockStatement
src/game/MainScene.ts:80:45
     this.mode = "active";
     this.publishMode(); this.renderState();
   };
-  private readonly onContinue = (): void => {
-    const checkpoint = loadCheckpoint();
-    if (!checkpoint) return;
-    this.state = checkpoint;
-    this.feedback = "The descent resumes where the torch was left.";
-    this.mode = "active";
-    this.publishMode(); this.renderState();
-  };
+  private readonly onContinue = (): void => {};
   private readonly onTogglePause = (): void => this.togglePause();
   private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:82:9
   };
   private readonly onContinue = (): void => {
     const checkpoint = loadCheckpoint();
-    if (!checkpoint) return;
+    if (false) return;
     this.state = checkpoint;
     this.feedback = "The descent resumes where the torch was left.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:82:9
   };
   private readonly onContinue = (): void => {
     const checkpoint = loadCheckpoint();
-    if (!checkpoint) return;
+    if (true) return;
     this.state = checkpoint;
     this.feedback = "The descent resumes where the torch was left.";

[NoCoverage] ArrowFunction
src/game/MainScene.ts:88:36
     this.mode = "active";
     this.publishMode(); this.renderState();
   };
-  private readonly onTogglePause = (): void => this.togglePause();
+  private readonly onTogglePause = () => undefined;
   private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
 

[NoCoverage] CallExpression
src/game/MainScene.ts:89:118
     this.publishMode(); this.renderState();
   };
   private readonly onTogglePause = (): void => this.togglePause();
-  private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
+  private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; ; };
 
   private togglePause(): void {

[NoCoverage] BlockStatement
src/game/MainScene.ts:89:55
     this.publishMode(); this.renderState();
   };
   private readonly onTogglePause = (): void => this.togglePause();
-  private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
+  private readonly onMotion = (event: Event): void => {};
 
   private togglePause(): void {

[NoCoverage] BlockStatement
src/game/MainScene.ts:91:31
   private readonly onTogglePause = (): void => this.togglePause();
   private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
 
-  private togglePause(): void {
-    if (this.mode === "active") this.mode = "paused";
-    else if (this.mode === "paused") this.mode = "active";
-    else return;
-    this.publishMode(); this.renderState();
-  }
+  private togglePause(): void {}
 
   private dispatch(command: Command): void {

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:92:9
   private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
 
   private togglePause(): void {
-    if (this.mode === "active") this.mode = "paused";
+    if (true) this.mode = "paused";
     else if (this.mode === "paused") this.mode = "active";
     else return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:92:9
   private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
 
   private togglePause(): void {
-    if (this.mode === "active") this.mode = "paused";
+    if (false) this.mode = "paused";
     else if (this.mode === "paused") this.mode = "active";
     else return;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:93:14
 
   private togglePause(): void {
     if (this.mode === "active") this.mode = "paused";
-    else if (this.mode === "paused") this.mode = "active";
+    else if (this.mode !== "paused") this.mode = "active";
     else return;
     this.publishMode(); this.renderState();

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:93:14
 
   private togglePause(): void {
     if (this.mode === "active") this.mode = "paused";
-    else if (this.mode === "paused") this.mode = "active";
+    else if (false) this.mode = "active";
     else return;
     this.publishMode(); this.renderState();

[NoCoverage] CallExpression
src/game/MainScene.ts:95:25
     if (this.mode === "active") this.mode = "paused";
     else if (this.mode === "paused") this.mode = "active";
     else return;
-    this.publishMode(); this.renderState();
+    this.publishMode(); ;
   }
 

[NoCoverage] CallExpression
src/game/MainScene.ts:95:5
     if (this.mode === "active") this.mode = "paused";
     else if (this.mode === "paused") this.mode = "active";
     else return;
-    this.publishMode(); this.renderState();
+    ; this.renderState();
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:98:44
     this.publishMode(); this.renderState();
   }
 
-  private dispatch(command: Command): void {
-    if (this.mode !== "active") return;
-    const result = executeCommand(this.state, command);
-    this.state = result.state;
-    if (this.state.runStatus === "playing") saveCheckpoint(this.state);
-    else clearCheckpoint();
-    this.feedback = this.feedbackFor(result.events);
-    window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
-    if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
-    this.renderState();
-    this.publishMode();
-    this.publishCheckpointAvailability();
-    if (this.mode !== "active") return;
-    if (!command.startsWith("move") && !command.startsWith("turn")) return;
-    this.mode = "transitioning"; this.publishMode();
-    const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
-    const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
-    const finishTransition = (): void => {
-      if (this.mode !== "transitioning") return;
-      veil.destroy(); this.mode = "active"; this.publishMode();
-    };
-    this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
-    window.setTimeout(finishTransition, duration + 40);
-  }
+  private dispatch(command: Command): void {}
 
   private feedbackFor(events: readonly GameEvent[]): string {

[NoCoverage] EqualityOperator
src/game/MainScene.ts:99:9
   }
 
   private dispatch(command: Command): void {
-    if (this.mode !== "active") return;
+    if (this.mode === "active") return;
     const result = executeCommand(this.state, command);
     this.state = result.state;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:99:9
   }
 
   private dispatch(command: Command): void {
-    if (this.mode !== "active") return;
+    if (true) return;
     const result = executeCommand(this.state, command);
     this.state = result.state;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:102:9
     if (this.mode !== "active") return;
     const result = executeCommand(this.state, command);
     this.state = result.state;
-    if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+    if (this.state.runStatus !== "playing") saveCheckpoint(this.state);
     else clearCheckpoint();
     this.feedback = this.feedbackFor(result.events);

[NoCoverage] CallExpression
src/game/MainScene.ts:102:45
     if (this.mode !== "active") return;
     const result = executeCommand(this.state, command);
     this.state = result.state;
-    if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+    if (this.state.runStatus === "playing") ;
     else clearCheckpoint();
     this.feedback = this.feedbackFor(result.events);

[NoCoverage] CallExpression
src/game/MainScene.ts:103:10
     const result = executeCommand(this.state, command);
     this.state = result.state;
     if (this.state.runStatus === "playing") saveCheckpoint(this.state);
-    else clearCheckpoint();
+    else ;
     this.feedback = this.feedbackFor(result.events);
     window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
