[NoCoverage] StringLiteral
src/game/MainScene.ts:105:42
     if (this.state.runStatus === "playing") saveCheckpoint(this.state);
     else clearCheckpoint();
     this.feedback = this.feedbackFor(result.events);
-    window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
+    window.dispatchEvent(new CustomEvent("", { detail: result.events }));
     if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
     this.renderState();

[NoCoverage] EqualityOperator
src/game/MainScene.ts:106:9
     else clearCheckpoint();
     this.feedback = this.feedbackFor(result.events);
     window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
-    if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+    if (this.state.runStatus === "playing") this.mode = this.state.runStatus;
     this.renderState();
     this.publishMode();

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:106:9
     else clearCheckpoint();
     this.feedback = this.feedbackFor(result.events);
     window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
-    if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+    if (false) this.mode = this.state.runStatus;
     this.renderState();
     this.publishMode();

[NoCoverage] CallExpression
src/game/MainScene.ts:107:5
     this.feedback = this.feedbackFor(result.events);
     window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
     if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
-    this.renderState();
+    ;
     this.publishMode();
     this.publishCheckpointAvailability();

[NoCoverage] CallExpression
src/game/MainScene.ts:108:5
     window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
     if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
     this.renderState();
-    this.publishMode();
+    ;
     this.publishCheckpointAvailability();
     if (this.mode !== "active") return;

[NoCoverage] CallExpression
src/game/MainScene.ts:109:5
     if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
     this.renderState();
     this.publishMode();
-    this.publishCheckpointAvailability();
+    ;
     if (this.mode !== "active") return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:110:9
     this.renderState();
     this.publishMode();
     this.publishCheckpointAvailability();
-    if (this.mode !== "active") return;
+    if (true) return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;
     this.mode = "transitioning"; this.publishMode();

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:110:9
     this.renderState();
     this.publishMode();
     this.publishCheckpointAvailability();
-    if (this.mode !== "active") return;
+    if (false) return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;
     this.mode = "transitioning"; this.publishMode();

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:111:9
     this.publishMode();
     this.publishCheckpointAvailability();
     if (this.mode !== "active") return;
-    if (!command.startsWith("move") && !command.startsWith("turn")) return;
+    if (true) return;
     this.mode = "transitioning"; this.publishMode();
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);

[NoCoverage] LogicalOperator
src/game/MainScene.ts:111:9
     this.publishMode();
     this.publishCheckpointAvailability();
     if (this.mode !== "active") return;
-    if (!command.startsWith("move") && !command.startsWith("turn")) return;
+    if (!command.startsWith("move") || !command.startsWith("turn")) return;
     this.mode = "transitioning"; this.publishMode();
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);

[NoCoverage] CallExpression
src/game/MainScene.ts:112:34
     this.publishCheckpointAvailability();
     if (this.mode !== "active") return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;
-    this.mode = "transitioning"; this.publishMode();
+    this.mode = "transitioning"; ;
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:113:59
     if (this.mode !== "active") return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;
     this.mode = "transitioning"; this.publishMode();
-    const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
+    const veil = this.add.rectangle(this.scale.width / 2, this.scale.height * 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:113:37
     if (this.mode !== "active") return;
     if (!command.startsWith("move") && !command.startsWith("turn")) return;
     this.mode = "transitioning"; this.publishMode();
-    const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
+    const veil = this.add.rectangle(this.scale.width * 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {

[NoCoverage] BlockStatement
src/game/MainScene.ts:115:42
     this.mode = "transitioning"; this.publishMode();
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
-    const finishTransition = (): void => {
-      if (this.mode !== "transitioning") return;
-      veil.destroy(); this.mode = "active"; this.publishMode();
-    };
+    const finishTransition = (): void => {};
     this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
     window.setTimeout(finishTransition, duration + 40);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:116:11
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {
-      if (this.mode !== "transitioning") return;
+      if (false) return;
       veil.destroy(); this.mode = "active"; this.publishMode();
     };

[NoCoverage] EqualityOperator
src/game/MainScene.ts:116:11
     const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {
-      if (this.mode !== "transitioning") return;
+      if (this.mode === "transitioning") return;
       veil.destroy(); this.mode = "active"; this.publishMode();
     };

[NoCoverage] CallExpression
src/game/MainScene.ts:117:45
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {
       if (this.mode !== "transitioning") return;
-      veil.destroy(); this.mode = "active"; this.publishMode();
+      veil.destroy(); this.mode = "active"; ;
     };
     this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });

[NoCoverage] CallExpression
src/game/MainScene.ts:117:7
     const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
     const finishTransition = (): void => {
       if (this.mode !== "transitioning") return;
-      veil.destroy(); this.mode = "active"; this.publishMode();
+      ; this.mode = "active"; this.publishMode();
     };
     this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:120:41
       veil.destroy(); this.mode = "active"; this.publishMode();
     };
     this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
-    window.setTimeout(finishTransition, duration + 40);
+    window.setTimeout(finishTransition, duration - 40);
   }
 

[NoCoverage] EqualityOperator
src/game/MainScene.ts:124:46
   }
 
   private feedbackFor(events: readonly GameEvent[]): string {
-    const event = events.find((candidate) => candidate.type === "runVictorious")
+    const event = events.find((candidate) => candidate.type !== "runVictorious")
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:124:31
   }
 
   private feedbackFor(events: readonly GameEvent[]): string {
-    const event = events.find((candidate) => candidate.type === "runVictorious")
+    const event = events.find(() => undefined)
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")

[NoCoverage] EqualityOperator
src/game/MainScene.ts:125:37
 
   private feedbackFor(events: readonly GameEvent[]): string {
     const event = events.find((candidate) => candidate.type === "runVictorious")
-      ?? events.find((candidate) => candidate.type === "runDefeated")
+      ?? events.find((candidate) => candidate.type !== "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:125:37
 
   private feedbackFor(events: readonly GameEvent[]): string {
     const event = events.find((candidate) => candidate.type === "runVictorious")
-      ?? events.find((candidate) => candidate.type === "runDefeated")
+      ?? events.find((candidate) => false)
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:126:22
   private feedbackFor(events: readonly GameEvent[]): string {
     const event = events.find((candidate) => candidate.type === "runVictorious")
       ?? events.find((candidate) => candidate.type === "runDefeated")
-      ?? events.find((candidate) => candidate.type === "playerDefeated")
+      ?? events.find(() => undefined)
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:126:37
   private feedbackFor(events: readonly GameEvent[]): string {
     const event = events.find((candidate) => candidate.type === "runVictorious")
       ?? events.find((candidate) => candidate.type === "runDefeated")
-      ?? events.find((candidate) => candidate.type === "playerDefeated")
+      ?? events.find((candidate) => true)
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:127:37
     const event = events.find((candidate) => candidate.type === "runVictorious")
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")
-      ?? events.find((candidate) => candidate.type === "exitLocked")
+      ?? events.find((candidate) => true)
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
         ? events.find((candidate) => candidate.type === "monsterDefeated")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:127:37
     const event = events.find((candidate) => candidate.type === "runVictorious")
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")
-      ?? events.find((candidate) => candidate.type === "exitLocked")
+      ?? events.find((candidate) => false)
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
         ? events.find((candidate) => candidate.type === "monsterDefeated")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:11
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")
-      ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+      ?? (false
         ? events.find((candidate) => candidate.type === "monsterDefeated")
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))

[NoCoverage] MethodExpression
src/game/MainScene.ts:128:79
       ?? events.find((candidate) => candidate.type === "runDefeated")
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")
-      ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+      ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.every(candidate => candidate.type === "itemAcquired")
         ? events.find((candidate) => candidate.type === "monsterDefeated")
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:129:38
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
-        ? events.find((candidate) => candidate.type === "monsterDefeated")
+        ? events.find((candidate) => true)
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];

[NoCoverage] ArrowFunction
src/game/MainScene.ts:129:23
       ?? events.find((candidate) => candidate.type === "playerDefeated")
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
-        ? events.find((candidate) => candidate.type === "monsterDefeated")
+        ? events.find(() => undefined)
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];

[NoCoverage] EqualityOperator
src/game/MainScene.ts:130:38
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
         ? events.find((candidate) => candidate.type === "monsterDefeated")
-        : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+        : events.find((candidate) => candidate.type !== "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];
     if (!event) return this.feedback;

[NoCoverage] LogicalOperator
src/game/MainScene.ts:130:38
       ?? events.find((candidate) => candidate.type === "exitLocked")
       ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
         ? events.find((candidate) => candidate.type === "monsterDefeated")
-        : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+        : events.find((candidate) => candidate.type === "monsterDefeated" && candidate.type === "itemAcquired"))
       ?? events[0];
     if (!event) return this.feedback;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:132:9
         ? events.find((candidate) => candidate.type === "monsterDefeated")
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];
-    if (!event) return this.feedback;
+    if (false) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:132:9
         ? events.find((candidate) => candidate.type === "monsterDefeated")
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];
-    if (!event) return this.feedback;
+    if (true) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:133:9
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];
     if (!event) return this.feedback;
-    if (event.type === "movementBlocked") return "The way is sealed.";
+    if (true) return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:133:9
         : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
       ?? events[0];
     if (!event) return this.feedback;
-    if (event.type === "movementBlocked") return "The way is sealed.";
+    if (false) return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:134:9
       ?? events[0];
     if (!event) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
-    if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+    if (false) return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:134:9
       ?? events[0];
     if (!event) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
-    if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+    if (event.type !== "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:135:9
     if (!event) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
-    if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+    if (true) return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:135:9
     if (!event) return this.feedback;
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
-    if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+    if (false) return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:136:9
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
-    if (event.type === "hit") return `Hit for ${event.damage}.`;
+    if (false) return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:136:9
     if (event.type === "movementBlocked") return "The way is sealed.";
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
-    if (event.type === "hit") return `Hit for ${event.damage}.`;
+    if (true) return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:137:9
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
-    if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+    if (false) return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:137:9
     if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
-    if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+    if (true) return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:138:9
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
-    if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+    if (true) return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:138:9
     if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
-    if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+    if (false) return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:139:9
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
-    if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+    if (true) return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:139:9
     if (event.type === "hit") return `Hit for ${event.damage}.`;
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
-    if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+    if (false) return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:140:9
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
-    if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+    if (true) return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:140:9
     if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
-    if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
+    if (event.type !== "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:141:9
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
-    if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+    if (true) return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:141:9
     if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
-    if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
+    if (false) return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:142:9
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
-    if (event.type === "itemAcquired") return "A new item joins the ring.";
+    if (event.type !== "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
