[NoCoverage] ConditionalExpression
src/game/MainScene.ts:142:9
     if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
-    if (event.type === "itemAcquired") return "A new item joins the ring.";
+    if (false) return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:143:9
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
-    if (event.type === "itemUsed") return "The tonic restores your vitality.";
+    if (event.type !== "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:143:9
     if (event.type === "runDefeated") return "Run ended. The undercrypt claims you.";
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
-    if (event.type === "itemUsed") return "The tonic restores your vitality.";
+    if (false) return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:144:9
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
-    if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+    if (event.type !== "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] MethodExpression
src/game/MainScene.ts:144:54
     if (event.type === "runVictorious") return "The undercrypt yields. You are victorious.";
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
-    if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+    if (event.type === "equipmentChanged") return `${event.hand.toLowerCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:145:9
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
-    if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+    if (event.type !== "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:145:9
     if (event.type === "itemAcquired") return "A new item joins the ring.";
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
-    if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+    if (true) return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:146:9
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
-    if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+    if (true) return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
     if (event.type === "turned") return `Facing ${event.facing}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:146:9
     if (event.type === "itemUsed") return "The tonic restores your vitality.";
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
-    if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+    if (event.type !== "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
     if (event.type === "turned") return `Facing ${event.facing}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:147:9
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
-    if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+    if (false) return `Moved to ${event.position.x},${event.position.y}.`;
     if (event.type === "turned") return `Facing ${event.facing}.`;
     return "Action unavailable.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:147:9
     if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
-    if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+    if (event.type !== "moved") return `Moved to ${event.position.x},${event.position.y}.`;
     if (event.type === "turned") return `Facing ${event.facing}.`;
     return "Action unavailable.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:148:9
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
-    if (event.type === "turned") return `Facing ${event.facing}.`;
+    if (event.type !== "turned") return `Facing ${event.facing}.`;
     return "Action unavailable.";
   }

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:148:9
     if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
     if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
     if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
-    if (event.type === "turned") return `Facing ${event.facing}.`;
+    if (false) return `Facing ${event.facing}.`;
     return "Action unavailable.";
   }

[NoCoverage] BlockStatement
src/game/MainScene.ts:152:31
     return "Action unavailable.";
   }
 
-  private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
+  private publishMode(): void {}
 
   private publishCheckpointAvailability(): void {

[NoCoverage] StringLiteral
src/game/MainScene.ts:152:70
     return "Action unavailable.";
   }
 
-  private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
+  private publishMode(): void { window.dispatchEvent(new CustomEvent("", { detail: this.mode })); }
 
   private publishCheckpointAvailability(): void {

[NoCoverage] BlockStatement
src/game/MainScene.ts:154:49
 
   private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
 
-  private publishCheckpointAvailability(): void {
-    window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
-  }
+  private publishCheckpointAvailability(): void {}
 
   private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:155:73
   private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
 
   private publishCheckpointAvailability(): void {
-    window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+    window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: false }));
   }
 

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:155:73
   private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
 
   private publishCheckpointAvailability(): void {
-    window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+    window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: true }));
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:158:87
     window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
   }
 
-  private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {
-    this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
-  }
+  private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {}
 
   private configureAtmosphere(): void {

[NoCoverage] BlockStatement
src/game/MainScene.ts:162:39
     this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
   }
 
-  private configureAtmosphere(): void {
-    const filters = this.cameras.main.filters?.external;
-    if (!filters) return;
-
-    const grade = filters.addColorMatrix();
-    grade.colorMatrix.saturate(-0.18);
-    grade.colorMatrix.contrast(0.1, true);
-    filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
-  }
+  private configureAtmosphere(): void {}
 
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {

[NoCoverage] OptionalChaining
src/game/MainScene.ts:163:21
   }
 
   private configureAtmosphere(): void {
-    const filters = this.cameras.main.filters?.external;
+    const filters = this.cameras.main.filters.external;
     if (!filters) return;
 

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:164:9
 
   private configureAtmosphere(): void {
     const filters = this.cameras.main.filters?.external;
-    if (!filters) return;
+    if (false) return;
 
     const grade = filters.addColorMatrix();

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:164:9
 
   private configureAtmosphere(): void {
     const filters = this.cameras.main.filters?.external;
-    if (!filters) return;
+    if (filters) return;
 
     const grade = filters.addColorMatrix();

[NoCoverage] UnaryOperator
src/game/MainScene.ts:167:32
     if (!filters) return;
 
     const grade = filters.addColorMatrix();
-    grade.colorMatrix.saturate(-0.18);
+    grade.colorMatrix.saturate(+0.18);
     grade.colorMatrix.contrast(0.1, true);
     filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:168:37
 
     const grade = filters.addColorMatrix();
     grade.colorMatrix.saturate(-0.18);
-    grade.colorMatrix.contrast(0.1, true);
+    grade.colorMatrix.contrast(0.1, false);
     filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
   }

[NoCoverage] CallExpression
src/game/MainScene.ts:169:5
     const grade = filters.addColorMatrix();
     grade.colorMatrix.saturate(-0.18);
     grade.colorMatrix.contrast(0.1, true);
-    filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
+    ;
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:172:142
     filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
   }
 
-  private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const x = viewport.left + viewport.width * 0.5;
-    const y = viewport.top + viewport.height * 0.58;
-    const radius = Math.min(viewport.width, viewport.height) * 0.42;
-    const bands = [
-      { scale: 1, alpha: 0.018 },
-      { scale: 0.78, alpha: 0.024 },
-      { scale: 0.56, alpha: 0.034 },
-      { scale: 0.34, alpha: 0.048 }
-    ];
-    for (const band of bands) {
-      world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
-      world.fillCircle(x, y, radius * band.scale);
-    }
-  }
+  private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {}
 
   private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:173:31
   }
 
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const x = viewport.left + viewport.width * 0.5;
+    const x = viewport.left + viewport.width / 0.5;
     const y = viewport.top + viewport.height * 0.58;
     const radius = Math.min(viewport.width, viewport.height) * 0.42;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:173:15
   }
 
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const x = viewport.left + viewport.width * 0.5;
+    const x = viewport.left - viewport.width * 0.5;
     const y = viewport.top + viewport.height * 0.58;
     const radius = Math.min(viewport.width, viewport.height) * 0.42;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:174:15
 
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const x = viewport.left + viewport.width * 0.5;
-    const y = viewport.top + viewport.height * 0.58;
+    const y = viewport.top - viewport.height * 0.58;
     const radius = Math.min(viewport.width, viewport.height) * 0.42;
     const bands = [

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:174:30
 
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const x = viewport.left + viewport.width * 0.5;
-    const y = viewport.top + viewport.height * 0.58;
+    const y = viewport.top + viewport.height / 0.58;
     const radius = Math.min(viewport.width, viewport.height) * 0.42;
     const bands = [

[NoCoverage] MethodExpression
src/game/MainScene.ts:175:20
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const x = viewport.left + viewport.width * 0.5;
     const y = viewport.top + viewport.height * 0.58;
-    const radius = Math.min(viewport.width, viewport.height) * 0.42;
+    const radius = Math.max(viewport.width, viewport.height) * 0.42;
     const bands = [
       { scale: 1, alpha: 0.018 },

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:175:20
   private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const x = viewport.left + viewport.width * 0.5;
     const y = viewport.top + viewport.height * 0.58;
-    const radius = Math.min(viewport.width, viewport.height) * 0.42;
+    const radius = Math.min(viewport.width, viewport.height) / 0.42;
     const bands = [
       { scale: 1, alpha: 0.018 },

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:176:19
     const x = viewport.left + viewport.width * 0.5;
     const y = viewport.top + viewport.height * 0.58;
     const radius = Math.min(viewport.width, viewport.height) * 0.42;
-    const bands = [
-      { scale: 1, alpha: 0.018 },
-      { scale: 0.78, alpha: 0.024 },
-      { scale: 0.56, alpha: 0.034 },
-      { scale: 0.34, alpha: 0.048 }
-    ];
+    const bands = [];
     for (const band of bands) {
       world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:178:7
     const radius = Math.min(viewport.width, viewport.height) * 0.42;
     const bands = [
       { scale: 1, alpha: 0.018 },
-      { scale: 0.78, alpha: 0.024 },
+      {},
       { scale: 0.56, alpha: 0.034 },
       { scale: 0.34, alpha: 0.048 }

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:179:7
     const bands = [
       { scale: 1, alpha: 0.018 },
       { scale: 0.78, alpha: 0.024 },
-      { scale: 0.56, alpha: 0.034 },
+      {},
       { scale: 0.34, alpha: 0.048 }
     ];

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:180:7
       { scale: 1, alpha: 0.018 },
       { scale: 0.78, alpha: 0.024 },
       { scale: 0.56, alpha: 0.034 },
-      { scale: 0.34, alpha: 0.048 }
+      {}
     ];
     for (const band of bands) {

[NoCoverage] BlockStatement
src/game/MainScene.ts:182:31
       { scale: 0.56, alpha: 0.034 },
       { scale: 0.34, alpha: 0.048 }
     ];
-    for (const band of bands) {
-      world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
-      world.fillCircle(x, y, radius * band.scale);
-    }
+    for (const band of bands) {}
   }
 

[NoCoverage] CallExpression
src/game/MainScene.ts:183:7
       { scale: 0.34, alpha: 0.048 }
     ];
     for (const band of bands) {
-      world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
+      ;
       world.fillCircle(x, y, radius * band.scale);
     }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:184:30
     ];
     for (const band of bands) {
       world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
-      world.fillCircle(x, y, radius * band.scale);
+      world.fillCircle(x, y, radius / band.scale);
     }
   }

[NoCoverage] BlockStatement
src/game/MainScene.ts:188:135
     }
   }
 
-  private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const edge = Math.max(18, Math.round(viewport.width * 0.035));
-    world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
-    world.fillRect(viewport.left, viewport.top, viewport.width, edge);
-    world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
-    world.fillRect(viewport.left, viewport.top, edge, viewport.height);
-    world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
-  }
+  private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {}
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:189:42
   }
 
   private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const edge = Math.max(18, Math.round(viewport.width * 0.035));
+    const edge = Math.max(18, Math.round(viewport.width / 0.035));
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);

[NoCoverage] MethodExpression
src/game/MainScene.ts:189:18
   }
 
   private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-    const edge = Math.max(18, Math.round(viewport.width * 0.035));
+    const edge = Math.min(18, Math.round(viewport.width * 0.035));
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);

[NoCoverage] CallExpression
src/game/MainScene.ts:190:5
 
   private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const edge = Math.max(18, Math.round(viewport.width * 0.035));
-    world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
+    ;
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);

[NoCoverage] CallExpression
src/game/MainScene.ts:191:5
   private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
     const edge = Math.max(18, Math.round(viewport.width * 0.035));
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
-    world.fillRect(viewport.left, viewport.top, viewport.width, edge);
+    ;
     world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top, edge, viewport.height);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:192:35
     const edge = Math.max(18, Math.round(viewport.width * 0.035));
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
-    world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
+    world.fillRect(viewport.left, viewport.top + viewport.height + edge, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top, edge, viewport.height);
     world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:192:35
     const edge = Math.max(18, Math.round(viewport.width * 0.035));
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
-    world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
+    world.fillRect(viewport.left, viewport.top - viewport.height - edge, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top, edge, viewport.height);
     world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);

[NoCoverage] CallExpression
src/game/MainScene.ts:193:5
     world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
-    world.fillRect(viewport.left, viewport.top, edge, viewport.height);
+    ;
     world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
   }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:194:20
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top, edge, viewport.height);
-    world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
+    world.fillRect(viewport.left + viewport.width + edge, viewport.top, edge, viewport.height);
   }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:194:20
     world.fillRect(viewport.left, viewport.top, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
     world.fillRect(viewport.left, viewport.top, edge, viewport.height);
-    world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
+    world.fillRect(viewport.left - viewport.width - edge, viewport.top, edge, viewport.height);
   }
 

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:198:9
   }
 
-    if (!this.perspectiveDebug) return;
+    if (this.perspectiveDebug) return;
 
     world.lineStyle(2, 0xf4e7a1, 0.95);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:198:9
   }
 
-    if (!this.perspectiveDebug) return;
+    if (false) return;
 
     world.lineStyle(2, 0xf4e7a1, 0.95);

[NoCoverage] CallExpression
src/game/MainScene.ts:200:5
     if (!this.perspectiveDebug) return;
 
-    world.lineStyle(2, 0xf4e7a1, 0.95);
+    ;
     for (let depth = 1; depth <= 4; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:201:25
     if (!this.perspectiveDebug) return;
 
     world.lineStyle(2, 0xf4e7a1, 0.95);
-    for (let depth = 1; depth <= 4; depth += 1) {
+    for (let depth = 1; false; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
       world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);

[NoCoverage] AssignmentOperator
src/game/MainScene.ts:201:37
     if (!this.perspectiveDebug) return;
 
     world.lineStyle(2, 0xf4e7a1, 0.95);
-    for (let depth = 1; depth <= 4; depth += 1) {
+    for (let depth = 1; depth <= 4; depth -= 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
       world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:203:47
     world.lineStyle(2, 0xf4e7a1, 0.95);
     for (let depth = 1; depth <= 4; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
-      world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
+      world.strokeRect(frame.left, frame.top, frame.right + frame.left, frame.bottom - frame.top);
       this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
     }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:203:73
     world.lineStyle(2, 0xf4e7a1, 0.95);
     for (let depth = 1; depth <= 4; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
-      world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
+      world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom + frame.top);
       this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
     }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:204:39
     for (let depth = 1; depth <= 4; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
       world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
-      this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
+      this.addDebugLabel(`D${depth}`, frame.left - 5, frame.top + 5);
     }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:204:55
     for (let depth = 1; depth <= 4; depth += 1) {
       const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
       world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
-      this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
+      this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top - 5);
     }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:51
     const near = screenFrame(PORTAL_FRAMES[0], viewport);
     const far = screenFrame(PORTAL_FRAMES[1], viewport);
     const first = intervalQuads(near, far);
-    this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+    this.addDebugLabel("CEILING", viewport.left + viewport.width / 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
