[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:35
     const near = screenFrame(PORTAL_FRAMES[0], viewport);
     const far = screenFrame(PORTAL_FRAMES[1], viewport);
     const first = intervalQuads(near, far);
-    this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+    this.addDebugLabel("CEILING", viewport.left - viewport.width * 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:33
     const far = screenFrame(PORTAL_FRAMES[1], viewport);
     const first = intervalQuads(near, far);
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
-    this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+    this.addDebugLabel("FLOOR", viewport.left - viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:87
     const far = screenFrame(PORTAL_FRAMES[1], viewport);
     const first = intervalQuads(near, far);
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
-    this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+    this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height / 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:91
     const first = intervalQuads(near, far);
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
-    this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+    this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height / 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:37
     const first = intervalQuads(near, far);
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
-    this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+    this.addDebugLabel("LEFT WALL", viewport.left - viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:92
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
-    this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+    this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height / 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:77
     this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
-    this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+    this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top - viewport.height * 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));

[NoCoverage] CallExpression
src/game/MainScene.ts:214:5
     this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
-    world.lineStyle(1, 0x9ed4d8, 0.9);
+    ;
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
 

[NoCoverage] ArrowFunction
src/game/MainScene.ts:215:113
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);
-    [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+    [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(() => undefined), true));
 
     const terminatingWall = cells.find((cell) => cell.blocked);

[NoCoverage] ArrowFunction
src/game/MainScene.ts:215:75
     this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
     this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
     world.lineStyle(1, 0x9ed4d8, 0.9);
-    [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+    [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach(() => undefined);
 
     const terminatingWall = cells.find((cell) => cell.blocked);

[NoCoverage] ArrowFunction
src/game/MainScene.ts:217:40
     world.lineStyle(1, 0x9ed4d8, 0.9);
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
 
-    const terminatingWall = cells.find((cell) => cell.blocked);
+    const terminatingWall = cells.find(() => undefined);
     if (terminatingWall) {
       const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);

[NoCoverage] BlockStatement
src/game/MainScene.ts:218:26
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
 
     const terminatingWall = cells.find((cell) => cell.blocked);
-    if (terminatingWall) {
-      const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
-      this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
-    } else {
+    if (terminatingWall) {} else {
       const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);
       this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:218:9
     [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
 
     const terminatingWall = cells.find((cell) => cell.blocked);
-    if (terminatingWall) {
+    if (true) {
       const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
       this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:220:52
     const terminatingWall = cells.find((cell) => cell.blocked);
     if (terminatingWall) {
       const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
-      this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
+      this.addDebugLabel("FRONT WALL", frame.left, frame.bottom - 6, "#ffb38a");
     } else {
       const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);

[NoCoverage] StringLiteral
src/game/MainScene.ts:220:26
     const terminatingWall = cells.find((cell) => cell.blocked);
     if (terminatingWall) {
       const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
-      this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
+      this.addDebugLabel("", frame.left, frame.bottom + 6, "#ffb38a");
     } else {
       const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);

[NoCoverage] BlockStatement
src/game/MainScene.ts:221:12
     if (terminatingWall) {
       const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
       this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
-    } else {
-      const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);
-      this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
-    }
+    } else {}
   }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:223:49
       this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
     } else {
       const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);
-      this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
+      this.addDebugLabel("OPENING", frame.left, frame.bottom - 6, "#9ed4d8");
     }
   }

[NoCoverage] StringLiteral
src/game/MainScene.ts:223:26
       this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
     } else {
       const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);
-      this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
+      this.addDebugLabel("", frame.left, frame.bottom + 6, "#9ed4d8");
     }
   }

[NoCoverage] CallExpression
src/game/MainScene.ts:228:5
   }
 
   private renderState(): void {
-    this.entitySprites.clear();
+    ;
     this.flameSprites.clear();
     this.children.removeAll(true);

[NoCoverage] CallExpression
src/game/MainScene.ts:229:5
 
   private renderState(): void {
     this.entitySprites.clear();
-    this.flameSprites.clear();
+    ;
     this.children.removeAll(true);
     const { width, height } = this.scale;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:230:29
   private renderState(): void {
     this.entitySprites.clear();
     this.flameSprites.clear();
-    this.children.removeAll(true);
+    this.children.removeAll(false);
     const { width, height } = this.scale;
     const viewport = portalViewport(width, height);

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:238:21
     const encounterDefinition = this.state.encounter ? monsterById(this.state.encounter.definitionId) : undefined;
     Object.defineProperty(window, "__TARMIN_RENDERER__", {
-      configurable: true,
+      configurable: false,
       get: () => Object.freeze({
         position: this.state.player.position,

[NoCoverage] ArrowFunction
src/game/MainScene.ts:242:50
       get: () => Object.freeze({
         position: this.state.player.position,
         facing: this.state.player.facing,
-        visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
+        visibleDepth: Math.max(...primitives.map(() => undefined), 0),
         features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),

[NoCoverage] MethodExpression
src/game/MainScene.ts:242:23
       get: () => Object.freeze({
         position: this.state.player.position,
         facing: this.state.player.facing,
-        visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
+        visibleDepth: Math.min(...primitives.map(primitive => primitive.geometry.depth), 0),
         features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),

[NoCoverage] ArrowFunction
src/game/MainScene.ts:243:38
         position: this.state.player.position,
         facing: this.state.player.facing,
         visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
-        features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
+        features: scene.features.map(() => undefined),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
         transition: this.mode === "transitioning",

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:243:52
         position: this.state.player.position,
         facing: this.state.player.facing,
         visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
-        features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
+        features: scene.features.map((feature) => ({})),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
         transition: this.mode === "transitioning",

[NoCoverage] ArrowFunction
src/game/MainScene.ts:244:40
         facing: this.state.player.facing,
         visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
         features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
-        primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
+        primitiveTypes: primitives.map(() => undefined),
         transition: this.mode === "transitioning",
         mode: this.mode,

[NoCoverage] EqualityOperator
src/game/MainScene.ts:245:21
         visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
         features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
-        transition: this.mode === "transitioning",
+        transition: this.mode !== "transitioning",
         mode: this.mode,
         runStatus: this.state.runStatus,

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:245:21
         visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
         features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
         primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
-        transition: this.mode === "transitioning",
+        transition: false,
         mode: this.mode,
         runStatus: this.state.runStatus,

[NoCoverage] ArrowFunction
src/game/MainScene.ts:261:32
         selectedRingIndex: this.state.selectedRingIndex,
         loot: this.state.loot,
         objective: this.state.objective,
-        entities: entities.map((entity) => ({ id: entity.id, definitionId: entity.definitionId, depth: entity.depth, lightLevel: entity.lightLevel })),
+        entities: entities.map(() => undefined),
         firstPerson: resolveFirstPersonPresentation(this.state),

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:25
 
     for (const primitive of primitives) {
       const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height })) as unknown as PortalQuad;
-      const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+      const isOpening = true;
       mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:25
 
     for (const primitive of primitives) {
       const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height })) as unknown as PortalQuad;
-      const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+      const isOpening = false;
       mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));

[NoCoverage] CallExpression
src/game/MainScene.ts:271:7
       const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height })) as unknown as PortalQuad;
       const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
-      mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
+      ;
       mesh.setRenderAsTriangles(true);
       if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:272:33
       const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
       mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
-      mesh.setRenderAsTriangles(true);
+      mesh.setRenderAsTriangles(false);
       if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
     }

[NoCoverage] LogicalOperator
src/game/MainScene.ts:273:11
       mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
       mesh.setRenderAsTriangles(true);
-      if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+      if (primitive.geometry.surface === "front" || isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
     }
 

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:273:11
       mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
       mesh.setRenderAsTriangles(true);
-      if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+      if (false) mesh.setTint(shadeColor(0xffffff, 0.08));
     }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:276:76
       if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
     }
 
-    this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) % 4);
+    this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) * 4);
 
     const world = this.add.graphics();

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:276:87
       if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
     }
 
-    this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) % 4);
+    this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs * 180) % 4);
 
     const world = this.add.graphics();

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:280:112
 
     const world = this.add.graphics();
     for (const primitive of primitives) {
-      const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));
     }

[NoCoverage] ArrowFunction
src/game/MainScene.ts:280:50
 
     const world = this.add.graphics();
     for (const primitive of primitives) {
-      const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = primitive.geometry.quad.map(() => undefined);
     }

[NoCoverage] CallExpression
src/game/MainScene.ts:284:5
     }
 
-    this.renderTorchLight(world, viewport);
+    ;
     this.renderEntities(entities, viewport, billboardFrameAt(this.presentationTimeMs));
     this.renderFog(world, viewport);

[NoCoverage] CallExpression
src/game/MainScene.ts:285:5
     }
 
     this.renderTorchLight(world, viewport);
-    this.renderEntities(entities, viewport, billboardFrameAt(this.presentationTimeMs));
+    ;
     this.renderFog(world, viewport);
     this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));

[NoCoverage] CallExpression
src/game/MainScene.ts:286:5
 
     this.renderTorchLight(world, viewport);
     this.renderEntities(entities, viewport, billboardFrameAt(this.presentationTimeMs));
-    this.renderFog(world, viewport);
+    ;
     this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));
 

[NoCoverage] CallExpression
src/game/MainScene.ts:287:5
     this.renderTorchLight(world, viewport);
     this.renderEntities(entities, viewport, billboardFrameAt(this.presentationTimeMs));
     this.renderFog(world, viewport);
-    this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));
+    ;
 
     const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];

[NoCoverage] ArrowFunction
src/game/MainScene.ts:289:52
     this.renderFog(world, viewport);
     this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));
 
-    const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];
+    const debugDepths = [...new Set(primitives.map(() => undefined))];

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:289:25
     this.renderFog(world, viewport);
     this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));
 
-    const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];
+    const debugDepths = [];

[NoCoverage] CallExpression
src/game/MainScene.ts:292:5
     const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];
-    world.lineStyle(2, DUNGEON_PALETTE.boundary, 0.9);
+    ;
     world.strokeRect(viewport.left, viewport.top, viewport.width, viewport.height);

[NoCoverage] CallExpression
src/game/MainScene.ts:293:5
     world.lineStyle(2, DUNGEON_PALETTE.boundary, 0.9);
-    world.strokeRect(viewport.left, viewport.top, viewport.width, viewport.height);
+    ;
   }

[NoCoverage] BlockStatement
src/game/MainScene.ts:297:105
   }
 
-  private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
-    const width = Math.min(this.scale.width * 0.38, 480);
-    const height = width * (36 / 58);
-    this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
-      .setDisplaySize(width, height)
-      .setDepth(1000)
-      .setAlpha(0.94);
-  }
+  private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {}
 
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:298:28
   }
 
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
-    const width = Math.min(this.scale.width * 0.38, 480);
+    const width = Math.min(this.scale.width / 0.38, 480);
     const height = width * (36 / 58);
     this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)

[NoCoverage] MethodExpression
src/game/MainScene.ts:298:19
   }
 
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
-    const width = Math.min(this.scale.width * 0.38, 480);
+    const width = Math.max(this.scale.width * 0.38, 480);
     const height = width * (36 / 58);
     this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:299:29
 
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
     const width = Math.min(this.scale.width * 0.38, 480);
-    const height = width * (36 / 58);
+    const height = width * (36 * 58);
     this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
       .setDisplaySize(width, height)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:299:20
 
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
     const width = Math.min(this.scale.width * 0.38, 480);
-    const height = width * (36 / 58);
+    const height = width / (36 / 58);
     this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
       .setDisplaySize(width, height)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:42
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
     const width = Math.min(this.scale.width * 0.38, 480);
     const height = width * (36 / 58);
-    this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+    this.add.image(this.scale.width / 2, this.scale.height - height / 2 - 4, presentation.assetId)
       .setDisplaySize(width, height)
       .setDepth(1000)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:42
   private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
     const width = Math.min(this.scale.width * 0.38, 480);
     const height = width * (36 / 58);
-    this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+    this.add.image(this.scale.width / 2, this.scale.height + height / 2 + 4, presentation.assetId)
       .setDisplaySize(width, height)
       .setDepth(1000)

[NoCoverage] BlockStatement
src/game/MainScene.ts:307:37
   }
 
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {
-    for (const feature of features) {
-      const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-      const left = Math.min(...points.map((point) => point.x));
-      const right = Math.max(...points.map((point) => point.x));
-      const top = Math.min(...points.map((point) => point.y));
-      const bottom = Math.max(...points.map((point) => point.y));
-      if (feature.kind === "archway") {
-        this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
-          .setDisplaySize(right - left, bottom - top)
-          .setAlpha(feature.lightLevel)
-          .setDepth(50 - feature.depth);
-        continue;
-      }
-      this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
-        .setDisplaySize(right - left, bottom - top)
-        .setAlpha(feature.lightLevel)
-        .setDepth(70 - feature.depth);
-      const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
-        .setCrop(frame * 32, 0, 32, 48)
-        .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
-        .setAlpha(feature.lightLevel)
-        .setDepth(80 - feature.depth);
-      this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
-    }
+    for (const feature of features) {}
   }
 

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:116
 
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {
     for (const feature of features) {
-      const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y / viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));
