[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:101
 
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {
     for (const feature of features) {
-      const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:309:43
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {
     for (const feature of features) {
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-      const left = Math.min(...points.map((point) => point.x));
+      const left = Math.min(...points.map(() => undefined));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));

[NoCoverage] MethodExpression
src/game/MainScene.ts:309:20
   private renderFeatures(features: readonly ProjectedFeature[], viewport: { left: number; top: number; width: number; height: number }, frame: number): void {
     for (const feature of features) {
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-      const left = Math.min(...points.map((point) => point.x));
+      const left = Math.max(...points.map(point => point.x));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:310:44
     for (const feature of features) {
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
-      const right = Math.max(...points.map((point) => point.x));
+      const right = Math.max(...points.map(() => undefined));
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));

[NoCoverage] MethodExpression
src/game/MainScene.ts:310:21
     for (const feature of features) {
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
-      const right = Math.max(...points.map((point) => point.x));
+      const right = Math.min(...points.map(point => point.x));
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:311:42
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));
-      const top = Math.min(...points.map((point) => point.y));
+      const top = Math.min(...points.map(() => undefined));
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {

[NoCoverage] MethodExpression
src/game/MainScene.ts:311:19
       const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));
-      const top = Math.min(...points.map((point) => point.y));
+      const top = Math.max(...points.map(point => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {

[NoCoverage] ArrowFunction
src/game/MainScene.ts:312:45
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));
-      const bottom = Math.max(...points.map((point) => point.y));
+      const bottom = Math.max(...points.map(() => undefined));
       if (feature.kind === "archway") {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")

[NoCoverage] MethodExpression
src/game/MainScene.ts:312:22
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));
-      const bottom = Math.max(...points.map((point) => point.y));
+      const bottom = Math.min(...points.map(point => point.y));
       if (feature.kind === "archway") {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")

[NoCoverage] EqualityOperator
src/game/MainScene.ts:313:11
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
-      if (feature.kind === "archway") {
+      if (feature.kind !== "archway") {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
           .setDisplaySize(right - left, bottom - top)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:313:11
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
-      if (feature.kind === "archway") {
+      if (true) {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
           .setDisplaySize(right - left, bottom - top)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:45
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {
-        this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+        this.add.image((left + right) / 2, (top - bottom) / 2, "archway-stone")
           .setDisplaySize(right - left, bottom - top)
           .setAlpha(feature.lightLevel)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:24
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {
-        this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+        this.add.image((left + right) * 2, (top + bottom) / 2, "archway-stone")
           .setDisplaySize(right - left, bottom - top)
           .setAlpha(feature.lightLevel)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:315:27
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
-          .setDisplaySize(right - left, bottom - top)
+          .setDisplaySize(right + left, bottom - top)
           .setAlpha(feature.lightLevel)
           .setDepth(50 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:315:41
       const bottom = Math.max(...points.map((point) => point.y));
       if (feature.kind === "archway") {
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
-          .setDisplaySize(right - left, bottom - top)
+          .setDisplaySize(right - left, bottom + top)
           .setAlpha(feature.lightLevel)
           .setDepth(50 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:317:21
         this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
           .setDisplaySize(right - left, bottom - top)
           .setAlpha(feature.lightLevel)
-          .setDepth(50 - feature.depth);
+          .setDepth(50 + feature.depth);
         continue;
       }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:43
           .setDepth(50 - feature.depth);
         continue;
       }
-      this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+      this.add.image((left + right) / 2, (top - bottom) / 2, "torch-sconce")
         .setDisplaySize(right - left, bottom - top)
         .setAlpha(feature.lightLevel)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:23
           .setDepth(50 - feature.depth);
         continue;
       }
-      this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+      this.add.image((left - right) / 2, (top + bottom) / 2, "torch-sconce")
         .setDisplaySize(right - left, bottom - top)
         .setAlpha(feature.lightLevel)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:321:39
         continue;
       }
       this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
-        .setDisplaySize(right - left, bottom - top)
+        .setDisplaySize(right - left, bottom + top)
         .setAlpha(feature.lightLevel)
         .setDepth(70 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:321:25
         continue;
       }
       this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
-        .setDisplaySize(right - left, bottom - top)
+        .setDisplaySize(right + left, bottom - top)
         .setAlpha(feature.lightLevel)
         .setDepth(70 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:323:19
       this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
         .setDisplaySize(right - left, bottom - top)
         .setAlpha(feature.lightLevel)
-        .setDepth(70 - feature.depth);
+        .setDepth(70 + feature.depth);
       const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
         .setCrop(frame * 32, 0, 32, 48)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:62
         .setDisplaySize(right - left, bottom - top)
         .setAlpha(feature.lightLevel)
         .setDepth(70 - feature.depth);
-      const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+      const flame = this.add.image((left + right) / 2, top + (bottom - top) / 0.3, "torch-flame")
         .setCrop(frame * 32, 0, 32, 48)
         .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:36
         .setDisplaySize(right - left, bottom - top)
         .setAlpha(feature.lightLevel)
         .setDepth(70 - feature.depth);
-      const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+      const flame = this.add.image((left + right) * 2, top + (bottom - top) * 0.3, "torch-flame")
         .setCrop(frame * 32, 0, 32, 48)
         .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:325:18
         .setAlpha(feature.lightLevel)
         .setDepth(70 - feature.depth);
       const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
-        .setCrop(frame * 32, 0, 32, 48)
+        .setCrop(frame / 32, 0, 32, 48)
         .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
         .setAlpha(feature.lightLevel)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:47
         .setDepth(70 - feature.depth);
       const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
         .setCrop(frame * 32, 0, 32, 48)
-        .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+        .setDisplaySize((right - left) * 0.7, (bottom - top) / 0.75)
         .setAlpha(feature.lightLevel)
         .setDepth(80 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:25
         .setDepth(70 - feature.depth);
       const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
         .setCrop(frame * 32, 0, 32, 48)
-        .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+        .setDisplaySize((right - left) / 0.7, (bottom - top) * 0.75)
         .setAlpha(feature.lightLevel)
         .setDepth(80 - feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:328:19
         .setCrop(frame * 32, 0, 32, 48)
         .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
         .setAlpha(feature.lightLevel)
-        .setDepth(80 - feature.depth);
+        .setDepth(80 + feature.depth);
       this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
     }

[NoCoverage] LogicalOperator
src/game/MainScene.ts:329:68
         .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
         .setAlpha(feature.lightLevel)
         .setDepth(80 - feature.depth);
-      this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
+      this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface && ""}`, flame);
     }
   }

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:335:100
 
   private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {
     for (const entity of entities) {
-      const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:335:38
 
   private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {
     for (const entity of entities) {
-      const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+      const points = entity.quad.map(() => undefined);
       const left = Math.min(...points.map((point) => point.x));
       const right = Math.max(...points.map((point) => point.x));

[NoCoverage] MethodExpression
src/game/MainScene.ts:336:20
   private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {
     for (const entity of entities) {
       const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-      const left = Math.min(...points.map((point) => point.x));
+      const left = Math.max(...points.map(point => point.x));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:336:43
   private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {
     for (const entity of entities) {
       const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-      const left = Math.min(...points.map((point) => point.x));
+      const left = Math.min(...points.map(() => undefined));
       const right = Math.max(...points.map((point) => point.x));
       const top = Math.min(...points.map((point) => point.y));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:341:22
       const top = Math.min(...points.map((point) => point.y));
       const bottom = Math.max(...points.map((point) => point.y));
-      sprite.setCrop(frame * 32, 0, 32, 48);
+      sprite.setCrop(frame / 32, 0, 32, 48);
       // Keep near billboards above far billboards independent of display-list order.
       sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:66
       sprite.setCrop(frame * 32, 0, 32, 48);
       // Keep near billboards above far billboards independent of display-list order.
-      sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+      sprite.setDisplaySize(right - left, bottom - top).setDepth(100 - PORTAL_FRAMES.length - entity.depth);
       sprite.setAlpha(entity.lightLevel);
       this.entitySprites.set(entity.id, sprite);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:29
       sprite.setCrop(frame * 32, 0, 32, 48);
       // Keep near billboards above far billboards independent of display-list order.
-      sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+      sprite.setDisplaySize(right + left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
       sprite.setAlpha(entity.lightLevel);
       this.entitySprites.set(entity.id, sprite);

[NoCoverage] CallExpression
src/game/MainScene.ts:344:7
       sprite.setCrop(frame * 32, 0, 32, 48);
       // Keep near billboards above far billboards independent of display-list order.
       sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
-      sprite.setAlpha(entity.lightLevel);
+      ;
       this.entitySprites.set(entity.id, sprite);
     }

[NoCoverage] CallExpression
src/game/MainScene.ts:345:7
       // Keep near billboards above far billboards independent of display-list order.
       sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
       sprite.setAlpha(entity.lightLevel);
-      this.entitySprites.set(entity.id, sprite);
+      ;
     }
   }

[NoCoverage] BlockStatement
src/game/MainScene.ts:349:62
     }
   }
 
-  private itemName(instanceId: string | null): string | null {
-    if (!instanceId) return null;
-    const instance = this.state.items.find((item) => item.id === instanceId);
-    return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
-  }
+  private itemName(instanceId: string | null): string | null {}
 
   private itemDetail(instanceId: string | null): string {

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:350:9
   }
 
   private itemName(instanceId: string | null): string | null {
-    if (!instanceId) return null;
+    if (true) return null;
     const instance = this.state.items.find((item) => item.id === instanceId);
     return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:350:9
   }
 
   private itemName(instanceId: string | null): string | null {
-    if (!instanceId) return null;
+    if (false) return null;
     const instance = this.state.items.find((item) => item.id === instanceId);
     return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;

[NoCoverage] ArrowFunction
src/game/MainScene.ts:351:44
 
   private itemName(instanceId: string | null): string | null {
     if (!instanceId) return null;
-    const instance = this.state.items.find((item) => item.id === instanceId);
+    const instance = this.state.items.find(() => undefined);
     return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
   }

[NoCoverage] EqualityOperator
src/game/MainScene.ts:351:54
 
   private itemName(instanceId: string | null): string | null {
     if (!instanceId) return null;
-    const instance = this.state.items.find((item) => item.id === instanceId);
+    const instance = this.state.items.find((item) => item.id !== instanceId);
     return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
   }

[NoCoverage] LogicalOperator
src/game/MainScene.ts:352:23
   private itemName(instanceId: string | null): string | null {
     if (!instanceId) return null;
     const instance = this.state.items.find((item) => item.id === instanceId);
-    return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
+    return instance ? itemById(instance.definitionId)?.name && instance.definitionId : null;
   }
 

[NoCoverage] OptionalChaining
src/game/MainScene.ts:352:23
   private itemName(instanceId: string | null): string | null {
     if (!instanceId) return null;
     const instance = this.state.items.find((item) => item.id === instanceId);
-    return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
+    return instance ? itemById(instance.definitionId).name ?? instance.definitionId : null;
   }
 

[NoCoverage] BlockStatement
src/game/MainScene.ts:355:57
     return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
   }
 
-  private itemDetail(instanceId: string | null): string {
-    if (!instanceId) return "No item equipped";
-    const instance = this.state.items.find((item) => item.id === instanceId);
-    const definition = instance ? itemById(instance.definitionId) : undefined;
-    if (!definition) return "Unknown item";
-    if (definition.attack) return `STRIKE +${definition.attack}`;
-    if (definition.defense) return `GUARD +${definition.defense}`;
-    if (definition.healing) return `RESTORE +${definition.healing}`;
-    return "Treasure carried";
-  }
+  private itemDetail(instanceId: string | null): string {}
 }
 

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:356:9
   }
 
   private itemDetail(instanceId: string | null): string {
-    if (!instanceId) return "No item equipped";
+    if (true) return "No item equipped";
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:356:9
   }
 
   private itemDetail(instanceId: string | null): string {
-    if (!instanceId) return "No item equipped";
+    if (instanceId) return "No item equipped";
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;

[NoCoverage] ArrowFunction
src/game/MainScene.ts:357:44
 
   private itemDetail(instanceId: string | null): string {
     if (!instanceId) return "No item equipped";
-    const instance = this.state.items.find((item) => item.id === instanceId);
+    const instance = this.state.items.find(() => undefined);
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:357:54
 
   private itemDetail(instanceId: string | null): string {
     if (!instanceId) return "No item equipped";
-    const instance = this.state.items.find((item) => item.id === instanceId);
+    const instance = this.state.items.find((item) => true);
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:359:9
     if (!instanceId) return "No item equipped";
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;
-    if (!definition) return "Unknown item";
+    if (false) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:359:9
     if (!instanceId) return "No item equipped";
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;
-    if (!definition) return "Unknown item";
+    if (definition) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:360:9
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";
-    if (definition.attack) return `STRIKE +${definition.attack}`;
+    if (true) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;
     if (definition.healing) return `RESTORE +${definition.healing}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:360:9
     const instance = this.state.items.find((item) => item.id === instanceId);
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";
-    if (definition.attack) return `STRIKE +${definition.attack}`;
+    if (false) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;
     if (definition.healing) return `RESTORE +${definition.healing}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:361:9
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
-    if (definition.defense) return `GUARD +${definition.defense}`;
+    if (true) return `GUARD +${definition.defense}`;
     if (definition.healing) return `RESTORE +${definition.healing}`;
     return "Treasure carried";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:361:9
     const definition = instance ? itemById(instance.definitionId) : undefined;
     if (!definition) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
-    if (definition.defense) return `GUARD +${definition.defense}`;
+    if (false) return `GUARD +${definition.defense}`;
     if (definition.healing) return `RESTORE +${definition.healing}`;
     return "Treasure carried";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:362:9
     if (!definition) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;
-    if (definition.healing) return `RESTORE +${definition.healing}`;
+    if (true) return `RESTORE +${definition.healing}`;
     return "Treasure carried";
   }

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:362:9
     if (!definition) return "Unknown item";
     if (definition.attack) return `STRIKE +${definition.attack}`;
     if (definition.defense) return `GUARD +${definition.defense}`;
-    if (definition.healing) return `RESTORE +${definition.healing}`;
+    if (false) return `RESTORE +${definition.healing}`;
     return "Treasure carried";
   }
