[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:12:87
 
 const DELTAS = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } } as const;
 
-function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
-  const forward = DELTAS[state.player.facing];
-  const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
-  return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
-}
+function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {}
 
 export function projectDungeon(state: GameState): SceneDescription {

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:14:19
 
 function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
   const forward = DELTAS[state.player.facing];
-  const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+  const lateral = side !== "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
   return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
 }

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:14:19
 
 function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
   const forward = DELTAS[state.player.facing];
-  const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+  const lateral = true ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
   return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
 }

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:15
 function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
   const forward = DELTAS[state.player.facing];
   const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
-  return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+  return { x: state.player.position.x - forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
 }
 

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:15
 function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
   const forward = DELTAS[state.player.facing];
   const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
-  return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+  return { x: state.player.position.x + forward.x * distance - lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
 }
 

[Survived] ArrayDeclaration
src/renderer/perspective/perspectiveRenderer.ts:19:36
 }
 
 export function projectDungeon(state: GameState): SceneDescription {
-  const result: ScenePrimitive[] = [];
+  const result: ScenePrimitive[] = ["Stryker was here"];
   const features: ProjectedFeature[] = [];
   const forward = DELTAS[state.player.facing];

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:22:48
   const result: ScenePrimitive[] = [];
   const features: ProjectedFeature[] = [];
   const forward = DELTAS[state.player.facing];
-  const cells = [1, 2, 3, 4].map((distance) => {
-    const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
-    return { distance, point, kind: visibleCellKind(state, point) };
-  });
+  const cells = [1, 2, 3, 4].map((distance) => {});
   const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:50
   const features: ProjectedFeature[] = [];
   const forward = DELTAS[state.player.facing];
   const cells = [1, 2, 3, 4].map((distance) => {
-    const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+    const point = { x: state.player.position.x + forward.x / distance, y: state.player.position.y + forward.y * distance };
     return { distance, point, kind: visibleCellKind(state, point) };
   });

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:75
   const features: ProjectedFeature[] = [];
   const forward = DELTAS[state.player.facing];
   const cells = [1, 2, 3, 4].map((distance) => {
-    const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+    const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y - forward.y * distance };
     return { distance, point, kind: visibleCellKind(state, point) };
   });

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:26:72
     const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
     return { distance, point, kind: visibleCellKind(state, point) };
   });
-  const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+  const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind === "open-door");
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;
   for (let index = startIndex; index >= 0; index -= 1) {

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:26:45
     const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
     return { distance, point, kind: visibleCellKind(state, point) };
   });
-  const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+  const blocker = cells.findIndex((cell) => cell.kind !== "passage" || cell.kind !== "open-door");
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;
   for (let index = startIndex; index >= 0; index -= 1) {

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:27:39
     return { distance, point, kind: visibleCellKind(state, point) };
   });
   const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
-  const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+  const startIndex = blocker === -1 ? cells.length + 1 : blocker;
   for (let index = startIndex; index >= 0; index -= 1) {
     const cell = cells[index];

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:27:22
     return { distance, point, kind: visibleCellKind(state, point) };
   });
   const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
-  const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+  const startIndex = true ? cells.length - 1 : blocker;
   for (let index = startIndex; index >= 0; index -= 1) {
     const cell = cells[index];

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:28:32
   });
   const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;
-  for (let index = startIndex; index >= 0; index -= 1) {
+  for (let index = startIndex; index < 0; index -= 1) {
     const cell = cells[index];
     const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);

[Survived] AssignmentOperator
src/renderer/perspective/perspectiveRenderer.ts:28:44
   });
   const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;
-  for (let index = startIndex; index >= 0; index -= 1) {
+  for (let index = startIndex; index >= 0; index += 1) {
     const cell = cells[index];
     const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:30:69
   const startIndex = blocker === -1 ? cells.length - 1 : blocker;
   for (let index = startIndex; index >= 0; index -= 1) {
     const cell = cells[index];
-    const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);
+    const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index - 1]);
     if (cell.kind === "passage" || cell.kind === "open-door") {

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:31:9
   for (let index = startIndex; index >= 0; index -= 1) {
     const cell = cells[index];
     const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);
-    if (cell.kind === "passage" || cell.kind === "open-door") {
+    if (true) {
     }

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:31:9
   for (let index = startIndex; index >= 0; index -= 1) {
     const cell = cells[index];
     const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);
-    if (cell.kind === "passage" || cell.kind === "open-door") {
+    if (cell.kind === "passage" && cell.kind === "open-door") {
     }

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:34:60
     if (cell.kind === "passage" || cell.kind === "open-door") {
     }
-    addPrimitive(result, state, cell.distance, cell.point, "ceiling", cell.kind, quads.ceiling);
+    addPrimitive(result, state, cell.distance, cell.point, "", cell.kind, quads.ceiling);
     addPrimitive(result, state, cell.distance, cell.point, "floor", cell.kind, quads.floor);
     const leftPoint = sidePoint(state, cell.distance, "left");

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:42:9
     const rightKind = visibleCellKind(state, rightPoint);
     addPrimitive(result, state, cell.distance, leftPoint, "left", leftKind, quads.leftWall);
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
-    if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+    if (leftKind !== "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
     if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
     if (cell.kind !== "passage" && cell.kind !== "open-door") {

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:42:9
     const rightKind = visibleCellKind(state, rightPoint);
     addPrimitive(result, state, cell.distance, leftPoint, "left", leftKind, quads.leftWall);
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
-    if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+    if (true) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
     if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
     if (cell.kind !== "passage" && cell.kind !== "open-door") {

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:43:9
     addPrimitive(result, state, cell.distance, leftPoint, "left", leftKind, quads.leftWall);
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
     if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
-    if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+    if (true) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
     if (cell.kind !== "passage" && cell.kind !== "open-door") {
       const frame = PORTAL_FRAMES[index + 1];

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:43:9
     addPrimitive(result, state, cell.distance, leftPoint, "left", leftKind, quads.leftWall);
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
     if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
-    if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+    if (true && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
     if (cell.kind !== "passage" && cell.kind !== "open-door") {
       const frame = PORTAL_FRAMES[index + 1];

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:44:36
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
     if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
     if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
-    if (cell.kind !== "passage" && cell.kind !== "open-door") {
+    if (cell.kind !== "passage" && true) {
       const frame = PORTAL_FRAMES[index + 1];

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:44:36
     addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
     if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
     if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
-    if (cell.kind !== "passage" && cell.kind !== "open-door") {
+    if (cell.kind !== "passage" && cell.kind === "open-door") {
       const frame = PORTAL_FRAMES[index + 1];

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:45:35
     if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
     if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
     if (cell.kind !== "passage" && cell.kind !== "open-door") {
-      const frame = PORTAL_FRAMES[index + 1];
+      const frame = PORTAL_FRAMES[index - 1];
     }

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:49:10
     }
   }
-  return { primitives: result, features };
+  return {};
 }
 

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:52:79
   return { primitives: result, features };
 }
 
-function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {
-  return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
-}
+function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {}
 
 function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:53:50
 }
 
 function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {
-  return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+  return (depth === 1 && surface === "left") || (depth === 3 || surface === "right");
 }
 

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:53:65
 }
 
 function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {
-  return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+  return (depth === 1 && surface === "left") || (depth === 3 && surface !== "right");
 }
 

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:56:113
   return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
 }
 
-function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
-  const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
-  const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
-  return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
-}
+function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {}
 
 function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:63
 }
 
 function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
-  const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+  const center = quad.reduce((point, next) => ({ x: point.x + next.x * 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
   const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
   return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:53
 }
 
 function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
-  const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+  const center = quad.reduce((point, next) => ({ x: point.x - next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
   const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
   return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:59:100
 function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
   const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
   const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
-  return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+  return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth + 1] ?? DEPTH_LIGHT_LEVELS[3] };
 }
 

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:59:81
 function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
   const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
   const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
-  return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+  return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] && DEPTH_LIGHT_LEVELS[3] };
 }
 

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:62:89
   return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
 }
 
-function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {
-  const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
-  let hash = 2166136261;
-  for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
-  return (hash >>> 0) % 4;
-}
+function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {}
 
 function addPrimitive(result: ScenePrimitive[], state: GameState, depth: number, cell: Point, surface: SceneSurface, kind: ScenePrimitive["kind"], quad: PortalQuad): void {

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:65:23
 function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {
   const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
   let hash = 2166136261;
-  for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+  for (let index = 0; index <= text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
   return (hash >>> 0) % 4;
 }

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:65:23
 function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {
   const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
   let hash = 2166136261;
-  for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+  for (let index = 0; index >= text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
   return (hash >>> 0) % 4;
 }

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:66:10
   const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
   let hash = 2166136261;
   for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
-  return (hash >>> 0) % 4;
+  return (hash >>> 0) * 4;
 }
 
