[Survived] BlockStatement
src/renderer/meshGeometry.ts:8:94
 export type MeshUv = readonly [number, number];
 
 /** Maps a portal quad's four projected corners to one atlas swatch. */
-export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
-  const atlasRegion = MATERIALS[material].atlasRegion;
-  const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
-  if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
-  const inset = 0.25;
-  const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
-  const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
-  const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
-  const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
-  return [[left, top], [right, top], [right, bottom], [left, bottom]];
-}
+export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {}
 
 export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:10:65
 /** Maps a portal quad's four projected corners to one atlas swatch. */
 export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
   const atlasRegion = MATERIALS[material].atlasRegion;
-  const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+  const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => false);
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:10:65
 /** Maps a portal quad's four projected corners to one atlas swatch. */
 export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
   const atlasRegion = MATERIALS[material].atlasRegion;
-  const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+  const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => true);
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:11:7
 export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
   const atlasRegion = MATERIALS[material].atlasRegion;
   const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
-  if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+  if (false) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;

[Survived] BooleanLiteral
src/renderer/meshGeometry.ts:11:7
 export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
   const atlasRegion = MATERIALS[material].atlasRegion;
   const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
-  if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+  if (region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:13:16
   const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
-  const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
+  const left = (region.x + inset) * DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:13:17
   const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
-  const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
+  const left = (region.x - inset) / DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:14:17
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
-  const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
+  const right = (region.x + region.width - inset) * DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:14:18
   if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
-  const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
+  const right = (region.x - region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:15:15
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
-  const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
+  const top = (region.y + inset) * DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
   return [[left, top], [right, top], [right, bottom], [left, bottom]];

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:15:16
   const inset = 0.25;
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
-  const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
+  const top = (region.y - inset) / DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
   return [[left, top], [right, top], [right, bottom], [left, bottom]];

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:16:19
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
-  const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
+  const bottom = (region.y + region.height + inset) / DUNGEON_SURFACE_ATLAS.height;
   return [[left, top], [right, top], [right, bottom], [left, bottom]];
 }

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:16:19
   const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
-  const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
+  const bottom = (region.y - region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
   return [[left, top], [right, top], [right, bottom], [left, bottom]];
 }

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:24
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
-  return [[left, top], [right, top], [right, bottom], [left, bottom]];
+  return [[left, top], [], [right, bottom], [left, bottom]];
 }
 

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:38
   const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
   const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
   const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
-  return [[left, top], [right, top], [right, bottom], [left, bottom]];
+  return [[left, top], [right, top], [], [left, bottom]];
 }
 

[Survived] BlockStatement
src/renderer/meshGeometry.ts:20:80
   return [[left, top], [right, top], [right, bottom], [left, bottom]];
 }
 
-export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {
-  const uv = atlasUvQuad(material);
-  return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
-}
+export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {}
 
 export const QUAD_INDICES = [0, 1, 2, 0, 0, 2, 3, 0] as const;

[Survived] ArrowFunction
src/renderer/meshGeometry.ts:22:23
 
 export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {
   const uv = atlasUvQuad(material);
-  return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
+  return quad.flatMap(() => undefined);
 }
 

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:22:54
 
 export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {
   const uv = atlasUvQuad(material);
-  return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
+  return quad.flatMap((point: PortalPoint, index) => []);
 }
 
