[Survived] StringLiteral
src/input/bindings.ts:21:60
 }
 
 export const DEFAULT_KEY_BINDINGS: KeyBindings = {
-  moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+  moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", ""],
   turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],

[Survived] ArrayDeclaration
src/input/bindings.ts:21:16
 }
 
 export const DEFAULT_KEY_BINDINGS: KeyBindings = {
-  moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+  moveForward: [], moveBackward: ["KeyS", "ArrowDown"],
   turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],

[Survived] StringLiteral
src/input/bindings.ts:22:14
 
 export const DEFAULT_KEY_BINDINGS: KeyBindings = {
   moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
-  turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+  turnLeft: ["", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
 };

[Survived] StringLiteral
src/input/bindings.ts:22:22
 
 export const DEFAULT_KEY_BINDINGS: KeyBindings = {
   moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
-  turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+  turnLeft: ["KeyA", ""], turnRight: ["KeyD", "ArrowRight"],
 };

[Survived] BlockStatement
src/input/bindings.ts:28:115
 
 export type GameplayCommand = Exclude<Command, "retreat">;
 
-export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
-  for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-    if (bindings[command].includes(code)) {
-      if (command === "equipLeft") return "equipSelectedLeft";
-      if (command === "equipRight") return "equipSelectedRight";
-      return command;
-    }
-  }
-  if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
-  if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
-  if (bindings.pickup.includes(code)) return "pickup";
-  if (bindings.drop.includes(code)) return "dropSelected";
-  return null;
-}
+export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {}
 
 export function isPauseKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): boolean {

[Survived] BlockStatement
src/input/bindings.ts:29:163
 export type GameplayCommand = Exclude<Command, "retreat">;
 
 export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
-  for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-    if (bindings[command].includes(code)) {
-      if (command === "equipLeft") return "equipSelectedLeft";
-      if (command === "equipRight") return "equipSelectedRight";
-      return command;
-    }
-  }
+  for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {}
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";

[Survived] ConditionalExpression
src/input/bindings.ts:30:9
 
 export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-    if (bindings[command].includes(code)) {
+    if (false) {
       if (command === "equipLeft") return "equipSelectedLeft";
       if (command === "equipRight") return "equipSelectedRight";

[Survived] BlockStatement
src/input/bindings.ts:30:43
 
 export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-    if (bindings[command].includes(code)) {
-      if (command === "equipLeft") return "equipSelectedLeft";
-      if (command === "equipRight") return "equipSelectedRight";
-      return command;
-    }
+    if (bindings[command].includes(code)) {}
   }
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";

[Survived] ConditionalExpression
src/input/bindings.ts:31:11
 export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
     if (bindings[command].includes(code)) {
-      if (command === "equipLeft") return "equipSelectedLeft";
+      if (true) return "equipSelectedLeft";
       if (command === "equipRight") return "equipSelectedRight";
       return command;

[Survived] ConditionalExpression
src/input/bindings.ts:31:11
 export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
     if (bindings[command].includes(code)) {
-      if (command === "equipLeft") return "equipSelectedLeft";
+      if (false) return "equipSelectedLeft";
       if (command === "equipRight") return "equipSelectedRight";
       return command;

[Survived] EqualityOperator
src/input/bindings.ts:32:11
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
     if (bindings[command].includes(code)) {
       if (command === "equipLeft") return "equipSelectedLeft";
-      if (command === "equipRight") return "equipSelectedRight";
+      if (command !== "equipRight") return "equipSelectedRight";
       return command;
     }

[Survived] ConditionalExpression
src/input/bindings.ts:32:11
   for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
     if (bindings[command].includes(code)) {
       if (command === "equipLeft") return "equipSelectedLeft";
-      if (command === "equipRight") return "equipSelectedRight";
+      if (true) return "equipSelectedRight";
       return command;
     }

[NoCoverage] ConditionalExpression
src/input/bindings.ts:36:7
       return command;
     }
   }
-  if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
+  if (true) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:36:7
       return command;
     }
   }
-  if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
+  if (false) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:37:7
     }
   }
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
-  if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
+  if (false) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";
   if (bindings.drop.includes(code)) return "dropSelected";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:37:7
     }
   }
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
-  if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
+  if (true) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";
   if (bindings.drop.includes(code)) return "dropSelected";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:38:7
   }
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
-  if (bindings.pickup.includes(code)) return "pickup";
+  if (true) return "pickup";
   if (bindings.drop.includes(code)) return "dropSelected";
   return null;

[NoCoverage] ConditionalExpression
src/input/bindings.ts:38:7
   }
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
-  if (bindings.pickup.includes(code)) return "pickup";
+  if (false) return "pickup";
   if (bindings.drop.includes(code)) return "dropSelected";
   return null;

[NoCoverage] ConditionalExpression
src/input/bindings.ts:39:7
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";
-  if (bindings.drop.includes(code)) return "dropSelected";
+  if (true) return "dropSelected";
   return null;
 }

[NoCoverage] ConditionalExpression
src/input/bindings.ts:39:7
   if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
   if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
   if (bindings.pickup.includes(code)) return "pickup";
-  if (bindings.drop.includes(code)) return "dropSelected";
+  if (false) return "dropSelected";
   return null;
 }

[Survived] BlockStatement
src/input/bindings.ts:43:97
   return null;
 }
 
-export function isPauseKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): boolean {
-  return bindings.pause.includes(code);
-}
+export function isPauseKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): boolean {}
 
