[Survived] StringLiteral
src/input/input-controller.ts:7:28
 
-const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+const FORM_TAGS = new Set(["", "TEXTAREA", "SELECT"]);
 
 export class InputController {

[Survived] ArrayDeclaration
src/input/input-controller.ts:7:27
 
-const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+const FORM_TAGS = new Set([]);
 
 export class InputController {

[Survived] ArrowFunction
src/input/input-controller.ts:15:37
   private readonly emit: (command: GameplayCommand) => void;
   private readonly togglePause: () => void;
   private readonly getMode: () => InputMode;
-  private readonly onKeyDownBound = (event: KeyboardEvent): void => this.onKeyDown(event);
+  private readonly onKeyDownBound = () => undefined;
 
   constructor(options: InputControllerOptions) {

[Survived] BlockStatement
src/input/input-controller.ts:17:48
   private readonly getMode: () => InputMode;
   private readonly onKeyDownBound = (event: KeyboardEvent): void => this.onKeyDown(event);
 
-  constructor(options: InputControllerOptions) {
-    this.target = options.target; this.bindings = options.bindings ?? DEFAULT_KEY_BINDINGS;
-    this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
-  }
+  constructor(options: InputControllerOptions) {}
   attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
   detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }

[Survived] LogicalOperator
src/input/input-controller.ts:18:51
   private readonly onKeyDownBound = (event: KeyboardEvent): void => this.onKeyDown(event);
 
   constructor(options: InputControllerOptions) {
-    this.target = options.target; this.bindings = options.bindings ?? DEFAULT_KEY_BINDINGS;
+    this.target = options.target; this.bindings = options.bindings && DEFAULT_KEY_BINDINGS;
     this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
   }

[Survived] BlockStatement
src/input/input-controller.ts:21:18
     this.target = options.target; this.bindings = options.bindings ?? DEFAULT_KEY_BINDINGS;
     this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
   }
-  attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
+  attach(): void {}
   detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
   private onKeyDown(event: KeyboardEvent): void {

[NoCoverage] BlockStatement
src/input/input-controller.ts:22:18
     this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
   }
   attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
-  detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
+  detach(): void {}
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;

[NoCoverage] StringLiteral
src/input/input-controller.ts:22:52
     this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
   }
   attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
-  detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
+  detach(): void { this.target.removeEventListener("", this.onKeyDownBound); }
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;

[Survived] BlockStatement
src/input/input-controller.ts:23:49
   }
   attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
   detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
-  private onKeyDown(event: KeyboardEvent): void {
-    const target = event.target as HTMLElement | null;
-    if (target && FORM_TAGS.has(target.tagName)) return;
-    if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
-    if (this.getMode() !== "active") return;
-    if (event.repeat) { event.preventDefault(); return; }
-    const command = commandForKey(event.code, this.bindings);
-    if (!command) return;
-    event.preventDefault();
-    this.emit(command);
-  }
+  private onKeyDown(event: KeyboardEvent): void {}
 }
 

[Survived] ConditionalExpression
src/input/input-controller.ts:25:9
   detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;
-    if (target && FORM_TAGS.has(target.tagName)) return;
+    if (true) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;

[Survived] LogicalOperator
src/input/input-controller.ts:25:9
   detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;
-    if (target && FORM_TAGS.has(target.tagName)) return;
+    if (target || FORM_TAGS.has(target.tagName)) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;

[Survived] ConditionalExpression
src/input/input-controller.ts:26:9
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;
     if (target && FORM_TAGS.has(target.tagName)) return;
-    if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+    if (true) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;
     if (event.repeat) { event.preventDefault(); return; }

[Survived] ConditionalExpression
src/input/input-controller.ts:26:9
   private onKeyDown(event: KeyboardEvent): void {
     const target = event.target as HTMLElement | null;
     if (target && FORM_TAGS.has(target.tagName)) return;
-    if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+    if (false) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;
     if (event.repeat) { event.preventDefault(); return; }

[Survived] EqualityOperator
src/input/input-controller.ts:27:9
     const target = event.target as HTMLElement | null;
     if (target && FORM_TAGS.has(target.tagName)) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
-    if (this.getMode() !== "active") return;
+    if (this.getMode() === "active") return;
     if (event.repeat) { event.preventDefault(); return; }
     const command = commandForKey(event.code, this.bindings);

[Survived] ConditionalExpression
src/input/input-controller.ts:27:9
     const target = event.target as HTMLElement | null;
     if (target && FORM_TAGS.has(target.tagName)) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
-    if (this.getMode() !== "active") return;
+    if (true) return;
     if (event.repeat) { event.preventDefault(); return; }
     const command = commandForKey(event.code, this.bindings);

[Survived] CallExpression
src/input/input-controller.ts:28:25
     if (target && FORM_TAGS.has(target.tagName)) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;
-    if (event.repeat) { event.preventDefault(); return; }
+    if (event.repeat) { ; return; }
     const command = commandForKey(event.code, this.bindings);
     if (!command) return;

[Survived] BlockStatement
src/input/input-controller.ts:28:23
     if (target && FORM_TAGS.has(target.tagName)) return;
     if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
     if (this.getMode() !== "active") return;
-    if (event.repeat) { event.preventDefault(); return; }
+    if (event.repeat) {}
     const command = commandForKey(event.code, this.bindings);
     if (!command) return;

[Survived] BooleanLiteral
src/input/input-controller.ts:30:9
     if (this.getMode() !== "active") return;
     if (event.repeat) { event.preventDefault(); return; }
     const command = commandForKey(event.code, this.bindings);
-    if (!command) return;
+    if (command) return;
     event.preventDefault();
     this.emit(command);

[Survived] ConditionalExpression
src/input/input-controller.ts:30:9
     if (this.getMode() !== "active") return;
     if (event.repeat) { event.preventDefault(); return; }
     const command = commandForKey(event.code, this.bindings);
-    if (!command) return;
+    if (true) return;
     event.preventDefault();
     this.emit(command);

[Survived] CallExpression
src/input/input-controller.ts:31:5
     if (event.repeat) { event.preventDefault(); return; }
     const command = commandForKey(event.code, this.bindings);
     if (!command) return;
-    event.preventDefault();
+    ;
     this.emit(command);
   }

[Survived] CallExpression
src/input/input-controller.ts:32:5
     const command = commandForKey(event.code, this.bindings);
     if (!command) return;
     event.preventDefault();
-    this.emit(command);
+    ;
   }
 }
