[Survived] ObjectLiteral
src/content/registry.ts:4:76
 import { ITEM_DEFINITIONS, itemById, type ItemDefinition } from "./items";
 import { MONSTER_DEFINITIONS, type MonsterDefinition } from "./monsters";
 export interface LootEntry { readonly itemId: string; readonly weight: number; readonly quantity?: number; }
-export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
-  "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
-  "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
-  "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
-};
+export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {};
 export interface ContentRegistry { readonly items: readonly ItemDefinition[]; readonly monsters: readonly MonsterDefinition[]; readonly lootTables: Readonly<Record<string, readonly LootEntry[]>>; }
 export const CONTENT: ContentRegistry = { items: ITEM_DEFINITIONS, monsters: MONSTER_DEFINITIONS, lootTables: LOOT_TABLES };

[Survived] ArrayDeclaration
src/content/registry.ts:5:19
 import { MONSTER_DEFINITIONS, type MonsterDefinition } from "./monsters";
 export interface LootEntry { readonly itemId: string; readonly weight: number; readonly quantity?: number; }
 export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
-  "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
+  "warden-cache": [],
   "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
   "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]

[Survived] StringLiteral
src/content/registry.ts:6:69
 export interface LootEntry { readonly itemId: string; readonly weight: number; readonly quantity?: number; }
 export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
   "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
-  "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+  "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "", weight: 1 }],
   "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
 };

[Survived] StringLiteral
src/content/registry.ts:6:32
 export interface LootEntry { readonly itemId: string; readonly weight: number; readonly quantity?: number; }
 export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
   "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
-  "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+  "mireling-cache": [{ itemId: "", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
   "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
 };

[Survived] StringLiteral
src/content/registry.ts:7:107
 export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
   "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
   "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
-  "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+  "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "", weight: 1 }]
 };
 export interface ContentRegistry { readonly items: readonly ItemDefinition[]; readonly monsters: readonly MonsterDefinition[]; readonly lootTables: Readonly<Record<string, readonly LootEntry[]>>; }

[Survived] ObjectLiteral
src/content/registry.ts:7:97
 export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
   "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
   "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
-  "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+  "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, {}]
 };
 export interface ContentRegistry { readonly items: readonly ItemDefinition[]; readonly monsters: readonly MonsterDefinition[]; readonly lootTables: Readonly<Record<string, readonly LootEntry[]>>; }

[Survived] ObjectLiteral
src/content/registry.ts:10:41
   "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
 };
 export interface ContentRegistry { readonly items: readonly ItemDefinition[]; readonly monsters: readonly MonsterDefinition[]; readonly lootTables: Readonly<Record<string, readonly LootEntry[]>>; }
-export const CONTENT: ContentRegistry = { items: ITEM_DEFINITIONS, monsters: MONSTER_DEFINITIONS, lootTables: LOOT_TABLES };
+export const CONTENT: ContentRegistry = {};
 export function validateContent(registry: ContentRegistry = CONTENT): readonly string[] {
   const errors: string[] = []; const itemIds = new Set<string>();

[Survived] ArrayDeclaration
src/content/registry.ts:12:28
 export interface ContentRegistry { readonly items: readonly ItemDefinition[]; readonly monsters: readonly MonsterDefinition[]; readonly lootTables: Readonly<Record<string, readonly LootEntry[]>>; }
 export const CONTENT: ContentRegistry = { items: ITEM_DEFINITIONS, monsters: MONSTER_DEFINITIONS, lootTables: LOOT_TABLES };
 export function validateContent(registry: ContentRegistry = CONTENT): readonly string[] {
-  const errors: string[] = []; const itemIds = new Set<string>();
+  const errors: string[] = ["Stryker was here"]; const itemIds = new Set<string>();
   const monsterIds = new Set<string>();

[Survived] ConditionalExpression
src/content/registry.ts:19:127
   return errors;
 }
-export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (true) throw new Error(errors.join("; ")); }
 

[Survived] BlockStatement
src/content/registry.ts:19:79
   return errors;
 }
-export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+export function assertValidContent(registry: ContentRegistry = CONTENT): void {}
 
