[Survived] BlockStatement
src/audio/healthCue.ts:8:87
   readonly gain: number;
 }
 
-export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
-  const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
-  if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
-  return {
-    enabled: true,
-    intervalMs: Math.round(650 + ratio * 650),
-    frequencyHz: Math.round(150 + (1 - ratio) * 90),
-    gain: 0.018 + (1 - ratio) * 0.022
-  };
-}
+export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {}
 
 type CueMode = "menu" | "active" | "paused" | "terminal";

[Survived] ConditionalExpression
src/audio/healthCue.ts:9:17
 }
 
 export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
-  const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+  const ratio = false ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
   if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {

[Survived] ArithmeticOperator
src/audio/healthCue.ts:9:57
 }
 
 export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
-  const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+  const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health * maxHealth)) : 0;
   if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {

[Survived] EqualityOperator
src/audio/healthCue.ts:10:7
 
 export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
   const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
-  if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+  if (ratio > 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {
     enabled: true,

[Survived] BooleanLiteral
src/audio/healthCue.ts:10:37
 
 export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
   const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
-  if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+  if (ratio >= 1) return { enabled: true, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {
     enabled: true,

[Survived] BooleanLiteral
src/audio/healthCue.ts:12:14
   const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
   if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {
-    enabled: true,
+    enabled: false,
     intervalMs: Math.round(650 + ratio * 650),
     frequencyHz: Math.round(150 + (1 - ratio) * 90),

[Survived] ArithmeticOperator
src/audio/healthCue.ts:13:34
   if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {
     enabled: true,
-    intervalMs: Math.round(650 + ratio * 650),
+    intervalMs: Math.round(650 + ratio / 650),
     frequencyHz: Math.round(150 + (1 - ratio) * 90),
     gain: 0.018 + (1 - ratio) * 0.022

[Survived] ArithmeticOperator
src/audio/healthCue.ts:13:28
   if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
   return {
     enabled: true,
-    intervalMs: Math.round(650 + ratio * 650),
+    intervalMs: Math.round(650 - ratio * 650),
     frequencyHz: Math.round(150 + (1 - ratio) * 90),
     gain: 0.018 + (1 - ratio) * 0.022

[Survived] ArithmeticOperator
src/audio/healthCue.ts:14:36
   return {
     enabled: true,
     intervalMs: Math.round(650 + ratio * 650),
-    frequencyHz: Math.round(150 + (1 - ratio) * 90),
+    frequencyHz: Math.round(150 + (1 + ratio) * 90),
     gain: 0.018 + (1 - ratio) * 0.022
   };

[Survived] ArithmeticOperator
src/audio/healthCue.ts:14:35
   return {
     enabled: true,
     intervalMs: Math.round(650 + ratio * 650),
-    frequencyHz: Math.round(150 + (1 - ratio) * 90),
+    frequencyHz: Math.round(150 + (1 - ratio) / 90),
     gain: 0.018 + (1 - ratio) * 0.022
   };

[Survived] ArithmeticOperator
src/audio/healthCue.ts:15:20
     enabled: true,
     intervalMs: Math.round(650 + ratio * 650),
     frequencyHz: Math.round(150 + (1 - ratio) * 90),
-    gain: 0.018 + (1 - ratio) * 0.022
+    gain: 0.018 + (1 + ratio) * 0.022
   };
 }

[Survived] ArithmeticOperator
src/audio/healthCue.ts:15:11
     enabled: true,
     intervalMs: Math.round(650 + ratio * 650),
     frequencyHz: Math.round(150 + (1 - ratio) * 90),
-    gain: 0.018 + (1 - ratio) * 0.022
+    gain: 0.018 - (1 - ratio) * 0.022
   };
 }

[NoCoverage] BlockStatement
src/audio/healthCue.ts:29:32
   private profile: HealthCueProfile = healthCueProfile(1, 1);
   private mode: CueMode = "menu";
 
-  setMode(mode: CueMode): void {
-    this.mode = mode;
-    if (mode === "active") {
-      void this.context?.resume();
-      this.syncPulse();
-    } else {
-      this.stopPulse();
-      if (mode === "paused") void this.context?.suspend();
-      if (mode === "menu" || mode === "terminal") this.dispose();
-    }
-  }
+  setMode(mode: CueMode): void {}
 
   update(health: number, maxHealth: number): void {

[NoCoverage] BlockStatement
src/audio/healthCue.ts:31:28
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") {
-      void this.context?.resume();
-      this.syncPulse();
-    } else {
+    if (mode === "active") {} else {
       this.stopPulse();
       if (mode === "paused") void this.context?.suspend();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:31:9
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") {
+    if (false) {
       void this.context?.resume();
       this.syncPulse();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:32:12
   setMode(mode: CueMode): void {
     this.mode = mode;
     if (mode === "active") {
-      void this.context?.resume();
+      void this.context.resume();
       this.syncPulse();
     } else {

[NoCoverage] CallExpression
src/audio/healthCue.ts:33:7
     this.mode = mode;
     if (mode === "active") {
       void this.context?.resume();
-      this.syncPulse();
+      ;
     } else {
       this.stopPulse();

[NoCoverage] BlockStatement
src/audio/healthCue.ts:34:12
     if (mode === "active") {
       void this.context?.resume();
       this.syncPulse();
-    } else {
-      this.stopPulse();
-      if (mode === "paused") void this.context?.suspend();
-      if (mode === "menu" || mode === "terminal") this.dispose();
-    }
+    } else {}
   }
 

[NoCoverage] CallExpression
src/audio/healthCue.ts:35:7
       void this.context?.resume();
       this.syncPulse();
     } else {
-      this.stopPulse();
+      ;
       if (mode === "paused") void this.context?.suspend();
       if (mode === "menu" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:36:11
       this.syncPulse();
     } else {
       this.stopPulse();
-      if (mode === "paused") void this.context?.suspend();
+      if (false) void this.context?.suspend();
       if (mode === "menu" || mode === "terminal") this.dispose();
     }

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:36:35
       this.syncPulse();
     } else {
       this.stopPulse();
-      if (mode === "paused") void this.context?.suspend();
+      if (mode === "paused") void this.context.suspend();
       if (mode === "menu" || mode === "terminal") this.dispose();
     }

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:37:11
     } else {
       this.stopPulse();
       if (mode === "paused") void this.context?.suspend();
-      if (mode === "menu" || mode === "terminal") this.dispose();
+      if (mode === "menu" && mode === "terminal") this.dispose();
     }
   }

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:37:11
     } else {
       this.stopPulse();
       if (mode === "paused") void this.context?.suspend();
-      if (mode === "menu" || mode === "terminal") this.dispose();
+      if (false) this.dispose();
     }
   }

[NoCoverage] BlockStatement
src/audio/healthCue.ts:41:51
     }
   }
 
-  update(health: number, maxHealth: number): void {
-    this.profile = healthCueProfile(health, maxHealth);
-    this.syncPulse();
-  }
+  update(health: number, maxHealth: number): void {}
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {

[NoCoverage] CallExpression
src/audio/healthCue.ts:43:5
 
   update(health: number, maxHealth: number): void {
     this.profile = healthCueProfile(health, maxHealth);
-    this.syncPulse();
+    ;
   }
 

[NoCoverage] BlockStatement
src/audio/healthCue.ts:46:137
     this.syncPulse();
   }
 
-  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {
-    return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
-  }
+  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {}
 
   dispose(): void {

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:47:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {
-    return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+    return { contextState: this.context.state ?? "uncreated", profile: this.profile, mode: this.mode };
   }
 

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:47:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {
-    return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+    return { contextState: this.context?.state && "uncreated", profile: this.profile, mode: this.mode };
   }
 

[NoCoverage] BlockStatement
src/audio/healthCue.ts:50:19
     return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
   }
 
-  dispose(): void {
-    this.stopPulse();
-    this.oscillator?.stop();
-    this.oscillator?.disconnect();
-    this.gainNode?.disconnect();
-    this.oscillator = null;
-    this.gainNode = null;
-    void this.context?.close();
-    this.context = null;
-  }
+  dispose(): void {}
 
   private syncPulse(): void {

[NoCoverage] CallExpression
src/audio/healthCue.ts:51:5
   }
 
   dispose(): void {
-    this.stopPulse();
+    ;
     this.oscillator?.stop();
     this.oscillator?.disconnect();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:52:5
 
   dispose(): void {
     this.stopPulse();
-    this.oscillator?.stop();
+    this.oscillator.stop();
     this.oscillator?.disconnect();
     this.gainNode?.disconnect();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:53:5
   dispose(): void {
     this.stopPulse();
     this.oscillator?.stop();
-    this.oscillator?.disconnect();
+    this.oscillator.disconnect();
     this.gainNode?.disconnect();
     this.oscillator = null;

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:54:5
     this.stopPulse();
     this.oscillator?.stop();
     this.oscillator?.disconnect();
-    this.gainNode?.disconnect();
+    this.gainNode.disconnect();
     this.oscillator = null;
     this.gainNode = null;

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:57:10
     this.gainNode?.disconnect();
     this.oscillator = null;
     this.gainNode = null;
-    void this.context?.close();
+    void this.context.close();
     this.context = null;
   }

[NoCoverage] BlockStatement
src/audio/healthCue.ts:61:29
     this.context = null;
   }
 
-  private syncPulse(): void {
-    if (this.mode !== "active" || !this.profile.enabled) {
-      this.stopPulse();
-      return;
-    }
-    this.ensureAudioGraph();
-    if (!this.context || !this.gainNode || !this.oscillator) return;
-    this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
-    this.stopPulse();
-    this.pulse();
-    this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
-  }
+  private syncPulse(): void {}
 
   private ensureAudioGraph(): void {

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:62:9
   }
 
   private syncPulse(): void {
-    if (this.mode !== "active" || !this.profile.enabled) {
+    if (true) {
       this.stopPulse();
       return;

[NoCoverage] BlockStatement
src/audio/healthCue.ts:62:58
   }
 
   private syncPulse(): void {
-    if (this.mode !== "active" || !this.profile.enabled) {
-      this.stopPulse();
-      return;
-    }
+    if (this.mode !== "active" || !this.profile.enabled) {}
     this.ensureAudioGraph();
     if (!this.context || !this.gainNode || !this.oscillator) return;

[NoCoverage] CallExpression
src/audio/healthCue.ts:63:7
 
   private syncPulse(): void {
     if (this.mode !== "active" || !this.profile.enabled) {
-      this.stopPulse();
+      ;
       return;
     }

[NoCoverage] CallExpression
src/audio/healthCue.ts:66:5
       this.stopPulse();
       return;
     }
-    this.ensureAudioGraph();
+    ;
     if (!this.context || !this.gainNode || !this.oscillator) return;
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:67:9
       return;
     }
     this.ensureAudioGraph();
-    if (!this.context || !this.gainNode || !this.oscillator) return;
+    if (this.context || !this.gainNode || !this.oscillator) return;
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
     this.stopPulse();

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:67:9
       return;
     }
     this.ensureAudioGraph();
-    if (!this.context || !this.gainNode || !this.oscillator) return;
+    if (!this.context && !this.gainNode || !this.oscillator) return;
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
     this.stopPulse();

[NoCoverage] CallExpression
src/audio/healthCue.ts:68:5
     }
     this.ensureAudioGraph();
     if (!this.context || !this.gainNode || !this.oscillator) return;
-    this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
+    ;
     this.stopPulse();
     this.pulse();

[NoCoverage] CallExpression
src/audio/healthCue.ts:69:5
     this.ensureAudioGraph();
     if (!this.context || !this.gainNode || !this.oscillator) return;
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
-    this.stopPulse();
+    ;
     this.pulse();
     this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);

[NoCoverage] CallExpression
src/audio/healthCue.ts:70:5
     if (!this.context || !this.gainNode || !this.oscillator) return;
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
     this.stopPulse();
-    this.pulse();
+    ;
     this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
   }

[NoCoverage] ArrowFunction
src/audio/healthCue.ts:71:42
     this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
     this.stopPulse();
     this.pulse();
-    this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
+    this.pulseTimer = window.setInterval(() => undefined, this.profile.intervalMs);
   }
 

[NoCoverage] BlockStatement
src/audio/healthCue.ts:74:36
     this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
   }
 
-  private ensureAudioGraph(): void {
-    if (this.context) return;
-    const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!AudioContextConstructor) return;
-    this.context = new AudioContextConstructor();
-    this.oscillator = this.context.createOscillator();
-    this.gainNode = this.context.createGain();
-    this.oscillator.type = "sine";
-    this.gainNode.gain.value = 0;
-    this.oscillator.connect(this.gainNode).connect(this.context.destination);
-    this.oscillator.start();
-  }
+  private ensureAudioGraph(): void {}
 
   private pulse(): void {

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:75:9
   }
 
   private ensureAudioGraph(): void {
-    if (this.context) return;
+    if (true) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (!AudioContextConstructor) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:75:9
   }
 
   private ensureAudioGraph(): void {
-    if (this.context) return;
+    if (false) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (!AudioContextConstructor) return;

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:76:37
 
   private ensureAudioGraph(): void {
     if (this.context) return;
-    const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
+    const AudioContextConstructor = window.AudioContext && (window as typeof window & {
+  webkitAudioContext?: typeof AudioContext;
+}).webkitAudioContext;
     if (!AudioContextConstructor) return;
     this.context = new AudioContextConstructor();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:77:9
   private ensureAudioGraph(): void {
     if (this.context) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!AudioContextConstructor) return;
+    if (true) return;
     this.context = new AudioContextConstructor();
     this.oscillator = this.context.createOscillator();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:77:9
   private ensureAudioGraph(): void {
     if (this.context) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!AudioContextConstructor) return;
+    if (false) return;
     this.context = new AudioContextConstructor();
     this.oscillator = this.context.createOscillator();

[NoCoverage] CallExpression
src/audio/healthCue.ts:83:5
     this.gainNode = this.context.createGain();
     this.oscillator.type = "sine";
     this.gainNode.gain.value = 0;
-    this.oscillator.connect(this.gainNode).connect(this.context.destination);
+    ;
     this.oscillator.start();
   }

[NoCoverage] CallExpression
src/audio/healthCue.ts:84:5
     this.oscillator.type = "sine";
     this.gainNode.gain.value = 0;
     this.oscillator.connect(this.gainNode).connect(this.context.destination);
-    this.oscillator.start();
+    ;
   }
 

[NoCoverage] BlockStatement
src/audio/healthCue.ts:87:25
     this.oscillator.start();
   }
 
-  private pulse(): void {
-    if (!this.context || !this.gainNode) return;
-    const now = this.context.currentTime;
-    this.gainNode.gain.cancelScheduledValues(now);
-    this.gainNode.gain.setValueAtTime(0, now);
-    this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
-    this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
-  }
+  private pulse(): void {}
 
   private stopPulse(): void {

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:88:26
   }
 
   private pulse(): void {
-    if (!this.context || !this.gainNode) return;
+    if (!this.context || this.gainNode) return;
     const now = this.context.currentTime;
     this.gainNode.gain.cancelScheduledValues(now);

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:88:9
   }
 
   private pulse(): void {
-    if (!this.context || !this.gainNode) return;
+    if (this.context || !this.gainNode) return;
     const now = this.context.currentTime;
     this.gainNode.gain.cancelScheduledValues(now);

[NoCoverage] CallExpression
src/audio/healthCue.ts:90:5
   private pulse(): void {
     if (!this.context || !this.gainNode) return;
     const now = this.context.currentTime;
-    this.gainNode.gain.cancelScheduledValues(now);
+    ;
     this.gainNode.gain.setValueAtTime(0, now);
     this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);

[NoCoverage] CallExpression
src/audio/healthCue.ts:91:5
     if (!this.context || !this.gainNode) return;
     const now = this.context.currentTime;
     this.gainNode.gain.cancelScheduledValues(now);
-    this.gainNode.gain.setValueAtTime(0, now);
+    ;
     this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
     this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);

[NoCoverage] ArithmeticOperator
src/audio/healthCue.ts:92:67
     const now = this.context.currentTime;
     this.gainNode.gain.cancelScheduledValues(now);
     this.gainNode.gain.setValueAtTime(0, now);
-    this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
+    this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now - 0.02);
     this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
   }

[NoCoverage] ArithmeticOperator
src/audio/healthCue.ts:93:51
     this.gainNode.gain.cancelScheduledValues(now);
     this.gainNode.gain.setValueAtTime(0, now);
     this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
-    this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
+    this.gainNode.gain.linearRampToValueAtTime(0, now - 0.14);
   }
 

[NoCoverage] BlockStatement
src/audio/healthCue.ts:96:29
     this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
   }
 
-  private stopPulse(): void {
-    if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
-    this.pulseTimer = null;
-    if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
-  }
+  private stopPulse(): void {}
 }
 

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:97:9
   }
 
   private stopPulse(): void {
-    if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+    if (false) window.clearInterval(this.pulseTimer);
     this.pulseTimer = null;
     if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:97:9
   }
 
   private stopPulse(): void {
-    if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+    if (true) window.clearInterval(this.pulseTimer);
     this.pulseTimer = null;
     if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);

[NoCoverage] CallExpression
src/audio/healthCue.ts:99:40
   private stopPulse(): void {
     if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
     this.pulseTimer = null;
-    if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+    if (this.context && this.gainNode) ;
   }
 }

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:99:9
   private stopPulse(): void {
     if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
     this.pulseTimer = null;
-    if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+    if (true) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
   }
 }
