[Survived] BlockStatement
src/audio/actionCue.ts:9:73
   readonly gain: number;
 }
 
-export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
-  if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
-  if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
-  if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
-  return { frequencyHz: 440, durationMs: 70, gain: 0.032 };
-}
+export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {}
 
 type CueMode = "menu" | "active" | "paused" | "terminal";

[Survived] ConditionalExpression
src/audio/actionCue.ts:10:7
 }
 
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
-  if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+  if (true) return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
   if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
   if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };

[Survived] ConditionalExpression
src/audio/actionCue.ts:10:7
 }
 
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
-  if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+  if (false) return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
   if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
   if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };

[Survived] EqualityOperator
src/audio/actionCue.ts:11:7
 
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
   if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
-  if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+  if (kind !== "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
   if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
   return { frequencyHz: 440, durationMs: 70, gain: 0.032 };

[Survived] ConditionalExpression
src/audio/actionCue.ts:11:7
 
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
   if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
-  if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+  if (true) return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
   if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
   return { frequencyHz: 440, durationMs: 70, gain: 0.032 };

[Survived] ConditionalExpression
src/audio/actionCue.ts:12:7
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
   if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
   if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
-  if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+  if (true) return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
   return { frequencyHz: 440, durationMs: 70, gain: 0.032 };
 }

[Survived] ConditionalExpression
src/audio/actionCue.ts:12:7
 export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
   if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
   if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
-  if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+  if (false) return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
   return { frequencyHz: 440, durationMs: 70, gain: 0.032 };
 }

[NoCoverage] BlockStatement
src/audio/actionCue.ts:24:32
   private count = 0;
   private lastCue: ActionCueKind | null = null;
 
-  setMode(mode: CueMode): void {
-    this.mode = mode;
-    if (mode === "active") void this.context?.resume();
-    if (mode === "paused") void this.context?.suspend();
-    if (mode === "menu" || mode === "terminal") this.dispose();
-  }
+  setMode(mode: CueMode): void {}
 
   play(kind: ActionCueKind): void {

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:26:9
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") void this.context?.resume();
+    if (true) void this.context?.resume();
     if (mode === "paused") void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:26:9
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") void this.context?.resume();
+    if (mode !== "active") void this.context?.resume();
     if (mode === "paused") void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:27:9
   setMode(mode: CueMode): void {
     this.mode = mode;
     if (mode === "active") void this.context?.resume();
-    if (mode === "paused") void this.context?.suspend();
+    if (false) void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();
   }

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:27:9
   setMode(mode: CueMode): void {
     this.mode = mode;
     if (mode === "active") void this.context?.resume();
-    if (mode === "paused") void this.context?.suspend();
+    if (true) void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();
   }

[NoCoverage] CallExpression
src/audio/actionCue.ts:28:49
     this.mode = mode;
     if (mode === "active") void this.context?.resume();
     if (mode === "paused") void this.context?.suspend();
-    if (mode === "menu" || mode === "terminal") this.dispose();
+    if (mode === "menu" || mode === "terminal") ;
   }
 

[NoCoverage] BlockStatement
src/audio/actionCue.ts:31:35
     if (mode === "menu" || mode === "terminal") this.dispose();
   }
 
-  play(kind: ActionCueKind): void {
-    if (this.mode !== "active") return;
-    const profile = actionCueProfile(kind);
-    const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
-    if (!this.context) return;
-    void this.context.resume();
-    const oscillator = this.context.createOscillator();
-    const gain = this.context.createGain();
-    const now = this.context.currentTime;
-    oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
-    oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-    gain.gain.setValueAtTime(profile.gain, now);
-    gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
-    oscillator.connect(gain).connect(this.context.destination);
-    oscillator.start(now);
-    oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
-    this.count += 1;
-    this.lastCue = kind;
-  }
+  play(kind: ActionCueKind): void {}
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:32:9
   }
 
   play(kind: ActionCueKind): void {
-    if (this.mode !== "active") return;
+    if (true) return;
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:32:9
   }
 
   play(kind: ActionCueKind): void {
-    if (this.mode !== "active") return;
+    if (this.mode === "active") return;
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:34:37
   play(kind: ActionCueKind): void {
     if (this.mode !== "active") return;
     const profile = actionCueProfile(kind);
-    const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
+    const AudioContextConstructor = window.AudioContext && (window as typeof window & {
+  webkitAudioContext?: typeof AudioContext;
+}).webkitAudioContext;
     if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
     if (!this.context) return;

[NoCoverage] BooleanLiteral
src/audio/actionCue.ts:35:9
     if (this.mode !== "active") return;
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+    if (this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
     if (!this.context) return;
     void this.context.resume();

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:35:9
     if (this.mode !== "active") return;
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+    if (!this.context || AudioContextConstructor) this.context = new AudioContextConstructor();
     if (!this.context) return;
     void this.context.resume();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:36:9
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
-    if (!this.context) return;
+    if (true) return;
     void this.context.resume();
     const oscillator = this.context.createOscillator();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:36:9
     const profile = actionCueProfile(kind);
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
-    if (!this.context) return;
+    if (false) return;
     void this.context.resume();
     const oscillator = this.context.createOscillator();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:41:23
     const oscillator = this.context.createOscillator();
     const gain = this.context.createGain();
     const now = this.context.currentTime;
-    oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+    oscillator.type = true ? "square" : "triangle";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     gain.gain.setValueAtTime(profile.gain, now);

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:41:23
     const oscillator = this.context.createOscillator();
     const gain = this.context.createGain();
     const now = this.context.currentTime;
-    oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+    oscillator.type = kind === "attack" && kind === "encounter" ? "square" : "triangle";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     gain.gain.setValueAtTime(profile.gain, now);

[NoCoverage] CallExpression
src/audio/actionCue.ts:42:5
     const gain = this.context.createGain();
     const now = this.context.currentTime;
     oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
-    oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
+    ;
     gain.gain.setValueAtTime(profile.gain, now);
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);

[NoCoverage] CallExpression
src/audio/actionCue.ts:43:5
     const now = this.context.currentTime;
     oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-    gain.gain.setValueAtTime(profile.gain, now);
+    ;
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:44:42
     oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     gain.gain.setValueAtTime(profile.gain, now);
-    gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+    gain.gain.linearRampToValueAtTime(0, now - profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:44:48
     oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     gain.gain.setValueAtTime(profile.gain, now);
-    gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+    gain.gain.linearRampToValueAtTime(0, now + profile.durationMs * 1000);
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);

[NoCoverage] CallExpression
src/audio/actionCue.ts:45:5
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     gain.gain.setValueAtTime(profile.gain, now);
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
-    oscillator.connect(gain).connect(this.context.destination);
+    ;
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);

[NoCoverage] CallExpression
src/audio/actionCue.ts:46:5
     gain.gain.setValueAtTime(profile.gain, now);
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);
-    oscillator.start(now);
+    ;
     oscillator.stop(now + profile.durationMs / 1000);
     oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:47:27
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
-    oscillator.stop(now + profile.durationMs / 1000);
+    oscillator.stop(now + profile.durationMs * 1000);
     oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
     this.count += 1;

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:47:21
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
-    oscillator.stop(now + profile.durationMs / 1000);
+    oscillator.stop(now - profile.durationMs / 1000);
     oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
     this.count += 1;

[NoCoverage] BlockStatement
src/audio/actionCue.ts:48:48
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+    oscillator.addEventListener("ended", () => {});
     this.count += 1;
     this.lastCue = kind;

[NoCoverage] CallExpression
src/audio/actionCue.ts:48:75
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+    oscillator.addEventListener("ended", () => { oscillator.disconnect(); ; });
     this.count += 1;
     this.lastCue = kind;

[NoCoverage] AssignmentOperator
src/audio/actionCue.ts:49:5
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
     oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
-    this.count += 1;
+    this.count -= 1;
     this.lastCue = kind;
   }

[NoCoverage] BlockStatement
src/audio/actionCue.ts:53:165
     this.lastCue = kind;
   }
 
-  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
-  }
+  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {}
 
   dispose(): void {

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:54:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+    return { contextState: this.context.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:54:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+    return { contextState: this.context?.state && "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 

[NoCoverage] BlockStatement
src/audio/actionCue.ts:57:19
     return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 
-  dispose(): void {
-    void this.context?.close();
-    this.context = null;
-  }
+  dispose(): void {}
 }
 

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:58:10
   }
 
   dispose(): void {
-    void this.context?.close();
+    void this.context.close();
     this.context = null;
   }
