[Survived] BlockStatement
src/audio/ambientCue.ts:8:56
   readonly intervalMs: number;
 }
 
-export function ambientCueProfile(): AmbientCueProfile {
-  return { frequencyHz: 118, durationMs: 260, gain: 0.008, intervalMs: 6000 };
-}
+export function ambientCueProfile(): AmbientCueProfile {}
 
 type CueMode = "menu" | "active" | "paused" | "terminal";

[Survived] ObjectLiteral
src/audio/ambientCue.ts:9:10
 }
 
 export function ambientCueProfile(): AmbientCueProfile {
-  return { frequencyHz: 118, durationMs: 260, gain: 0.008, intervalMs: 6000 };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:21:32
   private count = 0;
   private lastCue: "stone-settle" | null = null;
 
-  setMode(mode: CueMode): void {
-    this.mode = mode;
-    if (mode === "active") {
-      void this.context?.resume();
-      this.schedule(true);
-      return;
-    }
-    this.clearTimer();
-    if (mode === "paused") void this.context?.suspend();
-    if (mode === "menu" || mode === "terminal") this.dispose();
-  }
+  setMode(mode: CueMode): void {}
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:23:9
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") {
+    if (mode !== "active") {
       void this.context?.resume();
       this.schedule(true);

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:23:28
 
   setMode(mode: CueMode): void {
     this.mode = mode;
-    if (mode === "active") {
-      void this.context?.resume();
-      this.schedule(true);
-      return;
-    }
+    if (mode === "active") {}
     this.clearTimer();
     if (mode === "paused") void this.context?.suspend();

[NoCoverage] BooleanLiteral
src/audio/ambientCue.ts:25:21
     this.mode = mode;
     if (mode === "active") {
       void this.context?.resume();
-      this.schedule(true);
+      this.schedule(false);
       return;
     }

[NoCoverage] CallExpression
src/audio/ambientCue.ts:28:5
       this.schedule(true);
       return;
     }
-    this.clearTimer();
+    ;
     if (mode === "paused") void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:29:9
       return;
     }
     this.clearTimer();
-    if (mode === "paused") void this.context?.suspend();
+    if (true) void this.context?.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();
   }

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:29:33
       return;
     }
     this.clearTimer();
-    if (mode === "paused") void this.context?.suspend();
+    if (mode === "paused") void this.context.suspend();
     if (mode === "menu" || mode === "terminal") this.dispose();
   }

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:33:166
     if (mode === "menu" || mode === "terminal") this.dispose();
   }
 
-  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
-  }
+  diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {}
 
   dispose(): void {

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:34:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+    return { contextState: this.context.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 

[NoCoverage] LogicalOperator
src/audio/ambientCue.ts:34:28
   }
 
   diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {
-    return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+    return { contextState: this.context?.state && "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:37:19
     return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
   }
 
-  dispose(): void {
-    this.clearTimer();
-    void this.context?.close();
-    this.context = null;
-  }
+  dispose(): void {}
 
   private ensureContext(): void {

[NoCoverage] CallExpression
src/audio/ambientCue.ts:38:5
   }
 
   dispose(): void {
-    this.clearTimer();
+    ;
     void this.context?.close();
     this.context = null;

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:39:10
 
   dispose(): void {
     this.clearTimer();
-    void this.context?.close();
+    void this.context.close();
     this.context = null;
   }

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:43:33
     this.context = null;
   }
 
-  private ensureContext(): void {
-    if (this.context) return;
-    const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (AudioContextConstructor) this.context = new AudioContextConstructor();
-  }
+  private ensureContext(): void {}
 
   private schedule(initial = false): void {

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:44:9
   }
 
   private ensureContext(): void {
-    if (this.context) return;
+    if (true) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (AudioContextConstructor) this.context = new AudioContextConstructor();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:44:9
   }
 
   private ensureContext(): void {
-    if (this.context) return;
+    if (false) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
     if (AudioContextConstructor) this.context = new AudioContextConstructor();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:46:9
   private ensureContext(): void {
     if (this.context) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (AudioContextConstructor) this.context = new AudioContextConstructor();
+    if (false) this.context = new AudioContextConstructor();
   }
 

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:46:9
   private ensureContext(): void {
     if (this.context) return;
     const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-    if (AudioContextConstructor) this.context = new AudioContextConstructor();
+    if (true) this.context = new AudioContextConstructor();
   }
 

[NoCoverage] BooleanLiteral
src/audio/ambientCue.ts:49:30
     if (AudioContextConstructor) this.context = new AudioContextConstructor();
   }
 
-  private schedule(initial = false): void {
+  private schedule(initial = true): void {
     this.clearTimer();
     if (this.mode !== "active") return;

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:49:43
     if (AudioContextConstructor) this.context = new AudioContextConstructor();
   }
 
-  private schedule(initial = false): void {
-    this.clearTimer();
-    if (this.mode !== "active") return;
-    const profile = ambientCueProfile();
-    this.timer = window.setTimeout(() => {
-      this.play();
-      this.schedule();
-    }, initial ? profile.intervalMs / 5 : profile.intervalMs);
-  }
+  private schedule(initial = false): void {}
 
   private play(): void {

[NoCoverage] CallExpression
src/audio/ambientCue.ts:50:5
   }
 
   private schedule(initial = false): void {
-    this.clearTimer();
+    ;
     if (this.mode !== "active") return;
     const profile = ambientCueProfile();

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:51:9
 
   private schedule(initial = false): void {
     this.clearTimer();
-    if (this.mode !== "active") return;
+    if (this.mode === "active") return;
     const profile = ambientCueProfile();
     this.timer = window.setTimeout(() => {

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:51:9
 
   private schedule(initial = false): void {
     this.clearTimer();
-    if (this.mode !== "active") return;
+    if (true) return;
     const profile = ambientCueProfile();
     this.timer = window.setTimeout(() => {

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:53:42
     this.clearTimer();
     if (this.mode !== "active") return;
     const profile = ambientCueProfile();
-    this.timer = window.setTimeout(() => {
-      this.play();
-      this.schedule();
-    }, initial ? profile.intervalMs / 5 : profile.intervalMs);
+    this.timer = window.setTimeout(() => {}, initial ? profile.intervalMs / 5 : profile.intervalMs);
   }
 

[NoCoverage] CallExpression
src/audio/ambientCue.ts:54:7
     if (this.mode !== "active") return;
     const profile = ambientCueProfile();
     this.timer = window.setTimeout(() => {
-      this.play();
+      ;
       this.schedule();
     }, initial ? profile.intervalMs / 5 : profile.intervalMs);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:55:7
     const profile = ambientCueProfile();
     this.timer = window.setTimeout(() => {
       this.play();
-      this.schedule();
+      ;
     }, initial ? profile.intervalMs / 5 : profile.intervalMs);
   }

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:56:18
     this.timer = window.setTimeout(() => {
       this.play();
       this.schedule();
-    }, initial ? profile.intervalMs / 5 : profile.intervalMs);
+    }, initial ? profile.intervalMs * 5 : profile.intervalMs);
   }
 

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:59:24
     }, initial ? profile.intervalMs / 5 : profile.intervalMs);
   }
 
-  private play(): void {
-    if (this.mode !== "active") return;
-    this.ensureContext();
-    if (!this.context) return;
-    const profile = ambientCueProfile();
-    const oscillator = this.context.createOscillator();
-    const gain = this.context.createGain();
-    const now = this.context.currentTime;
-    oscillator.type = "sine";
-    oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-    oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
-    gain.gain.setValueAtTime(profile.gain, now);
-    gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
-    oscillator.connect(gain).connect(this.context.destination);
-    oscillator.start(now);
-    oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => {
-      oscillator.disconnect();
-      gain.disconnect();
-      void this.context?.close();
-      this.context = null;
-    });
-    this.count += 1;
-    this.lastCue = "stone-settle";
-  }
+  private play(): void {}
 
   private clearTimer(): void {

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:60:9
   }
 
   private play(): void {
-    if (this.mode !== "active") return;
+    if (true) return;
     this.ensureContext();
     if (!this.context) return;

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:60:9
   }
 
   private play(): void {
-    if (this.mode !== "active") return;
+    if (this.mode === "active") return;
     this.ensureContext();
     if (!this.context) return;

[NoCoverage] CallExpression
src/audio/ambientCue.ts:61:5
 
   private play(): void {
     if (this.mode !== "active") return;
-    this.ensureContext();
+    ;
     if (!this.context) return;
     const profile = ambientCueProfile();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:62:9
   private play(): void {
     if (this.mode !== "active") return;
     this.ensureContext();
-    if (!this.context) return;
+    if (true) return;
     const profile = ambientCueProfile();
     const oscillator = this.context.createOscillator();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:62:9
   private play(): void {
     if (this.mode !== "active") return;
     this.ensureContext();
-    if (!this.context) return;
+    if (false) return;
     const profile = ambientCueProfile();
     const oscillator = this.context.createOscillator();

[NoCoverage] CallExpression
src/audio/ambientCue.ts:68:5
     const gain = this.context.createGain();
     const now = this.context.currentTime;
     oscillator.type = "sine";
-    oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
+    ;
     oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
     gain.gain.setValueAtTime(profile.gain, now);

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:69:65
     const now = this.context.currentTime;
     oscillator.type = "sine";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-    oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
+    oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs * 1000);
     gain.gain.setValueAtTime(profile.gain, now);
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:69:59
     const now = this.context.currentTime;
     oscillator.type = "sine";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-    oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
+    oscillator.frequency.exponentialRampToValueAtTime(82, now - profile.durationMs / 1000);
     gain.gain.setValueAtTime(profile.gain, now);
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:70:5
     oscillator.type = "sine";
     oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
     oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
-    gain.gain.setValueAtTime(profile.gain, now);
+    ;
     gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
     oscillator.connect(gain).connect(this.context.destination);

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:75:48
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => {
-      oscillator.disconnect();
-      gain.disconnect();
-      void this.context?.close();
-      this.context = null;
-    });
+    oscillator.addEventListener("ended", () => {});
     this.count += 1;
     this.lastCue = "stone-settle";

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:75:33
     oscillator.connect(gain).connect(this.context.destination);
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
-    oscillator.addEventListener("ended", () => {
+    oscillator.addEventListener("", () => {
       oscillator.disconnect();
       gain.disconnect();

[NoCoverage] CallExpression
src/audio/ambientCue.ts:76:7
     oscillator.start(now);
     oscillator.stop(now + profile.durationMs / 1000);
     oscillator.addEventListener("ended", () => {
-      oscillator.disconnect();
+      ;
       gain.disconnect();
       void this.context?.close();

[NoCoverage] CallExpression
src/audio/ambientCue.ts:77:7
     oscillator.stop(now + profile.durationMs / 1000);
     oscillator.addEventListener("ended", () => {
       oscillator.disconnect();
-      gain.disconnect();
+      ;
       void this.context?.close();
       this.context = null;

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:78:12
     oscillator.addEventListener("ended", () => {
       oscillator.disconnect();
       gain.disconnect();
-      void this.context?.close();
+      void this.context.close();
       this.context = null;
     });

[NoCoverage] AssignmentOperator
src/audio/ambientCue.ts:81:5
       void this.context?.close();
       this.context = null;
     });
-    this.count += 1;
+    this.count -= 1;
     this.lastCue = "stone-settle";
   }

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:85:30
     this.lastCue = "stone-settle";
   }
 
-  private clearTimer(): void {
-    if (this.timer !== null) window.clearTimeout(this.timer);
-    this.timer = null;
-  }
+  private clearTimer(): void {}
 }
 

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:86:9
   }
 
   private clearTimer(): void {
-    if (this.timer !== null) window.clearTimeout(this.timer);
+    if (this.timer === null) window.clearTimeout(this.timer);
     this.timer = null;
   }

[NoCoverage] CallExpression
src/audio/ambientCue.ts:86:30
   }
 
   private clearTimer(): void {
-    if (this.timer !== null) window.clearTimeout(this.timer);
+    if (this.timer !== null) ;
     this.timer = null;
   }
