[NoCoverage] StringLiteral
src/main.ts:11:44
 import "./style.css";
 
 document.documentElement.style.setProperty("--background-void", paletteHex(DUNGEON_PALETTE.backgroundVoid));
-document.documentElement.style.setProperty("--narrative-text", paletteHex(DUNGEON_PALETTE.narrativeText));
+document.documentElement.style.setProperty("", paletteHex(DUNGEON_PALETTE.narrativeText));
 
 const game = new Phaser.Game({

[NoCoverage] StringLiteral
src/main.ts:15:11
 
 const game = new Phaser.Game({
   type: Phaser.WEBGL,
-  parent: "game",
+  parent: "",
   width: 1280,
   height: 720,

[NoCoverage] BooleanLiteral
src/main.ts:19:13
   width: 1280,
   height: 720,
   backgroundColor: DUNGEON_PALETTE.backgroundVoid,
-  pixelArt: true,
+  pixelArt: false,
   antialias: false,
   scene: MainScene,

[NoCoverage] BooleanLiteral
src/main.ts:20:14
   height: 720,
   backgroundColor: DUNGEON_PALETTE.backgroundVoid,
   pixelArt: true,
-  antialias: false,
+  antialias: true,
   scene: MainScene,
   scale: { mode: Phaser.Scale.FIT, autoCenter: Phaser.Scale.CENTER_BOTH }

[NoCoverage] ObjectLiteral
src/main.ts:22:10
   pixelArt: true,
   antialias: false,
   scene: MainScene,
-  scale: { mode: Phaser.Scale.FIT, autoCenter: Phaser.Scale.CENTER_BOTH }
+  scale: {}
 });
 const healthCue = new HealthCue();

[NoCoverage] BlockStatement
src/main.ts:27:43
 const healthCue = new HealthCue();
 const actionCue = new ActionCue();
 const ambientCue = new AmbientCue();
-window.addEventListener("pagehide", () => {
-  healthCue.dispose();
-  actionCue.dispose();
-  ambientCue.dispose();
-});
+window.addEventListener("pagehide", () => {});
 
 const ui = document.createElement("section");

[NoCoverage] StringLiteral
src/main.ts:27:25
 const healthCue = new HealthCue();
 const actionCue = new ActionCue();
 const ambientCue = new AmbientCue();
-window.addEventListener("pagehide", () => {
+window.addEventListener("", () => {
   healthCue.dispose();
   actionCue.dispose();

[NoCoverage] CallExpression
src/main.ts:28:3
 const actionCue = new ActionCue();
 const ambientCue = new AmbientCue();
 window.addEventListener("pagehide", () => {
-  healthCue.dispose();
+  ;
   actionCue.dispose();
   ambientCue.dispose();

[NoCoverage] CallExpression
src/main.ts:29:3
 const ambientCue = new AmbientCue();
 window.addEventListener("pagehide", () => {
   healthCue.dispose();
-  actionCue.dispose();
+  ;
   ambientCue.dispose();
 });

[NoCoverage] CallExpression
src/main.ts:30:3
 window.addEventListener("pagehide", () => {
   healthCue.dispose();
   actionCue.dispose();
-  ambientCue.dispose();
+  ;
 });
 

[NoCoverage] CallExpression
src/main.ts:48:1
 </div>
-document.body.append(ui);
+;
 const start = ui.querySelector("[data-start]") as HTMLElement;
 const hud = ui.querySelector("[data-hud]") as HTMLElement;

[NoCoverage] BlockStatement
src/main.ts:75:56
 const leftDetail = ui.querySelector("[data-left-detail]") as HTMLElement;
 const rightDetail = ui.querySelector("[data-right-detail]") as HTMLElement;
 const motion = ui.querySelector("[data-motion]") as HTMLInputElement;
-const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
+const emit = (name: string, detail?: unknown): void => {};
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] OptionalChaining
src/main.ts:76:1
 const rightDetail = ui.querySelector("[data-right-detail]") as HTMLElement;
 const motion = ui.querySelector("[data-motion]") as HTMLInputElement;
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
-ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+ui.querySelector("form").addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));

[NoCoverage] BlockStatement
src/main.ts:76:65
 const rightDetail = ui.querySelector("[data-right-detail]") as HTMLElement;
 const motion = ui.querySelector("[data-motion]") as HTMLInputElement;
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
-ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+ui.querySelector("form")?.addEventListener("submit", (event) => {});
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));

[NoCoverage] BlockStatement
src/main.ts:77:70
 const motion = ui.querySelector("[data-motion]") as HTMLInputElement;
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
-ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+ui.querySelector("[data-generate]")?.addEventListener("click", () => {});
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] OptionalChaining
src/main.ts:77:1
 const motion = ui.querySelector("[data-motion]") as HTMLInputElement;
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
-ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+ui.querySelector("[data-generate]").addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] OptionalChaining
src/main.ts:78:1
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
-ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+ui.querySelector("[data-continue]").addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] ArrowFunction
src/main.ts:78:64
 const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
-ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+ui.querySelector("[data-continue]")?.addEventListener("click", () => undefined);
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] OptionalChaining
src/main.ts:79:1
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
-ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+ui.querySelector("[data-pause]").addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));

[NoCoverage] ArrowFunction
src/main.ts:79:61
 ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
-ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+ui.querySelector("[data-pause]")?.addEventListener("click", () => undefined);
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));

[NoCoverage] OptionalChaining
src/main.ts:80:1
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
-ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+ui.querySelector("[data-resume]").addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
 ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] ArrowFunction
src/main.ts:80:62
 ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
-ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+ui.querySelector("[data-resume]")?.addEventListener("click", () => undefined);
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
 ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] OptionalChaining
src/main.ts:81:1
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
-ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+ui.querySelector("[data-restart-same]").addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
 ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));

[NoCoverage] ArrowFunction
src/main.ts:81:68
 ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
-ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+ui.querySelector("[data-restart-same]")?.addEventListener("click", () => undefined);
 ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));

[NoCoverage] OptionalChaining
src/main.ts:82:1
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
-ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+ui.querySelector("[data-restart-new]").addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
 window.addEventListener("tarmin-mode", (event) => {

[NoCoverage] BlockStatement
src/main.ts:82:73
 ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
-ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+ui.querySelector("[data-restart-new]")?.addEventListener("click", () => {});
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
 window.addEventListener("tarmin-mode", (event) => {

[NoCoverage] ArrowFunction
src/main.ts:83:35
 ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
 ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
 ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
-motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
+motion.addEventListener("change", () => undefined);
 window.addEventListener("tarmin-mode", (event) => {
   const mode = (event as CustomEvent<string>).detail;

[NoCoverage] ConditionalExpression
src/main.ts:86:21
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
 window.addEventListener("tarmin-mode", (event) => {
   const mode = (event as CustomEvent<string>).detail;
-  healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  healthCue.setMode(false ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:52
 motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
 window.addEventListener("tarmin-mode", (event) => {
   const mode = (event as CustomEvent<string>).detail;
-  healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  healthCue.setMode(mode === "active" ? "active" : true ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:83
 window.addEventListener("tarmin-mode", (event) => {
   const mode = (event as CustomEvent<string>).detail;
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : false ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });

[NoCoverage] EqualityOperator
src/main.ts:87:83
 window.addEventListener("tarmin-mode", (event) => {
   const mode = (event as CustomEvent<string>).detail;
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode !== "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });

[NoCoverage] ConditionalExpression
src/main.ts:88:53
   const mode = (event as CustomEvent<string>).detail;
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  ambientCue.setMode(mode === "active" ? "active" : false ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });

[NoCoverage] ConditionalExpression
src/main.ts:88:84
   const mode = (event as CustomEvent<string>).detail;
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+  ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : false ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });

[NoCoverage] BooleanLiteral
src/main.ts:89:69
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: false, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });

[NoCoverage] ArrowFunction
src/main.ts:89:80
   healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
-  Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => undefined });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });

[NoCoverage] BooleanLiteral
src/main.ts:90:76
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
-  Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: false, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";

[NoCoverage] ArrowFunction
src/main.ts:90:87
   actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
-  Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => undefined });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";

[NoCoverage] ArrowFunction
src/main.ts:91:88
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
-  Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => undefined });
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] BooleanLiteral
src/main.ts:91:77
   ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
-  Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+  Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: false, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] EqualityOperator
src/main.ts:92:19
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
-  const running = mode !== "menu";
+  const running = mode === "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";

[NoCoverage] ConditionalExpression
src/main.ts:92:19
   Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
-  const running = mode !== "menu";
+  const running = false;
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";

[NoCoverage] EqualityOperator
src/main.ts:93:70
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";
-  start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+  start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode === "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] EqualityOperator
src/main.ts:93:154
   Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";
-  start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+  start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode === "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] EqualityOperator
src/main.ts:94:26
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
-  terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+  terminalPanel.hidden = mode === "defeated" && mode !== "victorious";
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
