[NoCoverage] ConditionalExpression
src/main.ts:94:26
   Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
-  terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+  terminalPanel.hidden = true;
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }

[NoCoverage] ConditionalExpression
src/main.ts:95:7
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
-  if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+  if (true) { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] BlockStatement
src/main.ts:95:28
   const running = mode !== "menu";
   start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
-  if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
+  if (mode === "defeated") {}
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] ConditionalExpression
src/main.ts:97:7
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
-  if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+  if (false) (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
   if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });

[NoCoverage] ConditionalExpression
src/main.ts:97:7
   terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
-  if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+  if (true) (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
   if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });

[NoCoverage] ConditionalExpression
src/main.ts:98:30
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
-  if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+  if (mode === "defeated" || false) (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });
 window.addEventListener("tarmin-events", (event) => {

[NoCoverage] ConditionalExpression
src/main.ts:98:7
   if (mode === "defeated") { terminalEyebrow.textContent = "RUN ENDED"; terminalTitle.textContent = "THE TORCH GUTTERS"; terminalCopy.textContent = "The undercrypt has won this descent."; }
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
-  if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+  if (false) (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });
 window.addEventListener("tarmin-events", (event) => {

[NoCoverage] BlockStatement
src/main.ts:100:53
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
   if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });
-window.addEventListener("tarmin-events", (event) => {
-  const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-  if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
-});
+window.addEventListener("tarmin-events", (event) => {});
 window.addEventListener("tarmin-state", (event) => {

[NoCoverage] CallExpression
src/main.ts:100:1
   if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
   if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
 });
-window.addEventListener("tarmin-events", (event) => {
-  const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-  if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
-});
+;
 window.addEventListener("tarmin-state", (event) => {

[NoCoverage] MethodExpression
src/main.ts:102:7
 });
 window.addEventListener("tarmin-events", (event) => {
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-  if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+  if (events.every(value => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] ArrowFunction
src/main.ts:102:19
 });
 window.addEventListener("tarmin-events", (event) => {
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-  if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+  if (events.some(() => undefined)) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] MethodExpression
src/main.ts:103:7
 window.addEventListener("tarmin-events", (event) => {
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+  if (events.every(value => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:103:7
 window.addEventListener("tarmin-events", (event) => {
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+  if (true) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] EqualityOperator
src/main.ts:104:30
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+  if (events.some((value) => value.type !== "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
 });

[NoCoverage] ConditionalExpression
src/main.ts:104:30
   const events = (event as CustomEvent<readonly { type: string }[]>).detail;
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+  if (events.some((value) => false)) actionCue.play("attack" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
 });

[NoCoverage] ConditionalExpression
src/main.ts:105:30
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+  if (events.some((value) => true)) actionCue.play("use" satisfies ActionCueKind);
 });
 window.addEventListener("tarmin-state", (event) => {

[NoCoverage] ConditionalExpression
src/main.ts:105:7
   if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-  if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+  if (true) actionCue.play("use" satisfies ActionCueKind);
 });
 window.addEventListener("tarmin-state", (event) => {

[NoCoverage] StringLiteral
src/main.ts:107:25
   if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
   if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
 });
-window.addEventListener("tarmin-state", (event) => {
+window.addEventListener("", (event) => {
   floor.textContent = `FLOOR ${detail.floor} · TURN ${detail.turn} · SEED ${detail.seed}`;

[NoCoverage] MethodExpression
src/main.ts:110:80
 window.addEventListener("tarmin-state", (event) => {
   floor.textContent = `FLOOR ${detail.floor} · TURN ${detail.turn} · SEED ${detail.seed}`;
-  location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toUpperCase()}`;
+  location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toLowerCase()}`;
   health.textContent = `${detail.health}/${detail.maxHealth}`;

[NoCoverage] CallExpression
src/main.ts:113:3
   location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toUpperCase()}`;
   health.textContent = `${detail.health}/${detail.maxHealth}`;
-  healthCue.update(detail.health, detail.maxHealth);
+  ;
   healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
   feedback.textContent = detail.feedback;

[NoCoverage] MethodExpression
src/main.ts:114:42
   health.textContent = `${detail.health}/${detail.maxHealth}`;
   healthCue.update(detail.health, detail.maxHealth);
-  healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+  healthBar.style.width = `${Math.max(0, Math.max(100, detail.health / detail.maxHealth * 100))}%`;
   feedback.textContent = detail.feedback;
   left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";

[NoCoverage] ArithmeticOperator
src/main.ts:114:56
   health.textContent = `${detail.health}/${detail.maxHealth}`;
   healthCue.update(detail.health, detail.maxHealth);
-  healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+  healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth / 100))}%`;
   feedback.textContent = detail.feedback;
   left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";

[NoCoverage] LogicalOperator
src/main.ts:116:70
   healthCue.update(detail.health, detail.maxHealth);
   healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
   feedback.textContent = detail.feedback;
-  left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+  left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand && "EMPTY";
   leftDetail.textContent = detail.leftDetail; rightDetail.textContent = detail.rightDetail;
   ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";

[NoCoverage] LogicalOperator
src/main.ts:116:22
   healthCue.update(detail.health, detail.maxHealth);
   healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
   feedback.textContent = detail.feedback;
-  left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+  left.textContent = detail.leftHand && "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
   leftDetail.textContent = detail.leftDetail; rightDetail.textContent = detail.rightDetail;
   ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";

[NoCoverage] LogicalOperator
src/main.ts:118:94
   feedback.textContent = detail.feedback;
   left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
   leftDetail.textContent = detail.leftDetail; rightDetail.textContent = detail.rightDetail;
-  ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+  ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] && "EMPTY" : "EMPTY";
   combatCard.hidden = !detail.encounter;

[NoCoverage] StringLiteral
src/main.ts:118:145
   feedback.textContent = detail.feedback;
   left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
   leftDetail.textContent = detail.leftDetail; rightDetail.textContent = detail.rightDetail;
-  ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+  ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "";
   combatCard.hidden = !detail.encounter;

[NoCoverage] BooleanLiteral
src/main.ts:120:23
   leftDetail.textContent = detail.leftDetail; rightDetail.textContent = detail.rightDetail;
   ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
-  combatCard.hidden = !detail.encounter;
+  combatCard.hidden = detail.encounter;
 });

[NoCoverage] BlockStatement
src/main.ts:123:47
   combatCard.hidden = !detail.encounter;
 });
-window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
+window.addEventListener("tarmin-start", () => {});
 window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
 void game;

[NoCoverage] StringLiteral
src/main.ts:123:77
   combatCard.hidden = !detail.encounter;
 });
-window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
+window.addEventListener("tarmin-start", () => { document.body.classList.add(""); });
 window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
 void game;

[NoCoverage] BooleanLiteral
src/main.ts:124:127
 });
 window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
-window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = (event as CustomEvent<boolean>).detail; });
 void game;
 

[NoCoverage] CallExpression
src/main.ts:124:1
 });
 window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
-window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+;
 void game;
 
