[NoCoverage] BlockStatement
src/save/checkpoint.ts:17:47
   removeItem(key: string): void;
 }
 
-function browserStorage(): StorageLike | null {
-  try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
-}
+function browserStorage(): StorageLike | null {}
 
 function isCheckpointState(value: unknown): value is GameState {

[NoCoverage] ConditionalExpression
src/save/checkpoint.ts:18:16
 }
 
 function browserStorage(): StorageLike | null {
-  try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+  try { return true ? null : window.localStorage; } catch { return null; }
 }
 

[NoCoverage] BlockStatement
src/save/checkpoint.ts:18:84
 }
 
 function browserStorage(): StorageLike | null {
-  try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+  try { return typeof window === "undefined" ? null : window.localStorage; } catch {}
 }
 

[Survived] BlockStatement
src/save/checkpoint.ts:21:64
   try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
 }
 
-function isCheckpointState(value: unknown): value is GameState {
-  if (!value || typeof value !== "object") return false;
-  const state = value as Partial<GameState>;
-  return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-    && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-    && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-    && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-    && typeof state.player === "object" && state.player !== null
-    && typeof state.objective === "object" && state.objective !== null;
-}
+function isCheckpointState(value: unknown): value is GameState {}
 
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {

[Survived] EqualityOperator
src/save/checkpoint.ts:22:17
 }
 
 function isCheckpointState(value: unknown): value is GameState {
-  if (!value || typeof value !== "object") return false;
+  if (!value || typeof value === "object") return false;
   const state = value as Partial<GameState>;
   return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)

[Survived] ConditionalExpression
src/save/checkpoint.ts:22:17
 }
 
 function isCheckpointState(value: unknown): value is GameState {
-  if (!value || typeof value !== "object") return false;
+  if (!value || false) return false;
   const state = value as Partial<GameState>;
   return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
 function isCheckpointState(value: unknown): value is GameState {
   if (!value || typeof value !== "object") return false;
   const state = value as Partial<GameState>;
-  return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-    && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+  return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" && Number.isInteger(state.floor) || Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
 function isCheckpointState(value: unknown): value is GameState {
   if (!value || typeof value !== "object") return false;
   const state = value as Partial<GameState>;
-  return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+  return state.rulesVersion === 3 && Number.isInteger(state.seed) || Number.isInteger(state.rngState)
     && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)

[Survived] EqualityOperator
src/save/checkpoint.ts:25:8
   if (!value || typeof value !== "object") return false;
   const state = value as Partial<GameState>;
   return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-    && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+    && state.runStatus !== "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)

[Survived] ConditionalExpression
src/save/checkpoint.ts:25:8
   if (!value || typeof value !== "object") return false;
   const state = value as Partial<GameState>;
   return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-    && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+    && true && Number.isInteger(state.floor) && Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)

[Survived] EqualityOperator
src/save/checkpoint.ts:28:44
     && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-    && typeof state.player === "object" && state.player !== null
+    && typeof state.player === "object" && state.player === null
     && typeof state.objective === "object" && state.objective !== null;
 }

[Survived] EqualityOperator
src/save/checkpoint.ts:28:8
     && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-    && typeof state.player === "object" && state.player !== null
+    && typeof state.player !== "object" && state.player !== null
     && typeof state.objective === "object" && state.objective !== null;
 }

[Survived] EqualityOperator
src/save/checkpoint.ts:29:47
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
     && typeof state.player === "object" && state.player !== null
-    && typeof state.objective === "object" && state.objective !== null;
+    && typeof state.objective === "object" && state.objective === null;
 }
 

[Survived] ConditionalExpression
src/save/checkpoint.ts:29:47
     && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
     && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
     && typeof state.player === "object" && state.player !== null
-    && typeof state.objective === "object" && state.objective !== null;
+    && typeof state.objective === "object" && true;
 }
 

[Survived] BlockStatement
src/save/checkpoint.ts:32:107
     && typeof state.objective === "object" && state.objective !== null;
 }
 
-export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
-  if (!storage || state.runStatus !== "playing") return false;
-  const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
-  try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
-}
+export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {}
 
 export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {

[Survived] BooleanLiteral
src/save/checkpoint.ts:33:7
 }
 
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
-  if (!storage || state.runStatus !== "playing") return false;
+  if (storage || state.runStatus !== "playing") return false;
   const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
   try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }

[Survived] ConditionalExpression
src/save/checkpoint.ts:33:19
 }
 
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
-  if (!storage || state.runStatus !== "playing") return false;
+  if (!storage || false) return false;
   const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
   try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }

[Survived] ObjectLiteral
src/save/checkpoint.ts:34:40
 
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
   if (!storage || state.runStatus !== "playing") return false;
-  const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
+  const envelope: CheckpointEnvelope = {};
   try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
 }

[Survived] CallExpression
src/save/checkpoint.ts:35:9
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
   if (!storage || state.runStatus !== "playing") return false;
   const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
-  try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+  try { ; return true; } catch { return false; }
 }
 

[Survived] BooleanLiteral
src/save/checkpoint.ts:35:83
 export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
   if (!storage || state.runStatus !== "playing") return false;
   const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
-  try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+  try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return false; } catch { return false; }
 }
 

[Survived] BlockStatement
src/save/checkpoint.ts:38:98
   try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
 }
 
-export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {
-  if (!storage) return null;
-  try {
-    const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-    if (!raw) return null;
-    const envelope: unknown = JSON.parse(raw);
-    if (!envelope || typeof envelope !== "object") return null;
-    const candidate = envelope as Partial<CheckpointEnvelope>;
-    return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
-  } catch { return null; }
-}
+export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {}
 
 export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {

[Survived] BooleanLiteral
src/save/checkpoint.ts:39:7
 }
 
 export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {
-  if (!storage) return null;
+  if (storage) return null;
   try {
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);

[Survived] ConditionalExpression
src/save/checkpoint.ts:39:7
 }
 
 export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {
-  if (!storage) return null;
+  if (false) return null;
   try {
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);

[Survived] BlockStatement
src/save/checkpoint.ts:40:7
 
 export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {
   if (!storage) return null;
-  try {
-    const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-    if (!raw) return null;
-    const envelope: unknown = JSON.parse(raw);
-    if (!envelope || typeof envelope !== "object") return null;
-    const candidate = envelope as Partial<CheckpointEnvelope>;
-    return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
-  } catch { return null; }
+  try {} catch { return null; }
 }
 

[Survived] BooleanLiteral
src/save/checkpoint.ts:42:9
   if (!storage) return null;
   try {
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-    if (!raw) return null;
+    if (raw) return null;
     const envelope: unknown = JSON.parse(raw);
     if (!envelope || typeof envelope !== "object") return null;

[Survived] ConditionalExpression
src/save/checkpoint.ts:42:9
   if (!storage) return null;
   try {
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-    if (!raw) return null;
+    if (true) return null;
     const envelope: unknown = JSON.parse(raw);
     if (!envelope || typeof envelope !== "object") return null;

[Survived] BooleanLiteral
src/save/checkpoint.ts:44:9
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
     if (!raw) return null;
     const envelope: unknown = JSON.parse(raw);
-    if (!envelope || typeof envelope !== "object") return null;
+    if (envelope || typeof envelope !== "object") return null;
     const candidate = envelope as Partial<CheckpointEnvelope>;
     return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;

[Survived] LogicalOperator
src/save/checkpoint.ts:44:9
     const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
     if (!raw) return null;
     const envelope: unknown = JSON.parse(raw);
-    if (!envelope || typeof envelope !== "object") return null;
+    if (!envelope && typeof envelope !== "object") return null;
     const candidate = envelope as Partial<CheckpointEnvelope>;
     return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;

[Survived] ConditionalExpression
src/save/checkpoint.ts:46:12
     const envelope: unknown = JSON.parse(raw);
     if (!envelope || typeof envelope !== "object") return null;
     const candidate = envelope as Partial<CheckpointEnvelope>;
-    return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+    return true ? candidate.state : null;
   } catch { return null; }
 }

[Survived] ConditionalExpression
src/save/checkpoint.ts:46:12
     const envelope: unknown = JSON.parse(raw);
     if (!envelope || typeof envelope !== "object") return null;
     const candidate = envelope as Partial<CheckpointEnvelope>;
-    return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+    return true && isCheckpointState(candidate.state) ? candidate.state : null;
   } catch { return null; }
 }

[Survived] BlockStatement
src/save/checkpoint.ts:47:11
     if (!envelope || typeof envelope !== "object") return null;
     const candidate = envelope as Partial<CheckpointEnvelope>;
     return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
-  } catch { return null; }
+  } catch {}
 }
 

[Survived] BlockStatement
src/save/checkpoint.ts:50:87
   } catch { return null; }
 }
 
-export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {
-  try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
-}
+export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {}
 

[Survived] BlockStatement
src/save/checkpoint.ts:51:7
 }
 
 export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {
-  try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
+  try {} catch { /* unavailable storage is non-fatal */ }
 }
 

[Survived] OptionalChaining
src/save/checkpoint.ts:51:9
 }
 
 export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {
-  try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
+  try { storage.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
 }
 
