[Survived] ConditionalExpression
src/sim/rng.ts:2:153
 export interface Rng { readonly state: number; }
-export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: false }; }
 

[Survived] ConditionalExpression
src/sim/rng.ts:2:153
 export interface Rng { readonly state: number; }
-export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: true }; }
 
