[Survived] StringLiteral
src/renderer/materials.ts:22:24
 }
 
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
-  "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+  "crypt-stone": { id: "", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
   "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },

[Survived] ObjectLiteral
src/renderer/materials.ts:22:18
 }
 
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
-  "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
+  "crypt-stone": {},
   "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },

[Survived] StringLiteral
src/renderer/materials.ts:23:58
 
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
   "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
-  "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+  "burial-masonry": { id: "burial-masonry", atlasRegion: "", fallbackColor: 0x3e3d2b, repeat: "tile" },
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },

[Survived] StringLiteral
src/renderer/materials.ts:23:27
 
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
   "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
-  "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+  "burial-masonry": { id: "", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },

[Survived] StringLiteral
src/renderer/materials.ts:24:83
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
   "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
   "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
-  basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+  basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },

[Survived] StringLiteral
src/renderer/materials.ts:24:17
 export const MATERIALS: Readonly<Record<MaterialId, MaterialDefinition>> = {
   "crypt-stone": { id: "crypt-stone", atlasRegion: "crypt-stone", fallbackColor: 0x4a4a2c, repeat: "tile" },
   "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
-  basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+  basalt: { id: "", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },

[Survived] StringLiteral
src/renderer/materials.ts:26:48
   "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
-  "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
+  "iron-door": { id: "iron-door", atlasRegion: "", fallbackColor: 0x4b4e43, repeat: "stretch" },
   "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
   "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },

[Survived] ObjectLiteral
src/renderer/materials.ts:27:18
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
-  "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+  "floor-stone": {},
   "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
   darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }

[Survived] StringLiteral
src/renderer/materials.ts:27:100
   basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
-  "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+  "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "" },
   "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
   darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }

[Survived] ObjectLiteral
src/renderer/materials.ts:28:20
   "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
   "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
-  "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
+  "ceiling-stone": {},
   darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
 };

[Survived] ObjectLiteral
src/renderer/materials.ts:29:13
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
   "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
   "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
-  darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+  darkness: {}
 };
 

[Survived] StringLiteral
src/renderer/materials.ts:29:44
   "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
   "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
   "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
-  darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+  darkness: { id: "darkness", atlasRegion: "", fallbackColor: 0x0e110b, repeat: "stretch" }
 };
 

[Survived] BlockStatement
src/renderer/materials.ts:32:106
   darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
 };
 
-export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
-  if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
-  if (kind === "passage" || kind === "open-door") return "darkness";
-  if (surface === "floor") return "floor-stone";
-  if (surface === "ceiling") return "ceiling-stone";
-  return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
-}
+export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {}
 

[Survived] ConditionalExpression
src/renderer/materials.ts:33:7
 };
 
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
-  if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+  if (false) return variation % 2 === 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";

[Survived] EqualityOperator
src/renderer/materials.ts:33:38
 };
 
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
-  if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+  if (kind === "closed-door") return variation % 2 !== 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";

[Survived] LogicalOperator
src/renderer/materials.ts:34:7
 
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
-  if (kind === "passage" || kind === "open-door") return "darkness";
+  if (kind === "passage" && kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";

[Survived] EqualityOperator
src/renderer/materials.ts:34:29
 
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
-  if (kind === "passage" || kind === "open-door") return "darkness";
+  if (kind === "passage" || kind !== "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";

[Survived] ConditionalExpression
src/renderer/materials.ts:35:7
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
-  if (surface === "floor") return "floor-stone";
+  if (false) return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";
   return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";

[Survived] ConditionalExpression
src/renderer/materials.ts:35:7
 export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
-  if (surface === "floor") return "floor-stone";
+  if (true) return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";
   return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";

[Survived] ConditionalExpression
src/renderer/materials.ts:36:7
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
-  if (surface === "ceiling") return "ceiling-stone";
+  if (false) return "ceiling-stone";
   return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
 }

[Survived] EqualityOperator
src/renderer/materials.ts:36:7
   if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
-  if (surface === "ceiling") return "ceiling-stone";
+  if (surface !== "ceiling") return "ceiling-stone";
   return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
 }

[Survived] ConditionalExpression
src/renderer/materials.ts:37:10
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";
-  return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+  return false ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
 }
 

[Survived] ConditionalExpression
src/renderer/materials.ts:37:44
   if (kind === "passage" || kind === "open-door") return "darkness";
   if (surface === "floor") return "floor-stone";
   if (surface === "ceiling") return "ceiling-stone";
-  return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
+  return variation === 0 ? "crypt-stone" : false ? "burial-masonry" : "basalt";
 }
 
