[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:28:13
 const DELTAS = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } } as const;
 const DEPTH_SCALE = [0, 1, 0.58, 0.34, 0.2] as const;
 const DEPTH_LIGHT = [0, 1, 0.68, 0.36, 0.14] as const;
-const key = (point: Point): string => `${point.x},${point.y}`;
+const key = () => undefined;
 
 function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:30:100
 const DEPTH_LIGHT = [0, 1, 0.68, 0.36, 0.14] as const;
 const key = (point: Point): string => `${point.x},${point.y}`;
 
-function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {
-  const forward = DELTAS[state.player.facing];
-  const dx = position.x - state.player.position.x;
-  const dy = position.y - state.player.position.y;
-  const depth = dx * forward.x + dy * forward.y;
-  const lateral = dx * -forward.y + dy * forward.x;
-  if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
-  return { depth, lateral };
-}
+function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {}
 
 function nearestOpaqueDepth(state: GameState): number | null {

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:32:14
 
 function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {
   const forward = DELTAS[state.player.facing];
-  const dx = position.x - state.player.position.x;
+  const dx = position.x + state.player.position.x;
   const dy = position.y - state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:33:14
 function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {
   const forward = DELTAS[state.player.facing];
   const dx = position.x - state.player.position.x;
-  const dy = position.y - state.player.position.y;
+  const dy = position.y + state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;
   const lateral = dx * -forward.y + dy * forward.x;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:34:17
   const forward = DELTAS[state.player.facing];
   const dx = position.x - state.player.position.x;
   const dy = position.y - state.player.position.y;
-  const depth = dx * forward.x + dy * forward.y;
+  const depth = dx * forward.x - dy * forward.y;
   const lateral = dx * -forward.y + dy * forward.x;
   if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:34:34
   const forward = DELTAS[state.player.facing];
   const dx = position.x - state.player.position.x;
   const dy = position.y - state.player.position.y;
-  const depth = dx * forward.x + dy * forward.y;
+  const depth = dx * forward.x + dy / forward.y;
   const lateral = dx * -forward.y + dy * forward.x;
   if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:35:19
   const dx = position.x - state.player.position.x;
   const dy = position.y - state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;
-  const lateral = dx * -forward.y + dy * forward.x;
+  const lateral = dx * -forward.y - dy * forward.x;
   if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
   return { depth, lateral };

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:35:37
   const dx = position.x - state.player.position.x;
   const dy = position.y - state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;
-  const lateral = dx * -forward.y + dy * forward.x;
+  const lateral = dx * -forward.y + dy / forward.x;
   if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
   return { depth, lateral };

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:48
   const dy = position.y - state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;
   const lateral = dx * -forward.y + dy * forward.x;
-  if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+  if (!Number.isInteger(depth) || depth < 1 || depth < PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
   return { depth, lateral };
 }

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:36:7
   const dy = position.y - state.player.position.y;
   const depth = dx * forward.x + dy * forward.y;
   const lateral = dx * -forward.y + dy * forward.x;
-  if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+  if (!Number.isInteger(depth) && depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
   return { depth, lateral };
 }

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:37:10
   const depth = dx * forward.x + dy * forward.y;
   const lateral = dx * -forward.y + dy * forward.x;
   if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
-  return { depth, lateral };
+  return {};
 }
 

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:40:62
   return { depth, lateral };
 }
 
-function nearestOpaqueDepth(state: GameState): number | null {
-  const forward = DELTAS[state.player.facing];
-  for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-    const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-    const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-    if (state.walls.includes(key(point)) || door?.open === false) return depth;
-  }
-  return null;
-}
+function nearestOpaqueDepth(state: GameState): number | null {}
 
 function billboardQuad(depth: number, lateral: number): PortalQuad {

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:42:65
 
 function nearestOpaqueDepth(state: GameState): number | null {
   const forward = DELTAS[state.player.facing];
-  for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-    const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-    const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-    if (state.walls.includes(key(point)) || door?.open === false) return depth;
-  }
+  for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {}
   return null;
 }

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:42:23
 
 function nearestOpaqueDepth(state: GameState): number | null {
   const forward = DELTAS[state.player.facing];
-  for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
+  for (let depth = 1; false; depth += 1) {
     const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
     const door = state.doors.find((candidate) => key(candidate.position) === key(point));

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:24
 function nearestOpaqueDepth(state: GameState): number | null {
   const forward = DELTAS[state.player.facing];
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-    const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+    const point = { x: state.player.position.x - forward.x * depth, y: state.player.position.y + forward.y * depth };
     const door = state.doors.find((candidate) => key(candidate.position) === key(point));
     if (state.walls.includes(key(point)) || door?.open === false) return depth;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:98
 function nearestOpaqueDepth(state: GameState): number | null {
   const forward = DELTAS[state.player.facing];
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-    const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+    const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y / depth };
     const door = state.doors.find((candidate) => key(candidate.position) === key(point));
     if (state.walls.includes(key(point)) || door?.open === false) return depth;

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:44:50
   const forward = DELTAS[state.player.facing];
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
     const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-    const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+    const door = state.doors.find((candidate) => false);
     if (state.walls.includes(key(point)) || door?.open === false) return depth;
   }

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:44:35
   const forward = DELTAS[state.player.facing];
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
     const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-    const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+    const door = state.doors.find(() => undefined);
     if (state.walls.includes(key(point)) || door?.open === false) return depth;
   }

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:45:9
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
     const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
     const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-    if (state.walls.includes(key(point)) || door?.open === false) return depth;
+    if (true) return depth;
   }
   return null;

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:45:45
   for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
     const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
     const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-    if (state.walls.includes(key(point)) || door?.open === false) return depth;
+    if (state.walls.includes(key(point)) || door?.open !== false) return depth;
   }
   return null;

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:50:68
   return null;
 }
 
-function billboardQuad(depth: number, lateral: number): PortalQuad {
-  const near = PORTAL_FRAMES[depth - 1];
-  const far = PORTAL_FRAMES[depth];
-  const scale = DEPTH_SCALE[depth];
-  const frameWidth = far.right - far.left;
-  const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
-  const width = frameWidth * 0.52 * scale;
-  const height = (far.bottom - far.top) * 0.78 * scale;
-  const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
-  const top = bottom - height;
-  return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
-}
+function billboardQuad(depth: number, lateral: number): PortalQuad {}
 
 export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:51:30
 }
 
 function billboardQuad(depth: number, lateral: number): PortalQuad {
-  const near = PORTAL_FRAMES[depth - 1];
+  const near = PORTAL_FRAMES[depth + 1];
   const far = PORTAL_FRAMES[depth];
   const scale = DEPTH_SCALE[depth];

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:54:22
   const near = PORTAL_FRAMES[depth - 1];
   const far = PORTAL_FRAMES[depth];
   const scale = DEPTH_SCALE[depth];
-  const frameWidth = far.right - far.left;
+  const frameWidth = far.right + far.left;
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:47
   const far = PORTAL_FRAMES[depth];
   const scale = DEPTH_SCALE[depth];
   const frameWidth = far.right - far.left;
-  const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+  const center = (far.left + far.right) / 2 + lateral / Math.max(1, depth) * frameWidth / 0.34;
   const width = frameWidth * 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:47
   const far = PORTAL_FRAMES[depth];
   const scale = DEPTH_SCALE[depth];
   const frameWidth = far.right - far.left;
-  const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+  const center = (far.left + far.right) / 2 + lateral / Math.max(1, depth) / frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:56:17
   const scale = DEPTH_SCALE[depth];
   const frameWidth = far.right - far.left;
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
-  const width = frameWidth * 0.52 * scale;
+  const width = frameWidth * 0.52 / scale;
   const height = (far.bottom - far.top) * 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:56:17
   const scale = DEPTH_SCALE[depth];
   const frameWidth = far.right - far.left;
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
-  const width = frameWidth * 0.52 * scale;
+  const width = frameWidth / 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:57:18
   const frameWidth = far.right - far.left;
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;
-  const height = (far.bottom - far.top) * 0.78 * scale;
+  const height = (far.bottom - far.top) * 0.78 / scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
   const top = bottom - height;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:57:18
   const frameWidth = far.right - far.left;
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;
-  const height = (far.bottom - far.top) * 0.78 * scale;
+  const height = (far.bottom - far.top) / 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
   const top = bottom - height;

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:18
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;
-  const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+  const bottom = far.bottom + (far.bottom - near.bottom) * 0.12 * scale;
   const top = bottom - height;
   return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:31
   const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
   const width = frameWidth * 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;
-  const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+  const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 / scale;
   const top = bottom - height;
   return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:59:15
   const width = frameWidth * 0.52 * scale;
   const height = (far.bottom - far.top) * 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
-  const top = bottom - height;
+  const top = bottom + height;
   return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
 }

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:133
   const height = (far.bottom - far.top) * 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
   const top = bottom - height;
-  return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+  return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width * 2, y: bottom }];
 }
 

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:51
   const height = (far.bottom - far.top) * 0.78 * scale;
   const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
   const top = bottom - height;
-  return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+  return [{ x: center - width / 2, y: top }, { x: center - width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
 }
 

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:63:113
   return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
 }
 
-export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {
-  const opaqueDepth = nearestOpaqueDepth(state);
-  return sources
-    .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-    .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-    .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
-    .map(({ source, coordinates }) => ({
-      id: source.id,
-      definitionId: source.definitionId,
-      presentationId: source.presentationId,
-      kind: source.kind,
-      depth: coordinates.depth,
-      position: source.position,
-      quad: billboardQuad(coordinates.depth, coordinates.lateral),
-      lightLevel: DEPTH_LIGHT[coordinates.depth]
-    }))
-    .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
-}
+export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {}
 
 export function entitySignature(entities: readonly EntityBillboard[]): string {

[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:65:10
 
 export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {
   const opaqueDepth = nearestOpaqueDepth(state);
-  return sources
-    .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-    .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-    .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+  return sources.map(source => ({
+  source,
+  coordinates: entityDepth(state, source.position)
+})).filter((entry): entry is {
+  source: EntitySource;
+  coordinates: {
+    depth: number;
+    lateral: number;
+  };
+} => Boolean(entry.coordinates))
     .map(({ source, coordinates }) => ({
       id: source.id,

[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:65:10
 
 export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {
   const opaqueDepth = nearestOpaqueDepth(state);
-  return sources
-    .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-    .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
+  return sources.map(source => ({
+  source,
+  coordinates: entityDepth(state, source.position)
+}))
     .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
     .map(({ source, coordinates }) => ({

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:66:10
 export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {
   const opaqueDepth = nearestOpaqueDepth(state);
   return sources
-    .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
+    .map(() => undefined)
     .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
     .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:67:13
   const opaqueDepth = nearestOpaqueDepth(state);
   return sources
     .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-    .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
+    .filter(() => undefined)
     .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
     .map(({ source, coordinates }) => ({

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:68:34
   return sources
     .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
     .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-    .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+    .filter(({ coordinates }) => opaqueDepth === null && coordinates.depth < opaqueDepth)
     .map(({ source, coordinates }) => ({
       id: source.id,

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:68:58
   return sources
     .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
     .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-    .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+    .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth >= opaqueDepth)
     .map(({ source, coordinates }) => ({
       id: source.id,

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:69:10
     .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
     .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
     .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
-    .map(({ source, coordinates }) => ({
-      id: source.id,
-      definitionId: source.definitionId,
-      presentationId: source.presentationId,
-      kind: source.kind,
-      depth: coordinates.depth,
-      position: source.position,
-      quad: billboardQuad(coordinates.depth, coordinates.lateral),
-      lightLevel: DEPTH_LIGHT[coordinates.depth]
-    }))
+    .map(() => undefined)
     .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
 }

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:69:40
     .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
     .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
     .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
-    .map(({ source, coordinates }) => ({
-      id: source.id,
-      definitionId: source.definitionId,
-      presentationId: source.presentationId,
-      kind: source.kind,
-      depth: coordinates.depth,
-      position: source.position,
-      quad: billboardQuad(coordinates.depth, coordinates.lateral),
-      lightLevel: DEPTH_LIGHT[coordinates.depth]
-    }))
+    .map(({ source, coordinates }) => ({}))
     .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
 }

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:79:30
       quad: billboardQuad(coordinates.depth, coordinates.lateral),
       lightLevel: DEPTH_LIGHT[coordinates.depth]
     }))
-    .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+    .sort((first, second) => second.depth + first.depth || first.id.localeCompare(second.id));
 }
 

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:79:30
       quad: billboardQuad(coordinates.depth, coordinates.lateral),
       lightLevel: DEPTH_LIGHT[coordinates.depth]
     }))
-    .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+    .sort((first, second) => false);
 }
 

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:82:79
     .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
 }
 
-export function entitySignature(entities: readonly EntityBillboard[]): string {
-  return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
-}
+export function entitySignature(entities: readonly EntityBillboard[]): string {}
 
 export function billboardFrameAt(presentationTimeMs: number): 0 | 1 {

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:83:104
 }
 
 export function entitySignature(entities: readonly EntityBillboard[]): string {
-  return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+  return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map(() => undefined).join(";")}`).join("|");
 }
 

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:83:23
 }
 
 export function entitySignature(entities: readonly EntityBillboard[]): string {
-  return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+  return entities.map(() => undefined).join("|");
 }
 

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:86:69
   return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
 }
 
-export function billboardFrameAt(presentationTimeMs: number): 0 | 1 {
-  return Math.floor(Math.max(0, presentationTimeMs) / 260) % 2 as 0 | 1;
-}
+export function billboardFrameAt(presentationTimeMs: number): 0 | 1 {}
 
