[Survived] BlockStatement
src/renderer/firstPerson/handPresentation.ts:16:77
   readonly right: FirstPersonHandSlot;
 }
 
-function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
-  const itemId = hand === "left" ? state.leftHand : state.rightHand;
-  const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
-  return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
-}
+function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {}
 
 /**

[Survived] EqualityOperator
src/renderer/firstPerson/handPresentation.ts:17:18
 }
 
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
-  const itemId = hand === "left" ? state.leftHand : state.rightHand;
+  const itemId = hand !== "left" ? state.leftHand : state.rightHand;
   const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
   return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:17:18
 }
 
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
-  const itemId = hand === "left" ? state.leftHand : state.rightHand;
+  const itemId = true ? state.leftHand : state.rightHand;
   const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
   return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:18:56
 
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
-  const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+  const item = itemId ? state.items.find((instance) => true) : undefined;
   return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
 }

[Survived] EqualityOperator
src/renderer/firstPerson/handPresentation.ts:18:56
 
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
-  const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+  const item = itemId ? state.items.find((instance) => instance.id !== itemId) : undefined;
   return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
 }

[Survived] OptionalChaining
src/renderer/firstPerson/handPresentation.ts:19:49
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
   const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
-  return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
+  return { hand, itemId, presentationId: item ? itemById(item.definitionId).presentationId ?? null : null };
 }
 

[Survived] LogicalOperator
src/renderer/firstPerson/handPresentation.ts:19:49
 function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
   const itemId = hand === "left" ? state.leftHand : state.rightHand;
   const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
-  return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
+  return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId && null : null };
 }
 

[Survived] BlockStatement
src/renderer/firstPerson/handPresentation.ts:27:91
  * current runtime has no approved held-object art, so both states use the
  * empty-hand asset; the item metadata remains available for a later composer.
  */
-export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {
-  return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
-}
+export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {}
 

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:28:64
  * empty-hand asset; the item metadata remains available for a later composer.
  */
 export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {
-  return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+  return { assetId: "fp-hands-empty", left: resolveSlot(state, ""), right: resolveSlot(state, "right") };
 }
 

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:28:99
  * empty-hand asset; the item metadata remains available for a later composer.
  */
 export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {
-  return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+  return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "") };
 }
 
