[Survived] StringLiteral
src/content/monsters.ts:3:34
 export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
-  { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+  { id: "ashbound-warden", name: "", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
   { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }

[Survived] StringLiteral
src/content/monsters.ts:3:134
 export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
-  { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+  { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "" },
   { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }

[Survived] StringLiteral
src/content/monsters.ts:4:134
 export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
   { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
-  { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+  { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
 ];

[Survived] StringLiteral
src/content/monsters.ts:4:9
 export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
   { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
-  { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+  { id: "", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
 ];

[Survived] StringLiteral
src/content/monsters.ts:5:137
 export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
   { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
   { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
-  { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+  { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "" }
 ];
 export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);

[Survived] ConditionalExpression
src/content/monsters.ts:7:113
   { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
 ];
-export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => false);
 

[Survived] ConditionalExpression
src/content/monsters.ts:7:113
   { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
   { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
 ];
-export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => true);
 
