[Survived] ObjectLiteral
src/content/items.ts:6:3
 export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
-  { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+  {},
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },

[Survived] StringLiteral
src/content/items.ts:6:74
 export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
-  { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+  { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "", attack: 2, presentationId: "pike" },
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },

[Survived] StringLiteral
src/content/items.ts:7:121
 export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
   { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
-  { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+  { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
   { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },

[Survived] StringLiteral
src/content/items.ts:8:65
 export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
   { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
-  { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+  { id: "moonward-buckler", name: "Moonward Buckler", category: "", handUsage: "either", defense: 1, presentationId: "buckler" },
   { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },

[Survived] StringLiteral
src/content/items.ts:8:125
 export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
   { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
-  { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+  { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "" },
   { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },

[Survived] StringLiteral
src/content/items.ts:9:75
   { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
-  { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+  { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "", defense: 2, presentationId: "mail" },
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }

[Survived] StringLiteral
src/content/items.ts:9:9
   { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
-  { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+  { id: "", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }

[Survived] StringLiteral
src/content/items.ts:10:53
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
   { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
-  { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+  { id: "moss-tonic", name: "Moss Tonic", category: "", healing: 3, presentationId: "tonic" },
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
 ];

[Survived] ObjectLiteral
src/content/items.ts:10:3
   { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
   { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
   { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
-  { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+  {},
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
 ];

[Survived] ConditionalExpression
src/content/items.ts:13:101
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
 ];
-export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => false);
 

[Survived] ArrowFunction
src/content/items.ts:13:91
   { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
   { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
 ];
-export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find(() => undefined);
 
