[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:22:50
  * Authored 32×32 Project Tarmin regions. Each has a copied one-pixel gutter in
  * the PNG; regions retain their canonical bounds so renderer UVs stay semantic.
  */
-export const DUNGEON_SURFACE_ATLAS: PixelAtlas = {
-  id: "tarmin-dungeon-surfaces-v2",
-  source: "/assets/dungeon/dungeon-surfaces.png",
-  pixelSize: 32,
-  width: 136,
-  height: 68,
-  regions: [
-    { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
-    { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
-    { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
-    { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
-    { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
-    { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
-    { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
-    { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
-  ]
-};
+export const DUNGEON_SURFACE_ATLAS: PixelAtlas = {};
 

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:23:7
  * the PNG; regions retain their canonical bounds so renderer UVs stay semantic.
  */
 export const DUNGEON_SURFACE_ATLAS: PixelAtlas = {
-  id: "tarmin-dungeon-surfaces-v2",
+  id: "",
   source: "/assets/dungeon/dungeon-surfaces.png",
   pixelSize: 32,

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:29:5
   width: 136,
   height: 68,
   regions: [
-    { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
+    {},
     { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
     { id: "basalt", x: 69, y: 1, width: 32, height: 32 },

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:30:11
   height: 68,
   regions: [
     { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
-    { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
+    { id: "", x: 35, y: 1, width: 32, height: 32 },
     { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
     { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:31:5
   regions: [
     { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
     { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
-    { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
+    {},
     { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
     { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:33:11
     { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
     { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
     { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
-    { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
+    { id: "", x: 1, y: 35, width: 32, height: 32 },
     { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
     { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:34:5
     { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
     { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
     { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
-    { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
+    {},
     { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
     { id: "darkness", x: 103, y: 35, width: 32, height: 32 }

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:34:11
     { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
     { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
     { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
-    { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
+    { id: "", x: 35, y: 35, width: 32, height: 32 },
     { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
     { id: "darkness", x: 103, y: 35, width: 32, height: 32 }

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:36:11
     { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
     { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
     { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
-    { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
+    { id: "", x: 103, y: 35, width: 32, height: 32 }
   ]
 };

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:36:5
     { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
     { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
     { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
-    { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
+    {}
   ]
 };
