[NoCoverage] StringLiteral
src/audio/actionCue.ts:20:27
-     private mode: CueMode = "menu";
+     private mode: CueMode = "";

[NoCoverage] BlockStatement
src/audio/actionCue.ts:24:32
-     setMode(mode: CueMode): void {
-       this.mode = mode;
-       if (mode === "active") void this.context?.resume();
-       if (mode === "paused") void this.context?.suspend();
-       if (mode === "menu" || mode === "terminal") this.dispose();
-     }
+     setMode(mode: CueMode): void {}

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:26:9
-       if (mode === "active") void this.context?.resume();
+       if (true) void this.context?.resume();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:26:9
-       if (mode === "active") void this.context?.resume();
+       if (false) void this.context?.resume();

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:26:9
-       if (mode === "active") void this.context?.resume();
+       if (mode !== "active") void this.context?.resume();

[NoCoverage] StringLiteral
src/audio/actionCue.ts:26:18
-       if (mode === "active") void this.context?.resume();
+       if (mode === "") void this.context?.resume();

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:26:33
-       if (mode === "active") void this.context?.resume();
+       if (mode === "active") void this.context.resume();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:27:9
-       if (mode === "paused") void this.context?.suspend();
+       if (true) void this.context?.suspend();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:27:9
-       if (mode === "paused") void this.context?.suspend();
+       if (false) void this.context?.suspend();

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:27:9
-       if (mode === "paused") void this.context?.suspend();
+       if (mode !== "paused") void this.context?.suspend();

[NoCoverage] StringLiteral
src/audio/actionCue.ts:27:18
-       if (mode === "paused") void this.context?.suspend();
+       if (mode === "") void this.context?.suspend();

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:27:33
-       if (mode === "paused") void this.context?.suspend();
+       if (mode === "paused") void this.context.suspend();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:28:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (true) this.dispose();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:28:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (false) this.dispose();

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:28:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" && mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:28:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (false || mode === "terminal") this.dispose();

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:28:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode !== "menu" || mode === "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/actionCue.ts:28:18
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:28:28
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || false) this.dispose();

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:28:28
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode !== "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/actionCue.ts:28:37
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode === "") this.dispose();

[NoCoverage] CallExpression
src/audio/actionCue.ts:28:49
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode === "terminal") ;

[NoCoverage] BlockStatement
src/audio/actionCue.ts:31:35
-     play(kind: ActionCueKind): void {
-       if (this.mode !== "active") return;
-       const profile = actionCueProfile(kind);
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-       if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
-       if (!this.context) return;
-       void this.context.resume();
-       const oscillator = this.context.createOscillator();
-       const gain = this.context.createGain();
-       const now = this.context.currentTime;
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
-       oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-       gain.gain.setValueAtTime(profile.gain, now);
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
-       oscillator.connect(gain).connect(this.context.destination);
-       oscillator.start(now);
-       oscillator.stop(now + profile.durationMs / 1000);
-       oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
-       this.count += 1;
-       this.lastCue = kind;
-     }
+     play(kind: ActionCueKind): void {}

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:32:9
-       if (this.mode !== "active") return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:32:9
-       if (this.mode !== "active") return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:32:9
-       if (this.mode !== "active") return;
+       if (this.mode === "active") return;

[NoCoverage] StringLiteral
src/audio/actionCue.ts:32:23
-       if (this.mode !== "active") return;
+       if (this.mode !== "") return;

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:34:37
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
+       const AudioContextConstructor = window.AudioContext && (window as typeof window & {
+     webkitAudioContext?: typeof AudioContext;
+   }).webkitAudioContext;

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:35:9
-       if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (true) this.context = new AudioContextConstructor();

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:35:9
-       if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (false) this.context = new AudioContextConstructor();

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:35:9
-       if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (!this.context || AudioContextConstructor) this.context = new AudioContextConstructor();

[NoCoverage] BooleanLiteral
src/audio/actionCue.ts:35:9
-       if (!this.context && AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (this.context && AudioContextConstructor) this.context = new AudioContextConstructor();

[NoCoverage] BooleanLiteral
src/audio/actionCue.ts:36:9
-       if (!this.context) return;
+       if (this.context) return;

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:36:9
-       if (!this.context) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:36:9
-       if (!this.context) return;
+       if (false) return;

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:41:23
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = true ? "square" : "triangle";

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:41:23
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = false ? "square" : "triangle";

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:41:23
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" && kind === "encounter" ? "square" : "triangle";

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:41:23
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = false || kind === "encounter" ? "square" : "triangle";

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:41:23
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind !== "attack" || kind === "encounter" ? "square" : "triangle";

[NoCoverage] StringLiteral
src/audio/actionCue.ts:41:32
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "" || kind === "encounter" ? "square" : "triangle";

[NoCoverage] ConditionalExpression
src/audio/actionCue.ts:41:44
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" || false ? "square" : "triangle";

[NoCoverage] EqualityOperator
src/audio/actionCue.ts:41:44
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" || kind !== "encounter" ? "square" : "triangle";

[NoCoverage] StringLiteral
src/audio/actionCue.ts:41:53
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" || kind === "" ? "square" : "triangle";

[NoCoverage] StringLiteral
src/audio/actionCue.ts:41:67
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" || kind === "encounter" ? "" : "triangle";

[NoCoverage] StringLiteral
src/audio/actionCue.ts:41:78
-       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "triangle";
+       oscillator.type = kind === "attack" || kind === "encounter" ? "square" : "";

[NoCoverage] CallExpression
src/audio/actionCue.ts:42:5
-       oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
+       ;

[NoCoverage] CallExpression
src/audio/actionCue.ts:43:5
-       gain.gain.setValueAtTime(profile.gain, now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:44:42
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+       gain.gain.linearRampToValueAtTime(0, now - profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:44:48
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs * 1000);

[NoCoverage] CallExpression
src/audio/actionCue.ts:45:5
-       oscillator.connect(gain).connect(this.context.destination);
+       ;

[NoCoverage] CallExpression
src/audio/actionCue.ts:46:5
-       oscillator.start(now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:47:21
-       oscillator.stop(now + profile.durationMs / 1000);
+       oscillator.stop(now - profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/actionCue.ts:47:27
-       oscillator.stop(now + profile.durationMs / 1000);
+       oscillator.stop(now + profile.durationMs * 1000);

[NoCoverage] StringLiteral
src/audio/actionCue.ts:48:33
-       oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+       oscillator.addEventListener("", () => { oscillator.disconnect(); gain.disconnect(); });

[NoCoverage] BlockStatement
src/audio/actionCue.ts:48:48
-       oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+       oscillator.addEventListener("ended", () => {});

[NoCoverage] CallExpression
src/audio/actionCue.ts:48:50
-       oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+       oscillator.addEventListener("ended", () => { ; gain.disconnect(); });

[NoCoverage] CallExpression
src/audio/actionCue.ts:48:75
-       oscillator.addEventListener("ended", () => { oscillator.disconnect(); gain.disconnect(); });
+       oscillator.addEventListener("ended", () => { oscillator.disconnect(); ; });

[NoCoverage] AssignmentOperator
src/audio/actionCue.ts:49:5
-       this.count += 1;
+       this.count -= 1;

[NoCoverage] BlockStatement
src/audio/actionCue.ts:53:165
-     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
-     }
+     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: ActionCueKind | null } {}

[NoCoverage] ObjectLiteral
src/audio/actionCue.ts:54:12
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return {};

[NoCoverage] LogicalOperator
src/audio/actionCue.ts:54:28
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context?.state && "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:54:28
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] StringLiteral
src/audio/actionCue.ts:54:51
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context?.state ?? "", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] BlockStatement
src/audio/actionCue.ts:57:19
-     dispose(): void {
-       void this.context?.close();
-       this.context = null;
-     }
+     dispose(): void {}

[NoCoverage] OptionalChaining
src/audio/actionCue.ts:58:10
-       void this.context?.close();
+       void this.context.close();

[Survived] BlockStatement
src/audio/actionCue.ts:9:73
-   export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
-     return { frequencyHz: 440, durationMs: 70, gain: 0.032 };
-   }
+   export function actionCueProfile(kind: ActionCueKind): ActionCueProfile {}
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:10:7
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+     if (true) return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:10:7
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+     if (false) return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] EqualityOperator
src/audio/actionCue.ts:10:7
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+     if (kind !== "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] StringLiteral
src/audio/actionCue.ts:10:16
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+     if (kind === "") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ObjectLiteral
src/audio/actionCue.ts:10:33
-     if (kind === "attack") return { frequencyHz: 220, durationMs: 80, gain: 0.035 };
+     if (kind === "attack") return {};
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:11:7
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+     if (false) return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:11:7
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+     if (true) return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] EqualityOperator
src/audio/actionCue.ts:11:7
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+     if (kind !== "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] StringLiteral
src/audio/actionCue.ts:11:16
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+     if (kind === "") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ObjectLiteral
src/audio/actionCue.ts:11:30
-     if (kind === "use") return { frequencyHz: 330, durationMs: 110, gain: 0.028 };
+     if (kind === "use") return {};
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:12:7
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+     if (true) return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ConditionalExpression
src/audio/actionCue.ts:12:7
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+     if (false) return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] StringLiteral
src/audio/actionCue.ts:12:16
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+     if (kind === "") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] EqualityOperator
src/audio/actionCue.ts:12:7
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+     if (kind !== "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ObjectLiteral
src/audio/actionCue.ts:12:36
-     if (kind === "encounter") return { frequencyHz: 150, durationMs: 180, gain: 0.04 };
+     if (kind === "encounter") return {};
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[Survived] ObjectLiteral
src/audio/actionCue.ts:13:10
-     return { frequencyHz: 440, durationMs: 70, gain: 0.032 };
+     return {};
Tests ran:
    action cue profiles keeps attack and use cues short and distinct

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:17:27
-     private mode: CueMode = "menu";
+     private mode: CueMode = "";

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:21:32
-     setMode(mode: CueMode): void {
-       this.mode = mode;
-       if (mode === "active") {
-         void this.context?.resume();
-         this.schedule(true);
-         return;
-       }
-       this.clearTimer();
-       if (mode === "paused") void this.context?.suspend();
-       if (mode === "menu" || mode === "terminal") this.dispose();
-     }
+     setMode(mode: CueMode): void {}

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:23:9
-       if (mode === "active") {
+       if (true) {

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:23:9
-       if (mode === "active") {
+       if (false) {

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:23:9
-       if (mode === "active") {
+       if (mode !== "active") {

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:23:18
-       if (mode === "active") {
+       if (mode === "") {

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:23:28
-       if (mode === "active") {
-         void this.context?.resume();
-         this.schedule(true);
-         return;
-       }
+       if (mode === "active") {}

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:24:12
-         void this.context?.resume();
+         void this.context.resume();

[NoCoverage] BooleanLiteral
src/audio/ambientCue.ts:25:21
-         this.schedule(true);
+         this.schedule(false);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:28:5
-       this.clearTimer();
+       ;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:29:9
-       if (mode === "paused") void this.context?.suspend();
+       if (true) void this.context?.suspend();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:29:9
-       if (mode === "paused") void this.context?.suspend();
+       if (false) void this.context?.suspend();

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:29:9
-       if (mode === "paused") void this.context?.suspend();
+       if (mode !== "paused") void this.context?.suspend();

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:29:18
-       if (mode === "paused") void this.context?.suspend();
+       if (mode === "") void this.context?.suspend();

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:29:33
-       if (mode === "paused") void this.context?.suspend();
+       if (mode === "paused") void this.context.suspend();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:30:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (true) this.dispose();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:30:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (false) this.dispose();

[NoCoverage] LogicalOperator
src/audio/ambientCue.ts:30:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" && mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:30:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (false || mode === "terminal") this.dispose();

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:30:9
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode !== "menu" || mode === "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:30:18
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:30:28
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || false) this.dispose();

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:30:28
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode !== "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:30:37
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode === "") this.dispose();

[NoCoverage] CallExpression
src/audio/ambientCue.ts:30:49
-       if (mode === "menu" || mode === "terminal") this.dispose();
+       if (mode === "menu" || mode === "terminal") ;

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:33:166
-     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
-     }
+     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly mode: CueMode; readonly count: number; readonly lastCue: "stone-settle" | null } {}

[NoCoverage] ObjectLiteral
src/audio/ambientCue.ts:34:12
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return {};

[NoCoverage] LogicalOperator
src/audio/ambientCue.ts:34:28
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context?.state && "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:34:28
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:34:51
-       return { contextState: this.context?.state ?? "uncreated", mode: this.mode, count: this.count, lastCue: this.lastCue };
+       return { contextState: this.context?.state ?? "", mode: this.mode, count: this.count, lastCue: this.lastCue };

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:37:19
-     dispose(): void {
-       this.clearTimer();
-       void this.context?.close();
-       this.context = null;
-     }
+     dispose(): void {}

[NoCoverage] CallExpression
src/audio/ambientCue.ts:38:5
-       this.clearTimer();
+       ;

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:39:10
-       void this.context?.close();
+       void this.context.close();

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:43:33
-     private ensureContext(): void {
-       if (this.context) return;
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-       if (AudioContextConstructor) this.context = new AudioContextConstructor();
-     }
+     private ensureContext(): void {}

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:44:9
-       if (this.context) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:44:9
-       if (this.context) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/audio/ambientCue.ts:45:37
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
+       const AudioContextConstructor = window.AudioContext && (window as typeof window & {
+     webkitAudioContext?: typeof AudioContext;
+   }).webkitAudioContext;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:46:9
-       if (AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (true) this.context = new AudioContextConstructor();

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:46:9
-       if (AudioContextConstructor) this.context = new AudioContextConstructor();
+       if (false) this.context = new AudioContextConstructor();

[NoCoverage] BooleanLiteral
src/audio/ambientCue.ts:49:30
-     private schedule(initial = false): void {
+     private schedule(initial = true): void {

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:49:43
-     private schedule(initial = false): void {
-       this.clearTimer();
-       if (this.mode !== "active") return;
-       const profile = ambientCueProfile();
-       this.timer = window.setTimeout(() => {
-         this.play();
-         this.schedule();
-       }, initial ? profile.intervalMs / 5 : profile.intervalMs);
-     }
+     private schedule(initial = false): void {}

[NoCoverage] CallExpression
src/audio/ambientCue.ts:50:5
-       this.clearTimer();
+       ;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:51:9
-       if (this.mode !== "active") return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:51:9
-       if (this.mode !== "active") return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:51:9
-       if (this.mode !== "active") return;
+       if (this.mode === "active") return;

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:51:23
-       if (this.mode !== "active") return;
+       if (this.mode !== "") return;

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:53:42
-       this.timer = window.setTimeout(() => {
-         this.play();
-         this.schedule();
-       }, initial ? profile.intervalMs / 5 : profile.intervalMs);
+       this.timer = window.setTimeout(() => {}, initial ? profile.intervalMs / 5 : profile.intervalMs);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:54:7
-         this.play();
+         ;

[NoCoverage] CallExpression
src/audio/ambientCue.ts:55:7
-         this.schedule();
+         ;
