[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:56:18
-       }, initial ? profile.intervalMs / 5 : profile.intervalMs);
+       }, initial ? profile.intervalMs * 5 : profile.intervalMs);

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:59:24
-     private play(): void {
-       if (this.mode !== "active") return;
-       this.ensureContext();
-       if (!this.context) return;
-       const profile = ambientCueProfile();
-       const oscillator = this.context.createOscillator();
-       const gain = this.context.createGain();
-       const now = this.context.currentTime;
-       oscillator.type = "sine";
-       oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
-       oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
-       gain.gain.setValueAtTime(profile.gain, now);
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
-       oscillator.connect(gain).connect(this.context.destination);
-       oscillator.start(now);
-       oscillator.stop(now + profile.durationMs / 1000);
-       oscillator.addEventListener("ended", () => {
-         oscillator.disconnect();
-         gain.disconnect();
-         void this.context?.close();
-         this.context = null;
-       });
-       this.count += 1;
-       this.lastCue = "stone-settle";
-     }
+     private play(): void {}

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:60:9
-       if (this.mode !== "active") return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:60:9
-       if (this.mode !== "active") return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:60:9
-       if (this.mode !== "active") return;
+       if (this.mode === "active") return;

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:60:23
-       if (this.mode !== "active") return;
+       if (this.mode !== "") return;

[NoCoverage] CallExpression
src/audio/ambientCue.ts:61:5
-       this.ensureContext();
+       ;

[NoCoverage] BooleanLiteral
src/audio/ambientCue.ts:62:9
-       if (!this.context) return;
+       if (this.context) return;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:62:9
-       if (!this.context) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:62:9
-       if (!this.context) return;
+       if (false) return;

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:67:23
-       oscillator.type = "sine";
+       oscillator.type = "";

[NoCoverage] CallExpression
src/audio/ambientCue.ts:68:5
-       oscillator.frequency.setValueAtTime(profile.frequencyHz, now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:69:59
-       oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
+       oscillator.frequency.exponentialRampToValueAtTime(82, now - profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:69:65
-       oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs / 1000);
+       oscillator.frequency.exponentialRampToValueAtTime(82, now + profile.durationMs * 1000);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:70:5
-       gain.gain.setValueAtTime(profile.gain, now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:71:42
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+       gain.gain.linearRampToValueAtTime(0, now - profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:71:48
-       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs / 1000);
+       gain.gain.linearRampToValueAtTime(0, now + profile.durationMs * 1000);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:72:5
-       oscillator.connect(gain).connect(this.context.destination);
+       ;

[NoCoverage] CallExpression
src/audio/ambientCue.ts:73:5
-       oscillator.start(now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:74:21
-       oscillator.stop(now + profile.durationMs / 1000);
+       oscillator.stop(now - profile.durationMs / 1000);

[NoCoverage] ArithmeticOperator
src/audio/ambientCue.ts:74:27
-       oscillator.stop(now + profile.durationMs / 1000);
+       oscillator.stop(now + profile.durationMs * 1000);

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:75:33
-       oscillator.addEventListener("ended", () => {
+       oscillator.addEventListener("", () => {

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:75:48
-       oscillator.addEventListener("ended", () => {
-         oscillator.disconnect();
-         gain.disconnect();
-         void this.context?.close();
-         this.context = null;
-       });
+       oscillator.addEventListener("ended", () => {});

[NoCoverage] CallExpression
src/audio/ambientCue.ts:76:7
-         oscillator.disconnect();
+         ;

[NoCoverage] CallExpression
src/audio/ambientCue.ts:77:7
-         gain.disconnect();
+         ;

[NoCoverage] OptionalChaining
src/audio/ambientCue.ts:78:12
-         void this.context?.close();
+         void this.context.close();

[NoCoverage] AssignmentOperator
src/audio/ambientCue.ts:81:5
-       this.count += 1;
+       this.count -= 1;

[NoCoverage] StringLiteral
src/audio/ambientCue.ts:82:20
-       this.lastCue = "stone-settle";
+       this.lastCue = "";

[NoCoverage] BlockStatement
src/audio/ambientCue.ts:85:30
-     private clearTimer(): void {
-       if (this.timer !== null) window.clearTimeout(this.timer);
-       this.timer = null;
-     }
+     private clearTimer(): void {}

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:86:9
-       if (this.timer !== null) window.clearTimeout(this.timer);
+       if (true) window.clearTimeout(this.timer);

[NoCoverage] ConditionalExpression
src/audio/ambientCue.ts:86:9
-       if (this.timer !== null) window.clearTimeout(this.timer);
+       if (false) window.clearTimeout(this.timer);

[NoCoverage] EqualityOperator
src/audio/ambientCue.ts:86:9
-       if (this.timer !== null) window.clearTimeout(this.timer);
+       if (this.timer === null) window.clearTimeout(this.timer);

[NoCoverage] CallExpression
src/audio/ambientCue.ts:86:30
-       if (this.timer !== null) window.clearTimeout(this.timer);
+       if (this.timer !== null) ;

[Survived] BlockStatement
src/audio/ambientCue.ts:8:56
-   export function ambientCueProfile(): AmbientCueProfile {
-     return { frequencyHz: 118, durationMs: 260, gain: 0.008, intervalMs: 6000 };
-   }
+   export function ambientCueProfile(): AmbientCueProfile {}
Tests ran:
    ambient cue is a sparse, low-intensity non-musical punctuation profile

[Survived] ObjectLiteral
src/audio/ambientCue.ts:9:10
-     return { frequencyHz: 118, durationMs: 260, gain: 0.008, intervalMs: 6000 };
+     return {};
Tests ran:
    ambient cue is a sparse, low-intensity non-musical punctuation profile

[NoCoverage] StringLiteral
src/audio/healthCue.ts:27:27
-     private mode: CueMode = "menu";
+     private mode: CueMode = "";

[NoCoverage] BlockStatement
src/audio/healthCue.ts:29:32
-     setMode(mode: CueMode): void {
-       this.mode = mode;
-       if (mode === "active") {
-         void this.context?.resume();
-         this.syncPulse();
-       } else {
-         this.stopPulse();
-         if (mode === "paused") void this.context?.suspend();
-         if (mode === "menu" || mode === "terminal") this.dispose();
-       }
-     }
+     setMode(mode: CueMode): void {}

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:31:9
-       if (mode === "active") {
+       if (true) {

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:31:9
-       if (mode === "active") {
+       if (false) {

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:31:9
-       if (mode === "active") {
+       if (mode !== "active") {

[NoCoverage] StringLiteral
src/audio/healthCue.ts:31:18
-       if (mode === "active") {
+       if (mode === "") {

[NoCoverage] BlockStatement
src/audio/healthCue.ts:31:28
-       if (mode === "active") {
-         void this.context?.resume();
-         this.syncPulse();
-       } else {
+       if (mode === "active") {} else {

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:32:12
-         void this.context?.resume();
+         void this.context.resume();

[NoCoverage] CallExpression
src/audio/healthCue.ts:33:7
-         this.syncPulse();
+         ;

[NoCoverage] BlockStatement
src/audio/healthCue.ts:34:12
-       } else {
-         this.stopPulse();
-         if (mode === "paused") void this.context?.suspend();
-         if (mode === "menu" || mode === "terminal") this.dispose();
-       }
+       } else {}

[NoCoverage] CallExpression
src/audio/healthCue.ts:35:7
-         this.stopPulse();
+         ;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:36:11
-         if (mode === "paused") void this.context?.suspend();
+         if (true) void this.context?.suspend();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:36:11
-         if (mode === "paused") void this.context?.suspend();
+         if (false) void this.context?.suspend();

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:36:11
-         if (mode === "paused") void this.context?.suspend();
+         if (mode !== "paused") void this.context?.suspend();

[NoCoverage] StringLiteral
src/audio/healthCue.ts:36:20
-         if (mode === "paused") void this.context?.suspend();
+         if (mode === "") void this.context?.suspend();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:36:35
-         if (mode === "paused") void this.context?.suspend();
+         if (mode === "paused") void this.context.suspend();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:37:11
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (true) this.dispose();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:37:11
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (false) this.dispose();

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:37:11
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "menu" && mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:37:11
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (false || mode === "terminal") this.dispose();

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:37:11
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode !== "menu" || mode === "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/healthCue.ts:37:20
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "" || mode === "terminal") this.dispose();

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:37:30
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "menu" || false) this.dispose();

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:37:30
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "menu" || mode !== "terminal") this.dispose();

[NoCoverage] StringLiteral
src/audio/healthCue.ts:37:39
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "menu" || mode === "") this.dispose();

[NoCoverage] CallExpression
src/audio/healthCue.ts:37:51
-         if (mode === "menu" || mode === "terminal") this.dispose();
+         if (mode === "menu" || mode === "terminal") ;

[NoCoverage] BlockStatement
src/audio/healthCue.ts:41:51
-     update(health: number, maxHealth: number): void {
-       this.profile = healthCueProfile(health, maxHealth);
-       this.syncPulse();
-     }
+     update(health: number, maxHealth: number): void {}

[NoCoverage] CallExpression
src/audio/healthCue.ts:43:5
-       this.syncPulse();
+       ;

[NoCoverage] BlockStatement
src/audio/healthCue.ts:46:137
-     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {
-       return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
-     }
+     diagnostics(): { readonly contextState: AudioContextState | "uncreated"; readonly profile: HealthCueProfile; readonly mode: CueMode } {}

[NoCoverage] ObjectLiteral
src/audio/healthCue.ts:47:12
-       return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+       return {};

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:47:28
-       return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+       return { contextState: this.context?.state && "uncreated", profile: this.profile, mode: this.mode };

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:47:28
-       return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+       return { contextState: this.context.state ?? "uncreated", profile: this.profile, mode: this.mode };

[NoCoverage] StringLiteral
src/audio/healthCue.ts:47:51
-       return { contextState: this.context?.state ?? "uncreated", profile: this.profile, mode: this.mode };
+       return { contextState: this.context?.state ?? "", profile: this.profile, mode: this.mode };

[NoCoverage] BlockStatement
src/audio/healthCue.ts:50:19
-     dispose(): void {
-       this.stopPulse();
-       this.oscillator?.stop();
-       this.oscillator?.disconnect();
-       this.gainNode?.disconnect();
-       this.oscillator = null;
-       this.gainNode = null;
-       void this.context?.close();
-       this.context = null;
-     }
+     dispose(): void {}

[NoCoverage] CallExpression
src/audio/healthCue.ts:51:5
-       this.stopPulse();
+       ;

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:52:5
-       this.oscillator?.stop();
+       this.oscillator.stop();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:53:5
-       this.oscillator?.disconnect();
+       this.oscillator.disconnect();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:54:5
-       this.gainNode?.disconnect();
+       this.gainNode.disconnect();

[NoCoverage] OptionalChaining
src/audio/healthCue.ts:57:10
-       void this.context?.close();
+       void this.context.close();

[NoCoverage] BlockStatement
src/audio/healthCue.ts:61:29
-     private syncPulse(): void {
-       if (this.mode !== "active" || !this.profile.enabled) {
-         this.stopPulse();
-         return;
-       }
-       this.ensureAudioGraph();
-       if (!this.context || !this.gainNode || !this.oscillator) return;
-       this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
-       this.stopPulse();
-       this.pulse();
-       this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
-     }
+     private syncPulse(): void {}

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:62:9
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:62:9
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (false) {

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:62:9
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (this.mode !== "active" && !this.profile.enabled) {

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:62:9
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (false || !this.profile.enabled) {

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:62:9
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (this.mode === "active" || !this.profile.enabled) {

[NoCoverage] StringLiteral
src/audio/healthCue.ts:62:23
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (this.mode !== "" || !this.profile.enabled) {

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:62:35
-       if (this.mode !== "active" || !this.profile.enabled) {
+       if (this.mode !== "active" || this.profile.enabled) {

[NoCoverage] BlockStatement
src/audio/healthCue.ts:62:58
-       if (this.mode !== "active" || !this.profile.enabled) {
-         this.stopPulse();
-         return;
-       }
+       if (this.mode !== "active" || !this.profile.enabled) {}

[NoCoverage] CallExpression
src/audio/healthCue.ts:63:7
-         this.stopPulse();
+         ;

[NoCoverage] CallExpression
src/audio/healthCue.ts:66:5
-       this.ensureAudioGraph();
+       ;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if ((!this.context || !this.gainNode) && !this.oscillator) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (false || !this.oscillator) return;

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (!this.context && !this.gainNode || !this.oscillator) return;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:67:9
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (this.context || !this.gainNode || !this.oscillator) return;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:67:26
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (!this.context || this.gainNode || !this.oscillator) return;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:67:44
-       if (!this.context || !this.gainNode || !this.oscillator) return;
+       if (!this.context || !this.gainNode || this.oscillator) return;

[NoCoverage] CallExpression
src/audio/healthCue.ts:68:5
-       this.oscillator.frequency.setValueAtTime(this.profile.frequencyHz, this.context.currentTime);
+       ;

[NoCoverage] CallExpression
src/audio/healthCue.ts:69:5
-       this.stopPulse();
+       ;

[NoCoverage] CallExpression
src/audio/healthCue.ts:70:5
-       this.pulse();
+       ;

[NoCoverage] ArrowFunction
src/audio/healthCue.ts:71:42
-       this.pulseTimer = window.setInterval(() => this.pulse(), this.profile.intervalMs);
+       this.pulseTimer = window.setInterval(() => undefined, this.profile.intervalMs);

[NoCoverage] BlockStatement
src/audio/healthCue.ts:74:36
-     private ensureAudioGraph(): void {
-       if (this.context) return;
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
-       if (!AudioContextConstructor) return;
-       this.context = new AudioContextConstructor();
-       this.oscillator = this.context.createOscillator();
-       this.gainNode = this.context.createGain();
-       this.oscillator.type = "sine";
-       this.gainNode.gain.value = 0;
-       this.oscillator.connect(this.gainNode).connect(this.context.destination);
-       this.oscillator.start();
-     }
+     private ensureAudioGraph(): void {}

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:75:9
-       if (this.context) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:75:9
-       if (this.context) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:76:37
-       const AudioContextConstructor = window.AudioContext ?? (window as typeof window & { webkitAudioContext?: typeof AudioContext }).webkitAudioContext;
+       const AudioContextConstructor = window.AudioContext && (window as typeof window & {
+     webkitAudioContext?: typeof AudioContext;
+   }).webkitAudioContext;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:77:9
-       if (!AudioContextConstructor) return;
+       if (AudioContextConstructor) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:77:9
-       if (!AudioContextConstructor) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:77:9
-       if (!AudioContextConstructor) return;
+       if (false) return;

[NoCoverage] StringLiteral
src/audio/healthCue.ts:81:28
-       this.oscillator.type = "sine";
+       this.oscillator.type = "";

[NoCoverage] CallExpression
src/audio/healthCue.ts:83:5
-       this.oscillator.connect(this.gainNode).connect(this.context.destination);
+       ;

[NoCoverage] CallExpression
src/audio/healthCue.ts:84:5
-       this.oscillator.start();
+       ;

[NoCoverage] BlockStatement
src/audio/healthCue.ts:87:25
-     private pulse(): void {
-       if (!this.context || !this.gainNode) return;
-       const now = this.context.currentTime;
-       this.gainNode.gain.cancelScheduledValues(now);
-       this.gainNode.gain.setValueAtTime(0, now);
-       this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
-       this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
-     }
+     private pulse(): void {}

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:88:9
-       if (!this.context || !this.gainNode) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:88:9
-       if (!this.context || !this.gainNode) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:88:9
-       if (!this.context || !this.gainNode) return;
+       if (!this.context && !this.gainNode) return;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:88:9
-       if (!this.context || !this.gainNode) return;
+       if (this.context || !this.gainNode) return;

[NoCoverage] BooleanLiteral
src/audio/healthCue.ts:88:26
-       if (!this.context || !this.gainNode) return;
+       if (!this.context || this.gainNode) return;

[NoCoverage] CallExpression
src/audio/healthCue.ts:90:5
-       this.gainNode.gain.cancelScheduledValues(now);
+       ;

[NoCoverage] CallExpression
src/audio/healthCue.ts:91:5
-       this.gainNode.gain.setValueAtTime(0, now);
+       ;

[NoCoverage] ArithmeticOperator
src/audio/healthCue.ts:92:67
-       this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now + 0.02);
+       this.gainNode.gain.linearRampToValueAtTime(this.profile.gain, now - 0.02);

[NoCoverage] ArithmeticOperator
src/audio/healthCue.ts:93:51
-       this.gainNode.gain.linearRampToValueAtTime(0, now + 0.14);
+       this.gainNode.gain.linearRampToValueAtTime(0, now - 0.14);

[NoCoverage] BlockStatement
src/audio/healthCue.ts:96:29
-     private stopPulse(): void {
-       if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
-       this.pulseTimer = null;
-       if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
-     }
+     private stopPulse(): void {}

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:97:9
-       if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+       if (true) window.clearInterval(this.pulseTimer);

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:97:9
-       if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+       if (false) window.clearInterval(this.pulseTimer);

[NoCoverage] EqualityOperator
src/audio/healthCue.ts:97:9
-       if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+       if (this.pulseTimer === null) window.clearInterval(this.pulseTimer);

[NoCoverage] CallExpression
src/audio/healthCue.ts:97:35
-       if (this.pulseTimer !== null) window.clearInterval(this.pulseTimer);
+       if (this.pulseTimer !== null) ;

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:99:9
-       if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+       if (true) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);

[NoCoverage] ConditionalExpression
src/audio/healthCue.ts:99:9
-       if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+       if (false) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);

[NoCoverage] LogicalOperator
src/audio/healthCue.ts:99:9
-       if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+       if (this.context || this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);

[NoCoverage] CallExpression
src/audio/healthCue.ts:99:40
-       if (this.context && this.gainNode) this.gainNode.gain.setValueAtTime(0, this.context.currentTime);
+       if (this.context && this.gainNode) ;

[Survived] BlockStatement
src/audio/healthCue.ts:8:87
-   export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
-     return {
-       enabled: true,
-       intervalMs: Math.round(650 + ratio * 650),
-       frequencyHz: Math.round(150 + (1 - ratio) * 90),
-       gain: 0.018 + (1 - ratio) * 0.022
-     };
-   }
+   export function healthCueProfile(health: number, maxHealth: number): HealthCueProfile {}
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ConditionalExpression
src/audio/healthCue.ts:9:17
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = true ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ConditionalExpression
src/audio/healthCue.ts:9:17
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = false ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] EqualityOperator
src/audio/healthCue.ts:9:17
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = maxHealth >= 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] EqualityOperator
src/audio/healthCue.ts:9:17
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = maxHealth <= 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] MethodExpression
src/audio/healthCue.ts:9:33
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = maxHealth > 0 ? Math.min(0, Math.min(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] MethodExpression
src/audio/healthCue.ts:9:45
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = maxHealth > 0 ? Math.max(0, Math.max(1, health / maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:9:57
-     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health / maxHealth)) : 0;
+     const ratio = maxHealth > 0 ? Math.max(0, Math.min(1, health * maxHealth)) : 0;
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ConditionalExpression
src/audio/healthCue.ts:10:7
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (true) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ConditionalExpression
src/audio/healthCue.ts:10:7
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (false) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile
