[Survived] EqualityOperator
src/audio/healthCue.ts:10:7
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (ratio > 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] EqualityOperator
src/audio/healthCue.ts:10:7
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (ratio < 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
Tests ran:
    health cue profile is silent at full vitality
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ObjectLiteral
src/audio/healthCue.ts:10:26
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (ratio >= 1) return {};
Tests ran:
    health cue profile is silent at full vitality

[Survived] BooleanLiteral
src/audio/healthCue.ts:10:37
-     if (ratio >= 1) return { enabled: false, intervalMs: 0, frequencyHz: 0, gain: 0 };
+     if (ratio >= 1) return { enabled: true, intervalMs: 0, frequencyHz: 0, gain: 0 };
Tests ran:
    health cue profile is silent at full vitality

[Survived] ObjectLiteral
src/audio/healthCue.ts:11:10
-     return {
-       enabled: true,
-       intervalMs: Math.round(650 + ratio * 650),
-       frequencyHz: Math.round(150 + (1 - ratio) * 90),
-       gain: 0.018 + (1 - ratio) * 0.022
-     };
+     return {};
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] BooleanLiteral
src/audio/healthCue.ts:12:14
-       enabled: true,
+       enabled: false,
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:13:28
-       intervalMs: Math.round(650 + ratio * 650),
+       intervalMs: Math.round(650 - ratio * 650),
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:13:34
-       intervalMs: Math.round(650 + ratio * 650),
+       intervalMs: Math.round(650 + ratio / 650),
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:14:29
-       frequencyHz: Math.round(150 + (1 - ratio) * 90),
+       frequencyHz: Math.round(150 - (1 - ratio) * 90),
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:14:35
-       frequencyHz: Math.round(150 + (1 - ratio) * 90),
+       frequencyHz: Math.round(150 + (1 - ratio) / 90),
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:14:36
-       frequencyHz: Math.round(150 + (1 - ratio) * 90),
+       frequencyHz: Math.round(150 + (1 + ratio) * 90),
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:15:19
-       gain: 0.018 + (1 - ratio) * 0.022
+       gain: 0.018 + (1 - ratio) / 0.022
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:15:11
-       gain: 0.018 + (1 - ratio) * 0.022
+       gain: 0.018 - (1 - ratio) * 0.022
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArithmeticOperator
src/audio/healthCue.ts:15:20
-       gain: 0.018 + (1 - ratio) * 0.022
+       gain: 0.018 + (1 + ratio) * 0.022
Tests ran:
    health cue profile escalates as vitality falls
    health cue profile clamps malformed vitality inputs to a usable profile

[Survived] ArrowFunction
src/content/items.ts:13:91
-   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find(() => undefined);
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 45 more tests!

[Survived] ConditionalExpression
src/content/items.ts:13:101
-   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => true);
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 45 more tests!

[Survived] ConditionalExpression
src/content/items.ts:13:101
-   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => false);
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 45 more tests!

[Survived] EqualityOperator
src/content/items.ts:13:101
-   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id !== id);
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 45 more tests!

[Survived] ArrayDeclaration
src/content/items.ts:5:60
-   export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
-   ];
+   export const ITEM_DEFINITIONS: readonly ItemDefinition[] = [];
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:6:3
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:6:9
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     { id: "", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:6:53
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     { id: "ember-pike", name: "Ember Pike", category: "", handUsage: "either", attack: 2, presentationId: "pike" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:6:29
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     { id: "ember-pike", name: "", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:6:74
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "", attack: 2, presentationId: "pike" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:6:111
-     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "pike" },
+     { id: "ember-pike", name: "Ember Pike", category: "weapon", handUsage: "either", attack: 2, presentationId: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:7:3
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:7:34
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     { id: "rimeglass-knife", name: "", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:7:63
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "", handUsage: "either", attack: 1, presentationId: "knife" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:7:9
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     { id: "", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:7:84
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "", attack: 1, presentationId: "knife" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:7:121
-     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "knife" },
+     { id: "rimeglass-knife", name: "Rimeglass Knife", category: "weapon", handUsage: "either", attack: 1, presentationId: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:8:3
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:8:9
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     { id: "", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:8:35
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     { id: "moonward-buckler", name: "", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:8:65
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     { id: "moonward-buckler", name: "Moonward Buckler", category: "", handUsage: "either", defense: 1, presentationId: "buckler" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:8:87
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "", defense: 1, presentationId: "buckler" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:8:125
-     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "buckler" },
+     { id: "moonward-buckler", name: "Moonward Buckler", category: "defense", handUsage: "either", defense: 1, presentationId: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:9:3
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:9:9
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     { id: "", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:9:29
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     { id: "ashen-mail", name: "", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:9:53
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     { id: "ashen-mail", name: "Ashen Mail", category: "", handUsage: "either", defense: 2, presentationId: "mail" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:9:75
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "", defense: 2, presentationId: "mail" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:9:113
-     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "mail" },
+     { id: "ashen-mail", name: "Ashen Mail", category: "defense", handUsage: "either", defense: 2, presentationId: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:10:3
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:10:9
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+     { id: "", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:10:29
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+     { id: "moss-tonic", name: "", category: "consumable", healing: 3, presentationId: "tonic" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:10:95
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:10:53
-     { id: "moss-tonic", name: "Moss Tonic", category: "consumable", healing: 3, presentationId: "tonic" },
+     { id: "moss-tonic", name: "Moss Tonic", category: "", healing: 3, presentationId: "tonic" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/items.ts:11:3
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
+     {}
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:11:35
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
+     { id: "star-forged-seal", name: "", category: "treasure", presentationId: "seal" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:11:9
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
+     { id: "", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:11:65
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
+     { id: "star-forged-seal", name: "Star-Forged Seal", category: "", presentationId: "seal" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/items.ts:11:93
-     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "seal" }
+     { id: "star-forged-seal", name: "Star-Forged Seal", category: "treasure", presentationId: "" }
Ran all tests for this mutant.

[Survived] ArrowFunction
src/content/items.ts:13:25
-   export const itemById = (id: string): ItemDefinition | undefined => ITEM_DEFINITIONS.find((item) => item.id === id);
+   export const itemById = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/content/monsters.ts:7:100
-   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find(() => undefined);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ConditionalExpression
src/content/monsters.ts:7:113
-   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => true);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ConditionalExpression
src/content/monsters.ts:7:113
-   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => false);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] EqualityOperator
src/content/monsters.ts:7:113
-   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id !== id);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ArrayDeclaration
src/content/monsters.ts:2:66
-   export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
-   ];
+   export const MONSTER_DEFINITIONS: readonly MonsterDefinition[] = [];
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/monsters.ts:3:3
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:3:34
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+     { id: "ashbound-warden", name: "", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:3:9
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+     { id: "", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:3:102
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "", presentationId: "warden" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:3:134
-     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "warden" },
+     { id: "ashbound-warden", name: "Ashbound Warden", vitality: 5, attack: 1, defense: 0, lootTableId: "warden-cache", presentationId: "" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:4:9
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+     { id: "", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/monsters.ts:4:3
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+     {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:4:33
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+     { id: "glass-mireling", name: "", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:4:100
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "", presentationId: "mireling" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:4:134
-     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "mireling" },
+     { id: "glass-mireling", name: "Glass Mireling", vitality: 4, attack: 2, defense: 0, lootTableId: "mireling-cache", presentationId: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/monsters.ts:5:3
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+     {}
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:5:9
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+     { id: "", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:5:34
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+     { id: "gloam-scavenger", name: "", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:5:137
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/monsters.ts:5:102
-     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "scavenger-cache", presentationId: "scavenger" }
+     { id: "gloam-scavenger", name: "Gloam Scavenger", vitality: 3, attack: 1, defense: 0, lootTableId: "", presentationId: "scavenger" }
Ran all tests for this mutant.

[Survived] ArrowFunction
src/content/monsters.ts:7:28
-   export const monsterById = (id: string): MonsterDefinition | undefined => MONSTER_DEFINITIONS.find((monster) => monster.id === id);
+   export const monsterById = () => undefined;
Ran all tests for this mutant.

[NoCoverage] StringLiteral
src/content/registry.ts:13:196
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(``); }

[NoCoverage] StringLiteral
src/content/registry.ts:19:170
-   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("")); }

[Survived] StringLiteral
src/content/registry.ts:13:78
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(``); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    content registry detects duplicate IDs, missing references, ranges, and malformed loot

[Survived] ArrayDeclaration
src/content/registry.ts:12:28
-     const errors: string[] = []; const itemIds = new Set<string>();
+     const errors: string[] = ["Stryker was here"]; const itemIds = new Set<string>();
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!
