[Survived] BlockStatement
src/content/registry.ts:11:89
-   export function validateContent(registry: ContentRegistry = CONTENT): readonly string[] {
-     const errors: string[] = []; const itemIds = new Set<string>();
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
-     const monsterIds = new Set<string>();
-     return errors;
-   }
+   export function validateContent(registry: ContentRegistry = CONTENT): readonly string[] {}
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] BlockStatement
src/content/registry.ts:13:38
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) {}
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:44
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (true) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] CallExpression
src/content/registry.ts:13:112
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); ; if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:44
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (false) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:138
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (true) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:138
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (false) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] LogicalOperator
src/content/registry.ts:13:138
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined || item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] EqualityOperator
src/content/registry.ts:13:138
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack === undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:138
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (true && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:13:167
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && true) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] EqualityOperator
src/content/registry.ts:13:167
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack <= 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] EqualityOperator
src/content/registry.ts:13:167
-     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack < 0) errors.push(`invalid item attack: ${item.id}`); }
+     for (const item of registry.items) { if (itemIds.has(item.id)) errors.push(`duplicate item id: ${item.id}`); itemIds.add(item.id); if (item.attack !== undefined && item.attack >= 0) errors.push(`invalid item attack: ${item.id}`); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 46 more tests!

[Survived] BlockStatement
src/content/registry.ts:19:79
-   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+   export function assertValidContent(registry: ContentRegistry = CONTENT): void {}
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:19:127
-   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (true) throw new Error(errors.join("; ")); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ConditionalExpression
src/content/registry.ts:19:127
-   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (errors.length) throw new Error(errors.join("; ")); }
+   export function assertValidContent(registry: ContentRegistry = CONTENT): void { const errors = validateContent(registry); if (false) throw new Error(errors.join("; ")); }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/content/registry.ts:4:76
-   export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {
-     "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
-   };
+   export const LOOT_TABLES: Readonly<Record<string, readonly LootEntry[]>> = {};
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/content/registry.ts:5:19
-     "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
+     "warden-cache": [],
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:5:20
-     "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
+     "warden-cache": [{}],
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:5:30
-     "warden-cache": [{ itemId: "star-forged-seal", weight: 1 }],
+     "warden-cache": [{ itemId: "", weight: 1 }],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/content/registry.ts:6:21
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+     "mireling-cache": [],
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:6:22
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+     "mireling-cache": [{}, { itemId: "rimeglass-knife", weight: 1 }],
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:6:32
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+     "mireling-cache": [{ itemId: "", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:6:69
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "", weight: 1 }],
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:6:59
-     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }],
+     "mireling-cache": [{ itemId: "moss-tonic", weight: 2 }, {}],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/content/registry.ts:7:22
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": []
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:7:23
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{}, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:7:33
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{ itemId: "", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:7:60
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, {}, { itemId: "rimeglass-knife", weight: 1 }]
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:7:70
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:7:97
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, {}]
Ran all tests for this mutant.

[Survived] StringLiteral
src/content/registry.ts:7:107
-     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "rimeglass-knife", weight: 1 }]
+     "scavenger-cache": [{ itemId: "ashen-mail", weight: 1 }, { itemId: "moss-tonic", weight: 2 }, { itemId: "", weight: 1 }]
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/content/registry.ts:10:41
-   export const CONTENT: ContentRegistry = { items: ITEM_DEFINITIONS, monsters: MONSTER_DEFINITIONS, lootTables: LOOT_TABLES };
+   export const CONTENT: ContentRegistry = {};
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/game/MainScene.ts:17:127
-   function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {
-     const pixels = frameToPixels(frame, viewport.width, viewport.height);
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
-   }
+   function screenFrame(frame: PortalFrame, viewport: { left: number; top: number; width: number; height: number }): PortalFrame {}

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:19:10
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+     return {};

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:18
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+     return { left: pixels.left - viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:54
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+     return { left: pixels.left + viewport.left, right: pixels.right - viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:89
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top - viewport.top, bottom: pixels.bottom + viewport.top };

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:19:124
-     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom + viewport.top };
+     return { left: pixels.left + viewport.left, right: pixels.right + viewport.left, top: pixels.top + viewport.top, bottom: pixels.bottom - viewport.top };

[NoCoverage] BlockStatement
src/game/MainScene.ts:22:118
-   function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {
-     return { left: 72, top: 72, width: width - 144, height: height - 212 };
-   }
+   function portalViewport(width: number, height: number): { left: number; top: number; width: number; height: number } {}

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:23:10
-     return { left: 72, top: 72, width: width - 144, height: height - 212 };
+     return {};

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:23:38
-     return { left: 72, top: 72, width: width - 144, height: height - 212 };
+     return { left: 72, top: 72, width: width + 144, height: height - 212 };

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:23:59
-     return { left: 72, top: 72, width: width - 144, height: height - 212 };
+     return { left: 72, top: 72, width: width - 144, height: height + 212 };

[NoCoverage] LogicalOperator
src/game/MainScene.ts:27:112
-     private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() ?? createInitialState();
+     private state: GameState = renderFixtureFromLocation() ? createRenderFixture(renderFixtureFromLocation()!) : loadCheckpoint() && createInitialState();

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:28:39
-     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+     private readonly perspectiveDebug = true;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:28:39
-     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+     private readonly perspectiveDebug = false;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:28:39
-     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") !== "1";

[NoCoverage] StringLiteral
src/game/MainScene.ts:28:87
-     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("") === "1";

[NoCoverage] StringLiteral
src/game/MainScene.ts:28:111
-     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "1";
+     private readonly perspectiveDebug = new URLSearchParams(window.location.search).get("perspectiveDebug") === "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:29:29
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = true ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:29:29
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = false ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] LogicalOperator
src/game/MainScene.ts:29:29
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" && this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:29:29
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = false || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:29:29
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus !== "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] StringLiteral
src/game/MainScene.ts:29:54
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:29:68
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" || false ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:29:68
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus !== "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] StringLiteral
src/game/MainScene.ts:29:93
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";

[NoCoverage] StringLiteral
src/game/MainScene.ts:29:161
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "" : "menu";

[NoCoverage] StringLiteral
src/game/MainScene.ts:29:172
-     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "menu";
+     private mode: InputMode = this.state.runStatus === "defeated" || this.state.runStatus === "victorious" ? this.state.runStatus : renderFixtureFromLocation() ? "active" : "";

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:30:27
-     private reducedMotion = false;
+     private reducedMotion = true;

[NoCoverage] StringLiteral
src/game/MainScene.ts:31:22
-     private feedback = "A corridor waits beyond the torchlight.";
+     private feedback = "";

[NoCoverage] StringLiteral
src/game/MainScene.ts:37:25
-     constructor() { super("main"); }
+     constructor() { super(""); }

[NoCoverage] BlockStatement
src/game/MainScene.ts:39:19
-     preload(): void {
-       this.load.image("dungeon-surfaces", DUNGEON_SURFACE_ATLAS.source);
-       this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
-       this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
-       this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
-       this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
-       this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
-       this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
-       this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
-     }
+     preload(): void {}

[NoCoverage] StringLiteral
src/game/MainScene.ts:40:21
-       this.load.image("dungeon-surfaces", DUNGEON_SURFACE_ATLAS.source);
+       this.load.image("", DUNGEON_SURFACE_ATLAS.source);

[NoCoverage] StringLiteral
src/game/MainScene.ts:41:21
-       this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
+       this.load.image("", "/assets/dungeon/archway-stone.png");

[NoCoverage] StringLiteral
src/game/MainScene.ts:41:38
-       this.load.image("archway-stone", "/assets/dungeon/archway-stone.png");
+       this.load.image("archway-stone", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:42:21
-       this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
+       this.load.image("", "/assets/dungeon/torch-sconce.png");
