[NoCoverage] StringLiteral
src/game/MainScene.ts:42:37
-       this.load.image("torch-sconce", "/assets/dungeon/torch-sconce.png");
+       this.load.image("torch-sconce", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:43:21
-       this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
+       this.load.image("", "/assets/dungeon/torch-flame.png");

[NoCoverage] StringLiteral
src/game/MainScene.ts:43:36
-       this.load.image("torch-flame", "/assets/dungeon/torch-flame.png");
+       this.load.image("torch-flame", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:44:21
-       this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
+       this.load.image("", "/assets/first-person/fp-hands-empty.png");

[NoCoverage] StringLiteral
src/game/MainScene.ts:44:39
-       this.load.image("fp-hands-empty", "/assets/first-person/fp-hands-empty.png");
+       this.load.image("fp-hands-empty", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:45:21
-       this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
+       this.load.image("", "/assets/entities/ashbound-warden.svg");

[NoCoverage] StringLiteral
src/game/MainScene.ts:45:40
-       this.load.image("ashbound-warden", "/assets/entities/ashbound-warden.svg");
+       this.load.image("ashbound-warden", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:46:21
-       this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
+       this.load.image("", "/assets/entities/glass-mireling.svg");

[NoCoverage] StringLiteral
src/game/MainScene.ts:46:39
-       this.load.image("glass-mireling", "/assets/entities/glass-mireling.svg");
+       this.load.image("glass-mireling", "");

[NoCoverage] StringLiteral
src/game/MainScene.ts:47:21
-       this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
+       this.load.image("", "/assets/entities/gloam-scavenger.svg");

[NoCoverage] StringLiteral
src/game/MainScene.ts:47:40
-       this.load.image("gloam-scavenger", "/assets/entities/gloam-scavenger.svg");
+       this.load.image("gloam-scavenger", "");

[NoCoverage] BlockStatement
src/game/MainScene.ts:50:30
-     update(time: number): void {
-       this.presentationTimeMs = time;
-       const entityFrame = this.reducedMotion ? 0 : billboardFrameAt(time);
-       const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
-       this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
-       this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
-     }
+     update(time: number): void {}

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:53:49
-       const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
+       const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) * 4;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:53:60
-       const flameFrame = this.reducedMotion ? 0 : Math.floor(time / 180) % 4;
+       const flameFrame = this.reducedMotion ? 0 : Math.floor(time * 180) % 4;

[NoCoverage] ArrowFunction
src/game/MainScene.ts:54:32
-       this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
+       this.entitySprites.forEach(() => undefined);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:54:59
-       this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame * 32, 0, 32, 48));
+       this.entitySprites.forEach((sprite) => sprite.setCrop(entityFrame / 32, 0, 32, 48));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:55:31
-       this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
+       this.flameSprites.forEach(() => undefined);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:55:58
-       this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame * 32, 0, 32, 48));
+       this.flameSprites.forEach((sprite) => sprite.setCrop(flameFrame / 32, 0, 32, 48));

[NoCoverage] BlockStatement
src/game/MainScene.ts:58:18
-     create(): void {
-       this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
-       this.configureAtmosphere();
-       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
-       this.inputController.attach();
-       window.addEventListener("tarmin-start", this.onStart);
-       window.addEventListener("tarmin-continue", this.onContinue);
-       window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
-       window.addEventListener("tarmin-motion", this.onMotion);
-       this.publishMode();
-       this.renderState();
-       this.publishCheckpointAvailability();
-     }
+     create(): void {}

[NoCoverage] CallExpression
src/game/MainScene.ts:59:5
-       this.cameras.main.setBackgroundColor(DUNGEON_PALETTE.backgroundVoid);
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:60:5
-       this.configureAtmosphere();
+       ;

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:61:48
-       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+       this.inputController = new InputController({});

[NoCoverage] ArrowFunction
src/game/MainScene.ts:61:72
-       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+       this.inputController = new InputController({ target: window, emit: () => undefined, getMode: () => this.mode, togglePause: () => this.togglePause() });

[NoCoverage] ArrowFunction
src/game/MainScene.ts:61:118
-       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => undefined, togglePause: () => this.togglePause() });

[NoCoverage] ArrowFunction
src/game/MainScene.ts:61:148
-       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => this.togglePause() });
+       this.inputController = new InputController({ target: window, emit: (command) => this.dispatch(command), getMode: () => this.mode, togglePause: () => undefined });

[NoCoverage] CallExpression
src/game/MainScene.ts:62:5
-       this.inputController.attach();
+       ;

[NoCoverage] StringLiteral
src/game/MainScene.ts:63:29
-       window.addEventListener("tarmin-start", this.onStart);
+       window.addEventListener("", this.onStart);

[NoCoverage] StringLiteral
src/game/MainScene.ts:64:29
-       window.addEventListener("tarmin-continue", this.onContinue);
+       window.addEventListener("", this.onContinue);

[NoCoverage] StringLiteral
src/game/MainScene.ts:65:29
-       window.addEventListener("tarmin-toggle-pause", this.onTogglePause);
+       window.addEventListener("", this.onTogglePause);

[NoCoverage] StringLiteral
src/game/MainScene.ts:66:29
-       window.addEventListener("tarmin-motion", this.onMotion);
+       window.addEventListener("", this.onMotion);

[NoCoverage] CallExpression
src/game/MainScene.ts:67:5
-       this.publishMode();
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:68:5
-       this.renderState();
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:69:5
-       this.publishCheckpointAvailability();
+       ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:72:54
-     private readonly onStart = (event: Event): void => {
-       const seed = (event as CustomEvent<number>).detail;
-       this.state = restartRun(seed);
-       saveCheckpoint(this.state);
-       this.feedback = `Seed ${seed} · the descent begins.`;
-       this.mode = "active";
-       this.publishMode(); this.renderState();
-     };
+     private readonly onStart = (event: Event): void => {};

[NoCoverage] CallExpression
src/game/MainScene.ts:75:5
-       saveCheckpoint(this.state);
+       ;

[NoCoverage] StringLiteral
src/game/MainScene.ts:76:21
-       this.feedback = `Seed ${seed} · the descent begins.`;
+       this.feedback = ``;

[NoCoverage] StringLiteral
src/game/MainScene.ts:77:17
-       this.mode = "active";
+       this.mode = "";

[NoCoverage] CallExpression
src/game/MainScene.ts:78:5
-       this.publishMode(); this.renderState();
+       ; this.renderState();

[NoCoverage] CallExpression
src/game/MainScene.ts:78:25
-       this.publishMode(); this.renderState();
+       this.publishMode(); ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:80:45
-     private readonly onContinue = (): void => {
-       const checkpoint = loadCheckpoint();
-       if (!checkpoint) return;
-       this.state = checkpoint;
-       this.feedback = "The descent resumes where the torch was left.";
-       this.mode = "active";
-       this.publishMode(); this.renderState();
-     };
+     private readonly onContinue = (): void => {};

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:82:9
-       if (!checkpoint) return;
+       if (checkpoint) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:82:9
-       if (!checkpoint) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:82:9
-       if (!checkpoint) return;
+       if (false) return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:84:21
-       this.feedback = "The descent resumes where the torch was left.";
+       this.feedback = "";

[NoCoverage] StringLiteral
src/game/MainScene.ts:85:17
-       this.mode = "active";
+       this.mode = "";

[NoCoverage] CallExpression
src/game/MainScene.ts:86:5
-       this.publishMode(); this.renderState();
+       ; this.renderState();

[NoCoverage] CallExpression
src/game/MainScene.ts:86:25
-       this.publishMode(); this.renderState();
+       this.publishMode(); ;

[NoCoverage] ArrowFunction
src/game/MainScene.ts:88:36
-     private readonly onTogglePause = (): void => this.togglePause();
+     private readonly onTogglePause = () => undefined;

[NoCoverage] BlockStatement
src/game/MainScene.ts:89:55
-     private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
+     private readonly onMotion = (event: Event): void => {};

[NoCoverage] CallExpression
src/game/MainScene.ts:89:118
-     private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; this.renderState(); };
+     private readonly onMotion = (event: Event): void => { this.reducedMotion = (event as CustomEvent<boolean>).detail; ; };

[NoCoverage] BlockStatement
src/game/MainScene.ts:91:31
-     private togglePause(): void {
-       if (this.mode === "active") this.mode = "paused";
-       else if (this.mode === "paused") this.mode = "active";
-       else return;
-       this.publishMode(); this.renderState();
-     }
+     private togglePause(): void {}

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:92:9
-       if (this.mode === "active") this.mode = "paused";
+       if (true) this.mode = "paused";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:92:9
-       if (this.mode === "active") this.mode = "paused";
+       if (false) this.mode = "paused";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:92:9
-       if (this.mode === "active") this.mode = "paused";
+       if (this.mode !== "active") this.mode = "paused";

[NoCoverage] StringLiteral
src/game/MainScene.ts:92:23
-       if (this.mode === "active") this.mode = "paused";
+       if (this.mode === "") this.mode = "paused";

[NoCoverage] StringLiteral
src/game/MainScene.ts:92:45
-       if (this.mode === "active") this.mode = "paused";
+       if (this.mode === "active") this.mode = "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:93:14
-       else if (this.mode === "paused") this.mode = "active";
+       else if (true) this.mode = "active";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:93:14
-       else if (this.mode === "paused") this.mode = "active";
+       else if (false) this.mode = "active";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:93:14
-       else if (this.mode === "paused") this.mode = "active";
+       else if (this.mode !== "paused") this.mode = "active";

[NoCoverage] StringLiteral
src/game/MainScene.ts:93:28
-       else if (this.mode === "paused") this.mode = "active";
+       else if (this.mode === "") this.mode = "active";

[NoCoverage] StringLiteral
src/game/MainScene.ts:93:50
-       else if (this.mode === "paused") this.mode = "active";
+       else if (this.mode === "paused") this.mode = "";

[NoCoverage] CallExpression
src/game/MainScene.ts:95:5
-       this.publishMode(); this.renderState();
+       ; this.renderState();

[NoCoverage] CallExpression
src/game/MainScene.ts:95:25
-       this.publishMode(); this.renderState();
+       this.publishMode(); ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:98:44
-     private dispatch(command: Command): void {
-       if (this.mode !== "active") return;
-       const result = executeCommand(this.state, command);
-       this.state = result.state;
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
-       else clearCheckpoint();
-       this.feedback = this.feedbackFor(result.events);
-       window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
-       if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
-       this.renderState();
-       this.publishMode();
-       this.publishCheckpointAvailability();
-       if (this.mode !== "active") return;
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
-       this.mode = "transitioning"; this.publishMode();
-       const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
-       const duration = this.reducedMotion ? 1 : PERSPECTIVE_TRANSITION_MS;
-       const finishTransition = (): void => {
-         if (this.mode !== "transitioning") return;
-         veil.destroy(); this.mode = "active"; this.publishMode();
-       };
-       this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
-       window.setTimeout(finishTransition, duration + 40);
-     }
+

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:99:9
-       if (this.mode !== "active") return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:99:9
-       if (this.mode !== "active") return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:99:9
-       if (this.mode !== "active") return;
+       if (this.mode === "active") return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:99:23
-       if (this.mode !== "active") return;
+       if (this.mode !== "") return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:102:9
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+       if (true) saveCheckpoint(this.state);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:102:9
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+       if (false) saveCheckpoint(this.state);

[NoCoverage] EqualityOperator
src/game/MainScene.ts:102:9
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+       if (this.state.runStatus !== "playing") saveCheckpoint(this.state);

[NoCoverage] StringLiteral
src/game/MainScene.ts:102:34
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+       if (this.state.runStatus === "") saveCheckpoint(this.state);

[NoCoverage] CallExpression
src/game/MainScene.ts:102:45
-       if (this.state.runStatus === "playing") saveCheckpoint(this.state);
+       if (this.state.runStatus === "playing") ;

[NoCoverage] CallExpression
src/game/MainScene.ts:103:10
-       else clearCheckpoint();
+       else ;

[NoCoverage] StringLiteral
src/game/MainScene.ts:105:42
-       window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
+       window.dispatchEvent(new CustomEvent("", { detail: result.events }));

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:105:59
-       window.dispatchEvent(new CustomEvent("tarmin-events", { detail: result.events }));
+       window.dispatchEvent(new CustomEvent("tarmin-events", {}));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:106:9
-       if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+       if (true) this.mode = this.state.runStatus;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:106:9
-       if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+       if (false) this.mode = this.state.runStatus;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:106:9
-       if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+       if (this.state.runStatus === "playing") this.mode = this.state.runStatus;

[NoCoverage] StringLiteral
src/game/MainScene.ts:106:34
-       if (this.state.runStatus !== "playing") this.mode = this.state.runStatus;
+       if (this.state.runStatus !== "") this.mode = this.state.runStatus;

[NoCoverage] CallExpression
src/game/MainScene.ts:107:5
-       this.renderState();
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:108:5
-       this.publishMode();
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:109:5
-       this.publishCheckpointAvailability();
+       ;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:110:9
-       if (this.mode !== "active") return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:110:9
-       if (this.mode !== "active") return;
+       if (false) return;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:110:9
-       if (this.mode !== "active") return;
+       if (this.mode === "active") return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:110:23
-       if (this.mode !== "active") return;
+       if (this.mode !== "") return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:111:9
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:111:9
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (false) return;

[NoCoverage] LogicalOperator
src/game/MainScene.ts:111:9
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.startsWith("move") || !command.startsWith("turn")) return;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:111:9
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (command.startsWith("move") && !command.startsWith("turn")) return;

[NoCoverage] MethodExpression
src/game/MainScene.ts:111:10
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.endsWith("move") && !command.startsWith("turn")) return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:111:29
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.startsWith("") && !command.startsWith("turn")) return;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:111:40
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.startsWith("move") && command.startsWith("turn")) return;

[NoCoverage] MethodExpression
src/game/MainScene.ts:111:41
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.startsWith("move") && !command.endsWith("turn")) return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:111:60
-       if (!command.startsWith("move") && !command.startsWith("turn")) return;
+       if (!command.startsWith("move") && !command.startsWith("")) return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:112:17
-       this.mode = "transitioning"; this.publishMode();
+       this.mode = ""; this.publishMode();

[NoCoverage] CallExpression
src/game/MainScene.ts:112:34
-       this.mode = "transitioning"; this.publishMode();
+       this.mode = "transitioning"; ;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:113:37
-       const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
+       const veil = this.add.rectangle(this.scale.width * 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:113:59
-       const veil = this.add.rectangle(this.scale.width / 2, this.scale.height / 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);
+       const veil = this.add.rectangle(this.scale.width / 2, this.scale.height * 2, this.scale.width, this.scale.height, DUNGEON_PALETTE.backgroundVoid, 0.28).setDepth(20);

[NoCoverage] BlockStatement
src/game/MainScene.ts:115:42
-       const finishTransition = (): void => {
-         if (this.mode !== "transitioning") return;
-         veil.destroy(); this.mode = "active"; this.publishMode();
-       };
+       const finishTransition = (): void => {};

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:116:11
-         if (this.mode !== "transitioning") return;
+         if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:116:11
-         if (this.mode !== "transitioning") return;
+         if (false) return;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:116:11
-         if (this.mode !== "transitioning") return;
+         if (this.mode === "transitioning") return;

[NoCoverage] StringLiteral
src/game/MainScene.ts:116:25
-         if (this.mode !== "transitioning") return;
+         if (this.mode !== "") return;

[NoCoverage] CallExpression
src/game/MainScene.ts:117:7
-         veil.destroy(); this.mode = "active"; this.publishMode();
+         ; this.mode = "active"; this.publishMode();

[NoCoverage] StringLiteral
src/game/MainScene.ts:117:35
-         veil.destroy(); this.mode = "active"; this.publishMode();
+         veil.destroy(); this.mode = ""; this.publishMode();

[NoCoverage] CallExpression
src/game/MainScene.ts:117:45
-         veil.destroy(); this.mode = "active"; this.publishMode();
+         veil.destroy(); this.mode = "active"; ;

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:119:21
-       this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
+       this.tweens.add({});

[NoCoverage] StringLiteral
src/game/MainScene.ts:119:64
-       this.tweens.add({ targets: veil, alpha: 0, duration, ease: "Sine.Out", onComplete: finishTransition });
+       this.tweens.add({ targets: veil, alpha: 0, duration, ease: "", onComplete: finishTransition });

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:120:41
-       window.setTimeout(finishTransition, duration + 40);
+       window.setTimeout(finishTransition, duration - 40);

[NoCoverage] LogicalOperator
src/game/MainScene.ts:124:19
-       const event = events.find((candidate) => candidate.type === "runVictorious")
-         ?? events.find((candidate) => candidate.type === "runDefeated")
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+       const event = (events.find(candidate => candidate.type === "runVictorious") ?? events.find(candidate => candidate.type === "runDefeated") ?? events.find(candidate => candidate.type === "playerDefeated")) && events.find(candidate => candidate.type === "exitLocked")

[NoCoverage] LogicalOperator
src/game/MainScene.ts:124:19
-       const event = events.find((candidate) => candidate.type === "runVictorious")
-         ?? events.find((candidate) => candidate.type === "runDefeated")
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+       const event = (events.find(candidate => candidate.type === "runVictorious") ?? events.find(candidate => candidate.type === "runDefeated")) && events.find(candidate => candidate.type === "playerDefeated")

[NoCoverage] LogicalOperator
src/game/MainScene.ts:124:19
-       const event = events.find((candidate) => candidate.type === "runVictorious")
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+       const event = events.find(candidate => candidate.type === "runVictorious") && events.find(candidate => candidate.type === "runDefeated")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:124:31
-       const event = events.find((candidate) => candidate.type === "runVictorious")
+       const event = events.find(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:124:46
-       const event = events.find((candidate) => candidate.type === "runVictorious")
+       const event = events.find((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:124:46
-       const event = events.find((candidate) => candidate.type === "runVictorious")
+       const event = events.find((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:124:46
-       const event = events.find((candidate) => candidate.type === "runVictorious")
+       const event = events.find((candidate) => candidate.type !== "runVictorious")

[NoCoverage] StringLiteral
src/game/MainScene.ts:124:65
-       const event = events.find((candidate) => candidate.type === "runVictorious")
+       const event = events.find((candidate) => candidate.type === "")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:125:22
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+         ?? events.find(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:125:37
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+         ?? events.find((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:125:37
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+         ?? events.find((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:125:37
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+         ?? events.find((candidate) => candidate.type !== "runDefeated")

[NoCoverage] StringLiteral
src/game/MainScene.ts:125:56
-         ?? events.find((candidate) => candidate.type === "runDefeated")
+         ?? events.find((candidate) => candidate.type === "")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:126:22
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+         ?? events.find(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:126:37
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+         ?? events.find((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:126:37
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+         ?? events.find((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:126:37
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+         ?? events.find((candidate) => candidate.type !== "playerDefeated")

[NoCoverage] StringLiteral
src/game/MainScene.ts:126:56
-         ?? events.find((candidate) => candidate.type === "playerDefeated")
+         ?? events.find((candidate) => candidate.type === "")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:127:22
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+         ?? events.find(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:127:37
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+         ?? events.find((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:127:37
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+         ?? events.find((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:127:37
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+         ?? events.find((candidate) => candidate.type !== "exitLocked")

[NoCoverage] StringLiteral
src/game/MainScene.ts:127:56
-         ?? events.find((candidate) => candidate.type === "exitLocked")
+         ?? events.find((candidate) => candidate.type === "")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:11
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (true

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:11
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (false

[NoCoverage] LogicalOperator
src/game/MainScene.ts:128:11
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some(candidate => candidate.type === "monsterDefeated") || events.some(candidate => candidate.type === "itemAcquired")
