[NoCoverage] MethodExpression
src/game/MainScene.ts:128:11
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.every(candidate => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:128:23
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some(() => undefined) && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:38
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => true) && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:38
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => false) && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] EqualityOperator
src/game/MainScene.ts:128:38
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type !== "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] StringLiteral
src/game/MainScene.ts:128:57
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "") && events.some((candidate) => candidate.type === "itemAcquired")

[NoCoverage] MethodExpression
src/game/MainScene.ts:128:79
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.every(candidate => candidate.type === "itemAcquired")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:128:91
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:106
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:128:106
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:128:106
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type !== "itemAcquired")

[NoCoverage] StringLiteral
src/game/MainScene.ts:128:125
-         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "itemAcquired")
+         ?? (events.some((candidate) => candidate.type === "monsterDefeated") && events.some((candidate) => candidate.type === "")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:129:23
-           ? events.find((candidate) => candidate.type === "monsterDefeated")
+           ? events.find(() => undefined)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:129:38
-           ? events.find((candidate) => candidate.type === "monsterDefeated")
+           ? events.find((candidate) => true)

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:129:38
-           ? events.find((candidate) => candidate.type === "monsterDefeated")
+           ? events.find((candidate) => false)

[NoCoverage] EqualityOperator
src/game/MainScene.ts:129:38
-           ? events.find((candidate) => candidate.type === "monsterDefeated")
+           ? events.find((candidate) => candidate.type !== "monsterDefeated")

[NoCoverage] StringLiteral
src/game/MainScene.ts:129:57
-           ? events.find((candidate) => candidate.type === "monsterDefeated")
+           ? events.find((candidate) => candidate.type === "")

[NoCoverage] ArrowFunction
src/game/MainScene.ts:130:23
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find(() => undefined))

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:130:38
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => true))

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:130:38
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => false))

[NoCoverage] LogicalOperator
src/game/MainScene.ts:130:38
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type === "monsterDefeated" && candidate.type === "itemAcquired"))

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:130:38
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => false || candidate.type === "itemAcquired"))

[NoCoverage] EqualityOperator
src/game/MainScene.ts:130:38
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type !== "monsterDefeated" || candidate.type === "itemAcquired"))

[NoCoverage] StringLiteral
src/game/MainScene.ts:130:57
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type === "" || candidate.type === "itemAcquired"))

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:130:78
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type === "monsterDefeated" || false))

[NoCoverage] EqualityOperator
src/game/MainScene.ts:130:78
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type !== "itemAcquired"))

[NoCoverage] StringLiteral
src/game/MainScene.ts:130:97
-           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === "itemAcquired"))
+           : events.find((candidate) => candidate.type === "monsterDefeated" || candidate.type === ""))

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:132:9
-       if (!event) return this.feedback;
+       if (event) return this.feedback;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:132:9
-       if (!event) return this.feedback;
+       if (true) return this.feedback;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:132:9
-       if (!event) return this.feedback;
+       if (false) return this.feedback;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:133:9
-       if (event.type === "movementBlocked") return "The way is sealed.";
+       if (true) return "The way is sealed.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:133:9
-       if (event.type === "movementBlocked") return "The way is sealed.";
+       if (false) return "The way is sealed.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:133:9
-       if (event.type === "movementBlocked") return "The way is sealed.";
+       if (event.type !== "movementBlocked") return "The way is sealed.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:133:24
-       if (event.type === "movementBlocked") return "The way is sealed.";
+       if (event.type === "") return "The way is sealed.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:133:50
-       if (event.type === "movementBlocked") return "The way is sealed.";
+       if (event.type === "movementBlocked") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:134:9
-       if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+       if (true) return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:134:9
-       if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+       if (false) return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:134:9
-       if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+       if (event.type !== "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:134:24
-       if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+       if (event.type === "") return "The exit rejects you. Find the Star-Forged Seal.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:134:45
-       if (event.type === "exitLocked") return "The exit rejects you. Find the Star-Forged Seal.";
+       if (event.type === "exitLocked") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:135:9
-       if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+       if (true) return `${event.name} bars the passage.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:135:9
-       if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+       if (false) return `${event.name} bars the passage.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:135:9
-       if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+       if (event.type !== "encounterStarted") return `${event.name} bars the passage.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:135:24
-       if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+       if (event.type === "") return `${event.name} bars the passage.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:135:51
-       if (event.type === "encounterStarted") return `${event.name} bars the passage.`;
+       if (event.type === "encounterStarted") return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:136:9
-       if (event.type === "hit") return `Hit for ${event.damage}.`;
+       if (true) return `Hit for ${event.damage}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:136:9
-       if (event.type === "hit") return `Hit for ${event.damage}.`;
+       if (false) return `Hit for ${event.damage}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:136:9
-       if (event.type === "hit") return `Hit for ${event.damage}.`;
+       if (event.type !== "hit") return `Hit for ${event.damage}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:136:24
-       if (event.type === "hit") return `Hit for ${event.damage}.`;
+       if (event.type === "") return `Hit for ${event.damage}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:136:38
-       if (event.type === "hit") return `Hit for ${event.damage}.`;
+       if (event.type === "hit") return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:137:9
-       if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+       if (true) return `The monster strikes for ${event.damage}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:137:9
-       if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+       if (false) return `The monster strikes for ${event.damage}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:137:9
-       if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+       if (event.type !== "monsterAttack") return `The monster strikes for ${event.damage}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:137:24
-       if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+       if (event.type === "") return `The monster strikes for ${event.damage}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:137:48
-       if (event.type === "monsterAttack") return `The monster strikes for ${event.damage}.`;
+       if (event.type === "monsterAttack") return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:138:9
-       if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+       if (true) return "The guardian falls. Loot waits nearby.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:138:9
-       if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+       if (false) return "The guardian falls. Loot waits nearby.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:138:9
-       if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+       if (event.type !== "monsterDefeated") return "The guardian falls. Loot waits nearby.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:138:24
-       if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+       if (event.type === "") return "The guardian falls. Loot waits nearby.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:138:50
-       if (event.type === "monsterDefeated") return "The guardian falls. Loot waits nearby.";
+       if (event.type === "monsterDefeated") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:139:9
-       if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+       if (true) return "Your torch gutters. You have fallen.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:139:9
-       if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+       if (false) return "Your torch gutters. You have fallen.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:139:9
-       if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+       if (event.type !== "playerDefeated") return "Your torch gutters. You have fallen.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:139:24
-       if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+       if (event.type === "") return "Your torch gutters. You have fallen.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:139:49
-       if (event.type === "playerDefeated") return "Your torch gutters. You have fallen.";
+       if (event.type === "playerDefeated") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:142:9
-       if (event.type === "itemAcquired") return "A new item joins the ring.";
+       if (true) return "A new item joins the ring.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:142:9
-       if (event.type === "itemAcquired") return "A new item joins the ring.";
+       if (false) return "A new item joins the ring.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:142:9
-       if (event.type === "itemAcquired") return "A new item joins the ring.";
+       if (event.type !== "itemAcquired") return "A new item joins the ring.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:142:24
-       if (event.type === "itemAcquired") return "A new item joins the ring.";
+       if (event.type === "") return "A new item joins the ring.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:142:47
-       if (event.type === "itemAcquired") return "A new item joins the ring.";
+       if (event.type === "itemAcquired") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:143:9
-       if (event.type === "itemUsed") return "The tonic restores your vitality.";
+       if (true) return "The tonic restores your vitality.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:143:9
-       if (event.type === "itemUsed") return "The tonic restores your vitality.";
+       if (false) return "The tonic restores your vitality.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:143:9
-       if (event.type === "itemUsed") return "The tonic restores your vitality.";
+       if (event.type !== "itemUsed") return "The tonic restores your vitality.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:143:24
-       if (event.type === "itemUsed") return "The tonic restores your vitality.";
+       if (event.type === "") return "The tonic restores your vitality.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:143:43
-       if (event.type === "itemUsed") return "The tonic restores your vitality.";
+       if (event.type === "itemUsed") return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:144:9
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (true) return `${event.hand.toUpperCase()} hand equipped.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:144:9
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (false) return `${event.hand.toUpperCase()} hand equipped.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:144:9
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (event.type !== "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:144:24
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (event.type === "") return `${event.hand.toUpperCase()} hand equipped.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:144:51
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (event.type === "equipmentChanged") return ``;

[NoCoverage] MethodExpression
src/game/MainScene.ts:144:54
-       if (event.type === "equipmentChanged") return `${event.hand.toUpperCase()} hand equipped.`;
+       if (event.type === "equipmentChanged") return `${event.hand.toLowerCase()} hand equipped.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:145:9
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (true) return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:145:9
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (false) return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:145:9
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (event.type !== "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:145:24
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (event.type === "") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:145:74
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (event.type === "inventoryRotated") return event.selectedItemId ? "" : "The ring is empty.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:145:102
-       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "The ring is empty.";
+       if (event.type === "inventoryRotated") return event.selectedItemId ? "Ring selection changed." : "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:146:9
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (true) return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:146:9
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (false) return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:146:9
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type !== "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:146:24
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:146:49
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return true ? "The ring is full." : "Action unavailable.";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:146:49
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return false ? "The ring is full." : "Action unavailable.";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:146:49
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return event.reason !== "inventoryFull" ? "The ring is full." : "Action unavailable.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:146:66
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return event.reason === "" ? "The ring is full." : "Action unavailable.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:146:84
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "" : "Action unavailable.";

[NoCoverage] StringLiteral
src/game/MainScene.ts:146:106
-       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "Action unavailable.";
+       if (event.type === "commandIgnored") return event.reason === "inventoryFull" ? "The ring is full." : "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:147:9
-       if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+       if (true) return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:147:9
-       if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+       if (false) return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:147:9
-       if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+       if (event.type !== "moved") return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:147:24
-       if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+       if (event.type === "") return `Moved to ${event.position.x},${event.position.y}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:147:40
-       if (event.type === "moved") return `Moved to ${event.position.x},${event.position.y}.`;
+       if (event.type === "moved") return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:148:9
-       if (event.type === "turned") return `Facing ${event.facing}.`;
+       if (true) return `Facing ${event.facing}.`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:148:9
-       if (event.type === "turned") return `Facing ${event.facing}.`;
+       if (false) return `Facing ${event.facing}.`;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:148:9
-       if (event.type === "turned") return `Facing ${event.facing}.`;
+       if (event.type !== "turned") return `Facing ${event.facing}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:148:24
-       if (event.type === "turned") return `Facing ${event.facing}.`;
+       if (event.type === "") return `Facing ${event.facing}.`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:148:41
-       if (event.type === "turned") return `Facing ${event.facing}.`;
+       if (event.type === "turned") return ``;

[NoCoverage] StringLiteral
src/game/MainScene.ts:149:12
-       return "Action unavailable.";
+       return "";

[NoCoverage] BlockStatement
src/game/MainScene.ts:152:31
-     private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
+     private publishMode(): void {}

[NoCoverage] StringLiteral
src/game/MainScene.ts:152:70
-     private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
+     private publishMode(): void { window.dispatchEvent(new CustomEvent("", { detail: this.mode })); }

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:152:85
-     private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", { detail: this.mode })); }
+     private publishMode(): void { window.dispatchEvent(new CustomEvent("tarmin-mode", {})); }

[NoCoverage] BlockStatement
src/game/MainScene.ts:154:49
-     private publishCheckpointAvailability(): void {
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
-     }
+     private publishCheckpointAvailability(): void {}

[NoCoverage] StringLiteral
src/game/MainScene.ts:155:42
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+       window.dispatchEvent(new CustomEvent("", { detail: loadCheckpoint() !== null }));

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:155:63
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", {}));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:155:73
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: true }));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:155:73
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: false }));

[NoCoverage] EqualityOperator
src/game/MainScene.ts:155:73
-       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() !== null }));
+       window.dispatchEvent(new CustomEvent("tarmin-checkpoint", { detail: loadCheckpoint() === null }));

[NoCoverage] StringLiteral
src/game/MainScene.ts:158:70
-     private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {
+     private addDebugLabel(label: string, x: number, y: number, color = ""): void {

[NoCoverage] BlockStatement
src/game/MainScene.ts:158:87
-     private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
-     }
+     private addDebugLabel(label: string, x: number, y: number, color = "#f4e7a1"): void {}

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:159:32
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
+       this.add.text(x, y, label, {}).setDepth(10);

[NoCoverage] StringLiteral
src/game/MainScene.ts:159:53
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
+       this.add.text(x, y, label, { color, fontFamily: "", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
