[NoCoverage] StringLiteral
src/game/MainScene.ts:159:76
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
+       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);

[NoCoverage] StringLiteral
src/game/MainScene.ts:159:101
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
+       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "", padding: { x: 3, y: 2 } }).setDepth(10);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:159:121
-       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: { x: 3, y: 2 } }).setDepth(10);
+       this.add.text(x, y, label, { color, fontFamily: "monospace", fontSize: "12px", backgroundColor: "#090b07", padding: {} }).setDepth(10);

[NoCoverage] BlockStatement
src/game/MainScene.ts:162:39
-     private configureAtmosphere(): void {
-       const filters = this.cameras.main.filters?.external;
-       if (!filters) return;
-   
-       const grade = filters.addColorMatrix();
-       grade.colorMatrix.saturate(-0.18);
-       grade.colorMatrix.contrast(0.1, true);
-       filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
-     }
+     private configureAtmosphere(): void {}

[NoCoverage] OptionalChaining
src/game/MainScene.ts:163:21
-       const filters = this.cameras.main.filters?.external;
+       const filters = this.cameras.main.filters.external;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:164:9
-       if (!filters) return;
+       if (filters) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:164:9
-       if (!filters) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:164:9
-       if (!filters) return;
+       if (false) return;

[NoCoverage] UnaryOperator
src/game/MainScene.ts:167:32
-       grade.colorMatrix.saturate(-0.18);
+       grade.colorMatrix.saturate(+0.18);

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:168:37
-       grade.colorMatrix.contrast(0.1, true);
+       grade.colorMatrix.contrast(0.1, false);

[NoCoverage] CallExpression
src/game/MainScene.ts:169:5
-       filters.addVignette(0.5, 0.54, 0.72, 0.3, DUNGEON_PALETTE.backgroundVoid);
+       ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:172:142
-     private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-       const x = viewport.left + viewport.width * 0.5;
-       const y = viewport.top + viewport.height * 0.58;
-       const radius = Math.min(viewport.width, viewport.height) * 0.42;
-       const bands = [
-         { scale: 1, alpha: 0.018 },
-         { scale: 0.78, alpha: 0.024 },
-         { scale: 0.56, alpha: 0.034 },
-         { scale: 0.34, alpha: 0.048 }
-       ];
-       for (const band of bands) {
-         world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
-         world.fillCircle(x, y, radius * band.scale);
-       }
-     }
+     private renderTorchLight(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {}

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:173:15
-       const x = viewport.left + viewport.width * 0.5;
+       const x = viewport.left - viewport.width * 0.5;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:173:31
-       const x = viewport.left + viewport.width * 0.5;
+       const x = viewport.left + viewport.width / 0.5;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:174:15
-       const y = viewport.top + viewport.height * 0.58;
+       const y = viewport.top - viewport.height * 0.58;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:174:30
-       const y = viewport.top + viewport.height * 0.58;
+       const y = viewport.top + viewport.height / 0.58;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:175:20
-       const radius = Math.min(viewport.width, viewport.height) * 0.42;
+       const radius = Math.min(viewport.width, viewport.height) / 0.42;

[NoCoverage] MethodExpression
src/game/MainScene.ts:175:20
-       const radius = Math.min(viewport.width, viewport.height) * 0.42;
+       const radius = Math.max(viewport.width, viewport.height) * 0.42;

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:176:19
-       const bands = [
-         { scale: 1, alpha: 0.018 },
-         { scale: 0.78, alpha: 0.024 },
-         { scale: 0.56, alpha: 0.034 },
-         { scale: 0.34, alpha: 0.048 }
-       ];
+       const bands = [];

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:177:7
-         { scale: 1, alpha: 0.018 },
+         {},

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:178:7
-         { scale: 0.78, alpha: 0.024 },
+         {},

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:179:7
-         { scale: 0.56, alpha: 0.034 },
+         {},

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:180:7
-         { scale: 0.34, alpha: 0.048 }
+         {}

[NoCoverage] BlockStatement
src/game/MainScene.ts:182:31
-       for (const band of bands) {
-         world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
-         world.fillCircle(x, y, radius * band.scale);
-       }
+       for (const band of bands) {}

[NoCoverage] CallExpression
src/game/MainScene.ts:183:7
-         world.fillStyle(DUNGEON_PALETTE.torchLight, band.alpha);
+         ;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:184:30
-         world.fillCircle(x, y, radius * band.scale);
+         world.fillCircle(x, y, radius / band.scale);

[NoCoverage] BlockStatement
src/game/MainScene.ts:188:135
-     private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {
-       const edge = Math.max(18, Math.round(viewport.width * 0.035));
-       world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
-       world.fillRect(viewport.left, viewport.top, viewport.width, edge);
-       world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
-       world.fillRect(viewport.left, viewport.top, edge, viewport.height);
-       world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
-     }
+     private renderFog(world: Phaser.GameObjects.Graphics, viewport: { left: number; top: number; width: number; height: number }): void {}

[NoCoverage] MethodExpression
src/game/MainScene.ts:189:18
-       const edge = Math.max(18, Math.round(viewport.width * 0.035));
+       const edge = Math.min(18, Math.round(viewport.width * 0.035));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:189:42
-       const edge = Math.max(18, Math.round(viewport.width * 0.035));
+       const edge = Math.max(18, Math.round(viewport.width / 0.035));

[NoCoverage] CallExpression
src/game/MainScene.ts:190:5
-       world.fillStyle(DUNGEON_PALETTE.backgroundVoid, 0.28);
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:191:5
-       world.fillRect(viewport.left, viewport.top, viewport.width, edge);
+       ;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:192:35
-       world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
+       world.fillRect(viewport.left, viewport.top + viewport.height + edge, viewport.width, edge);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:192:35
-       world.fillRect(viewport.left, viewport.top + viewport.height - edge, viewport.width, edge);
+       world.fillRect(viewport.left, viewport.top - viewport.height - edge, viewport.width, edge);

[NoCoverage] CallExpression
src/game/MainScene.ts:193:5
-       world.fillRect(viewport.left, viewport.top, edge, viewport.height);
+       ;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:194:20
-       world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
+       world.fillRect(viewport.left + viewport.width + edge, viewport.top, edge, viewport.height);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:194:20
-       world.fillRect(viewport.left + viewport.width - edge, viewport.top, edge, viewport.height);
+       world.fillRect(viewport.left - viewport.width - edge, viewport.top, edge, viewport.height);

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:198:9
-       if (!this.perspectiveDebug) return;
+       if (this.perspectiveDebug) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:198:9
-       if (!this.perspectiveDebug) return;
+       if (true) return;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:198:9
-       if (!this.perspectiveDebug) return;
+       if (false) return;

[NoCoverage] CallExpression
src/game/MainScene.ts:200:5
-       world.lineStyle(2, 0xf4e7a1, 0.95);
+       ;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:201:25
-       for (let depth = 1; depth <= 4; depth += 1) {
+       for (let depth = 1; false; depth += 1) {

[NoCoverage] EqualityOperator
src/game/MainScene.ts:201:25
-       for (let depth = 1; depth <= 4; depth += 1) {
+       for (let depth = 1; depth < 4; depth += 1) {

[NoCoverage] EqualityOperator
src/game/MainScene.ts:201:25
-       for (let depth = 1; depth <= 4; depth += 1) {
+       for (let depth = 1; depth > 4; depth += 1) {

[NoCoverage] AssignmentOperator
src/game/MainScene.ts:201:37
-       for (let depth = 1; depth <= 4; depth += 1) {
+       for (let depth = 1; depth <= 4; depth -= 1) {

[NoCoverage] BlockStatement
src/game/MainScene.ts:201:49
-       for (let depth = 1; depth <= 4; depth += 1) {
-         const frame = screenFrame(PORTAL_FRAMES[depth], viewport);
-         world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
-         this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
-       }
+       for (let depth = 1; depth <= 4; depth += 1) {}

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:203:47
-         world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
+         world.strokeRect(frame.left, frame.top, frame.right + frame.left, frame.bottom - frame.top);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:203:73
-         world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom - frame.top);
+         world.strokeRect(frame.left, frame.top, frame.right - frame.left, frame.bottom + frame.top);

[NoCoverage] StringLiteral
src/game/MainScene.ts:204:26
-         this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
+         this.addDebugLabel(``, frame.left + 5, frame.top + 5);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:204:39
-         this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
+         this.addDebugLabel(`D${depth}`, frame.left - 5, frame.top + 5);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:204:55
-         this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top + 5);
+         this.addDebugLabel(`D${depth}`, frame.left + 5, frame.top - 5);

[NoCoverage] StringLiteral
src/game/MainScene.ts:210:24
-       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+       this.addDebugLabel("", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:35
-       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+       this.addDebugLabel("CEILING", viewport.left - viewport.width * 0.38, viewport.top + viewport.height * 0.1);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:51
-       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+       this.addDebugLabel("CEILING", viewport.left + viewport.width / 0.38, viewport.top + viewport.height * 0.1);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:74
-       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top - viewport.height * 0.1);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:210:89
-       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height * 0.1);
+       this.addDebugLabel("CEILING", viewport.left + viewport.width * 0.38, viewport.top + viewport.height / 0.1);

[NoCoverage] StringLiteral
src/game/MainScene.ts:211:24
-       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+       this.addDebugLabel("", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:33
-       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+       this.addDebugLabel("FLOOR", viewport.left - viewport.width * 0.42, viewport.top + viewport.height * 0.86);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:49
-       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+       this.addDebugLabel("FLOOR", viewport.left + viewport.width / 0.42, viewport.top + viewport.height * 0.86);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:72
-       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top - viewport.height * 0.86);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:211:87
-       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height * 0.86);
+       this.addDebugLabel("FLOOR", viewport.left + viewport.width * 0.42, viewport.top + viewport.height / 0.86);

[NoCoverage] StringLiteral
src/game/MainScene.ts:212:24
-       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:37
-       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("LEFT WALL", viewport.left - viewport.width * 0.04, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:53
-       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width / 0.04, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:76
-       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top - viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:212:91
-       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("LEFT WALL", viewport.left + viewport.width * 0.04, viewport.top + viewport.height / 0.45);

[NoCoverage] StringLiteral
src/game/MainScene.ts:213:24
-       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:38
-       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("RIGHT WALL", viewport.left - viewport.width * 0.83, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:54
-       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width / 0.83, viewport.top + viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:77
-       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top - viewport.height * 0.45);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:213:92
-       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height * 0.45);
+       this.addDebugLabel("RIGHT WALL", viewport.left + viewport.width * 0.83, viewport.top + viewport.height / 0.45);

[NoCoverage] CallExpression
src/game/MainScene.ts:214:5
-       world.lineStyle(1, 0x9ed4d8, 0.9);
+       ;

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:215:5
-       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+       [].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:215:75
-       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach(() => undefined);

[NoCoverage] ArrowFunction
src/game/MainScene.ts:215:113
-       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(() => undefined), true));

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:215:159
-       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), true));
+       [first.leftWall, first.rightWall, first.ceiling, first.floor].forEach((quad) => world.strokePoints(quad.map(({ x, y }) => new Phaser.Math.Vector2(x, y)), false));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:217:40
-       const terminatingWall = cells.find((cell) => cell.blocked);
+       const terminatingWall = cells.find(() => undefined);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:218:9
-       if (terminatingWall) {
+       if (true) {

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:218:9
-       if (terminatingWall) {
+       if (false) {

[NoCoverage] BlockStatement
src/game/MainScene.ts:218:26
-       if (terminatingWall) {
-         const frame = screenFrame(PORTAL_FRAMES[terminatingWall.distance], viewport);
-         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
-       } else {
+       if (terminatingWall) {} else {

[NoCoverage] StringLiteral
src/game/MainScene.ts:220:26
-         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
+         this.addDebugLabel("", frame.left, frame.bottom + 6, "#ffb38a");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:220:52
-         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
+         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom - 6, "#ffb38a");

[NoCoverage] StringLiteral
src/game/MainScene.ts:220:70
-         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "#ffb38a");
+         this.addDebugLabel("FRONT WALL", frame.left, frame.bottom + 6, "");

[NoCoverage] BlockStatement
src/game/MainScene.ts:221:12
-       } else {
-         const frame = screenFrame(PORTAL_FRAMES[cells.length], viewport);
-         this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
-       }
+       } else {}

[NoCoverage] StringLiteral
src/game/MainScene.ts:223:26
-         this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
+         this.addDebugLabel("", frame.left, frame.bottom + 6, "#9ed4d8");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:223:49
-         this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
+         this.addDebugLabel("OPENING", frame.left, frame.bottom - 6, "#9ed4d8");

[NoCoverage] StringLiteral
src/game/MainScene.ts:223:67
-         this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "#9ed4d8");
+         this.addDebugLabel("OPENING", frame.left, frame.bottom + 6, "");

[NoCoverage] CallExpression
src/game/MainScene.ts:228:5
-       this.entitySprites.clear();
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:229:5
-       this.flameSprites.clear();
+       ;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:230:29
-       this.children.removeAll(true);
+       this.children.removeAll(false);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:236:50
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, true ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:236:50
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, false ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);

[NoCoverage] LogicalOperator
src/game/MainScene.ts:236:50
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, this.state.encounter || encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:236:96
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [] : []);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:236:97
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{}] : []);

[NoCoverage] StringLiteral
src/game/MainScene.ts:236:235
-       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "monster", position: this.state.encounter.position }] : []);
+       const entities = projectEntities(this.state, this.state.encounter && encounterDefinition ? [{ id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, presentationId: encounterDefinition.presentationId, kind: "", position: this.state.encounter.position }] : []);

[NoCoverage] StringLiteral
src/game/MainScene.ts:237:35
-       Object.defineProperty(window, "__TARMIN_RENDERER__", {
+       Object.defineProperty(window, "", {

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:238:21
-         configurable: true,
+         configurable: false,

[NoCoverage] MethodExpression
src/game/MainScene.ts:242:23
-           visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
+           visibleDepth: Math.min(...primitives.map(primitive => primitive.geometry.depth), 0),

[NoCoverage] ArrowFunction
src/game/MainScene.ts:242:50
-           visibleDepth: Math.max(...primitives.map((primitive) => primitive.geometry.depth), 0),
+           visibleDepth: Math.max(...primitives.map(() => undefined), 0),

[NoCoverage] ArrowFunction
src/game/MainScene.ts:243:38
-           features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
+           features: scene.features.map(() => undefined),

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:243:52
-           features: scene.features.map((feature) => ({ kind: feature.kind, depth: feature.depth, surface: feature.surface, cell: feature.cell })),
+           features: scene.features.map((feature) => ({})),

[NoCoverage] ArrowFunction
src/game/MainScene.ts:244:40
-           primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
+           primitiveTypes: primitives.map(() => undefined),

[NoCoverage] StringLiteral
src/game/MainScene.ts:244:55
-           primitiveTypes: primitives.map((primitive) => `${primitive.geometry.depth}:${primitive.geometry.surface}:${primitive.kind}`),
+           primitiveTypes: primitives.map((primitive) => ``),

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:245:21
-           transition: this.mode === "transitioning",
+           transition: true,

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:245:21
-           transition: this.mode === "transitioning",
+           transition: false,

[NoCoverage] EqualityOperator
src/game/MainScene.ts:245:21
-           transition: this.mode === "transitioning",
+           transition: this.mode !== "transitioning",

[NoCoverage] StringLiteral
src/game/MainScene.ts:245:35
-           transition: this.mode === "transitioning",
+           transition: this.mode === "",

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:253:43
-           encounter: this.state.encounter ? { id: this.state.encounter.id, definitionId: this.state.encounter.definitionId, health: this.state.encounter.health } : null,
+           encounter: this.state.encounter ? {} : null,

[NoCoverage] ArrowFunction
src/game/MainScene.ts:261:32
-           entities: entities.map((entity) => ({ id: entity.id, definitionId: entity.definitionId, depth: entity.depth, lightLevel: entity.lightLevel })),
+           entities: entities.map(() => undefined),

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:261:45
-           entities: entities.map((entity) => ({ id: entity.id, definitionId: entity.definitionId, depth: entity.depth, lightLevel: entity.lightLevel })),
+           entities: entities.map((entity) => ({})),

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:263:21
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: {}

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:263:35
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: false, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] MethodExpression
src/game/MainScene.ts:263:55
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
