[NoCoverage] ArrowFunction
src/game/MainScene.ts:263:77
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter(() => undefined).length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:263:90
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => true).length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:263:90
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => false).length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] EqualityOperator
src/game/MainScene.ts:263:90
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind !== "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] StringLiteral
src/game/MainScene.ts:263:107
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:263:145
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: false, colorGrade: true, vignette: true, reducedMotionIndependent: true }

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:263:163
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: false, vignette: true, reducedMotionIndependent: true }

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:263:179
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: false, reducedMotionIndependent: true }

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:263:211
-           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: true }
+           atmosphere: { torchLight: true, torchSources: scene.features.filter((feature) => feature.kind === "torch-sconce").length, fogTreatment: true, colorGrade: true, vignette: true, reducedMotionIndependent: false }

[NoCoverage] BlockStatement
src/game/MainScene.ts:267:41
-       for (const primitive of primitives) {
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height })) as unknown as PortalQuad;
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
-         const mesh = this.add.mesh2d(0, 0, "dungeon-surfaces", meshVertices(points, primitive.material), [...QUAD_INDICES]) as Phaser.GameObjects.Mesh2D & { setTint(color: number): Phaser.GameObjects.Mesh2D };
-         mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
-         mesh.setRenderAsTriangles(true);
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
-       }
+       for (const primitive of primitives) {}

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:25
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = true;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:25
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = false;

[NoCoverage] LogicalOperator
src/game/MainScene.ts:269:25
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind === "passage" && primitive.kind === "open-door";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:25
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = false || primitive.kind === "open-door";

[NoCoverage] EqualityOperator
src/game/MainScene.ts:269:25
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind !== "passage" || primitive.kind === "open-door";

[NoCoverage] StringLiteral
src/game/MainScene.ts:269:44
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind === "" || primitive.kind === "open-door";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:269:57
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind === "passage" || false;

[NoCoverage] EqualityOperator
src/game/MainScene.ts:269:57
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind === "passage" || primitive.kind !== "open-door";

[NoCoverage] StringLiteral
src/game/MainScene.ts:269:76
-         const isOpening = primitive.kind === "passage" || primitive.kind === "open-door";
+         const isOpening = primitive.kind === "passage" || primitive.kind === "";

[NoCoverage] CallExpression
src/game/MainScene.ts:271:7
-         mesh.setTint(shadeColor(0xffffff, primitive.lightLevel));
+         ;

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:272:33
-         mesh.setRenderAsTriangles(true);
+         mesh.setRenderAsTriangles(false);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:273:11
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (true) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:273:11
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (false) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] LogicalOperator
src/game/MainScene.ts:273:11
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (primitive.geometry.surface === "front" || isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:273:11
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (true && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] EqualityOperator
src/game/MainScene.ts:273:11
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (primitive.geometry.surface !== "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] StringLiteral
src/game/MainScene.ts:273:42
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (primitive.geometry.surface === "" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));

[NoCoverage] CallExpression
src/game/MainScene.ts:273:64
-         if (primitive.geometry.surface === "front" && isOpening) mesh.setTint(shadeColor(0xffffff, 0.08));
+         if (primitive.geometry.surface === "front" && isOpening) ;

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:276:76
-       this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) % 4);
+       this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) * 4);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:276:87
-       this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs / 180) % 4);
+       this.renderFeatures(scene.features, viewport, this.reducedMotion ? 0 : Math.floor(this.presentationTimeMs * 180) % 4);

[NoCoverage] BlockStatement
src/game/MainScene.ts:279:41
-       for (const primitive of primitives) {
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-       }
+       for (const primitive of primitives) {}

[NoCoverage] ArrowFunction
src/game/MainScene.ts:280:50
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map(() => undefined);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:280:62
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map((point) => ({}));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:280:67
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left - point.x * viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:280:83
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x / viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:280:112
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:280:127
-         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = primitive.geometry.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y / viewport.height }));

[NoCoverage] CallExpression
src/game/MainScene.ts:284:5
-       this.renderTorchLight(world, viewport);
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:285:5
-       this.renderEntities(entities, viewport, billboardFrameAt(this.presentationTimeMs));
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:286:5
-       this.renderFog(world, viewport);
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:287:5
-       this.renderFirstPersonHands(resolveFirstPersonPresentation(this.state));
+       ;

[NoCoverage] ArrayDeclaration
src/game/MainScene.ts:289:25
-       const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];
+       const debugDepths = [];

[NoCoverage] ArrowFunction
src/game/MainScene.ts:289:52
-       const debugDepths = [...new Set(primitives.map((primitive) => primitive.geometry.depth))];
+       const debugDepths = [...new Set(primitives.map(() => undefined))];

[NoCoverage] ArrowFunction
src/game/MainScene.ts:290:64
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map(() => undefined));

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:290:79
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({})));

[NoCoverage] MethodExpression
src/game/MainScene.ts:290:100
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.every(primitive => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:290:116
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some(() => undefined) })));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:290:131
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => true) })));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:290:131
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => false) })));

[NoCoverage] LogicalOperator
src/game/MainScene.ts:290:131
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance || primitive.geometry.surface === "front") })));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:290:131
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => true && primitive.geometry.surface === "front") })));

[NoCoverage] EqualityOperator
src/game/MainScene.ts:290:131
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth !== distance && primitive.geometry.surface === "front") })));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:290:172
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && true) })));

[NoCoverage] EqualityOperator
src/game/MainScene.ts:290:172
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface !== "front") })));

[NoCoverage] StringLiteral
src/game/MainScene.ts:290:203
-       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "front") })));
+       this.drawPerspectiveDebug(world, viewport, debugDepths.map((distance) => ({ distance, blocked: primitives.some((primitive) => primitive.geometry.depth === distance && primitive.geometry.surface === "") })));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:291:9
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (true) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:291:9
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (false) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);

[NoCoverage] StringLiteral
src/game/MainScene.ts:291:51
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (this.perspectiveDebug) this.addDebugLabel(``, viewport.left + 8, viewport.top + viewport.height - 24);

[NoCoverage] MethodExpression
src/game/MainScene.ts:291:130
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toLowerCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:291:205
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left - 8, viewport.top + viewport.height - 24);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:291:224
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height + 24);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:291:224
-       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top + viewport.height - 24);
+       if (this.perspectiveDebug) this.addDebugLabel(`POS ${this.state.player.position.x},${this.state.player.position.y}  FACING ${this.state.player.facing.toUpperCase()}  PRIMITIVES ${primitives.length}`, viewport.left + 8, viewport.top - viewport.height - 24);

[NoCoverage] CallExpression
src/game/MainScene.ts:292:5
-       world.lineStyle(2, DUNGEON_PALETTE.boundary, 0.9);
+       ;

[NoCoverage] CallExpression
src/game/MainScene.ts:293:5
-       world.strokeRect(viewport.left, viewport.top, viewport.width, viewport.height);
+       ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:297:105
-     private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {
-       const width = Math.min(this.scale.width * 0.38, 480);
-       const height = width * (36 / 58);
-       this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
-         .setDisplaySize(width, height)
-         .setDepth(1000)
-         .setAlpha(0.94);
-     }
+     private renderFirstPersonHands(presentation: ReturnType<typeof resolveFirstPersonPresentation>): void {}

[NoCoverage] MethodExpression
src/game/MainScene.ts:298:19
-       const width = Math.min(this.scale.width * 0.38, 480);
+       const width = Math.max(this.scale.width * 0.38, 480);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:298:28
-       const width = Math.min(this.scale.width * 0.38, 480);
+       const width = Math.min(this.scale.width / 0.38, 480);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:299:20
-       const height = width * (36 / 58);
+       const height = width / (36 / 58);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:299:29
-       const height = width * (36 / 58);
+       const height = width * (36 * 58);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:20
-       this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+       this.add.image(this.scale.width * 2, this.scale.height - (height / 2) + 4, presentation.assetId)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:42
-       this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+       this.add.image(this.scale.width / 2, this.scale.height - height / 2 - 4, presentation.assetId)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:42
-       this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+       this.add.image(this.scale.width / 2, this.scale.height + height / 2 + 4, presentation.assetId)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:300:63
-       this.add.image(this.scale.width / 2, this.scale.height - (height / 2) + 4, presentation.assetId)
+       this.add.image(this.scale.width / 2, this.scale.height - (height * 2) + 4, presentation.assetId)

[NoCoverage] BlockStatement
src/game/MainScene.ts:307:37
-       for (const feature of features) {
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-         const left = Math.min(...points.map((point) => point.x));
-         const right = Math.max(...points.map((point) => point.x));
-         const top = Math.min(...points.map((point) => point.y));
-         const bottom = Math.max(...points.map((point) => point.y));
-         if (feature.kind === "archway") {
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
-             .setDisplaySize(right - left, bottom - top)
-             .setAlpha(feature.lightLevel)
-             .setDepth(50 - feature.depth);
-           continue;
-         }
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
-           .setDisplaySize(right - left, bottom - top)
-           .setAlpha(feature.lightLevel)
-           .setDepth(70 - feature.depth);
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
-           .setCrop(frame * 32, 0, 32, 48)
-           .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
-           .setAlpha(feature.lightLevel)
-           .setDepth(80 - feature.depth);
-         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
-       }
+

[NoCoverage] ArrowFunction
src/game/MainScene.ts:308:39
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map(() => undefined);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:308:51
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map((point) => ({}));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:56
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map((point) => ({ x: viewport.left - point.x * viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:72
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map((point) => ({ x: viewport.left + point.x / viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:101
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:308:116
-         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = feature.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y / viewport.height }));

[NoCoverage] MethodExpression
src/game/MainScene.ts:309:20
-         const left = Math.min(...points.map((point) => point.x));
+         const left = Math.max(...points.map(point => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:309:43
-         const left = Math.min(...points.map((point) => point.x));
+         const left = Math.min(...points.map(() => undefined));

[NoCoverage] MethodExpression
src/game/MainScene.ts:310:21
-         const right = Math.max(...points.map((point) => point.x));
+         const right = Math.min(...points.map(point => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:310:44
-         const right = Math.max(...points.map((point) => point.x));
+         const right = Math.max(...points.map(() => undefined));
