[NoCoverage] MethodExpression
src/game/MainScene.ts:311:19
-         const top = Math.min(...points.map((point) => point.y));
+         const top = Math.max(...points.map(point => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:311:42
-         const top = Math.min(...points.map((point) => point.y));
+         const top = Math.min(...points.map(() => undefined));

[NoCoverage] MethodExpression
src/game/MainScene.ts:312:22
-         const bottom = Math.max(...points.map((point) => point.y));
+         const bottom = Math.min(...points.map(point => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:312:45
-         const bottom = Math.max(...points.map((point) => point.y));
+         const bottom = Math.max(...points.map(() => undefined));

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:313:11
-         if (feature.kind === "archway") {
+         if (true) {

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:313:11
-         if (feature.kind === "archway") {
+         if (false) {

[NoCoverage] EqualityOperator
src/game/MainScene.ts:313:11
-         if (feature.kind === "archway") {
+         if (feature.kind !== "archway") {

[NoCoverage] StringLiteral
src/game/MainScene.ts:313:28
-         if (feature.kind === "archway") {
+         if (feature.kind === "") {

[NoCoverage] BlockStatement
src/game/MainScene.ts:313:39
-         if (feature.kind === "archway") {
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
-             .setDisplaySize(right - left, bottom - top)
-             .setAlpha(feature.lightLevel)
-             .setDepth(50 - feature.depth);
-           continue;
-         }
+         if (feature.kind === "archway") {}

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:24
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+           this.add.image((left + right) * 2, (top + bottom) / 2, "archway-stone")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:25
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+           this.add.image((left - right) / 2, (top + bottom) / 2, "archway-stone")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:44
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+           this.add.image((left + right) / 2, (top + bottom) * 2, "archway-stone")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:314:45
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+           this.add.image((left + right) / 2, (top - bottom) / 2, "archway-stone")

[NoCoverage] StringLiteral
src/game/MainScene.ts:314:64
-           this.add.image((left + right) / 2, (top + bottom) / 2, "archway-stone")
+           this.add.image((left + right) / 2, (top + bottom) / 2, "")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:315:27
-             .setDisplaySize(right - left, bottom - top)
+             .setDisplaySize(right + left, bottom - top)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:315:41
-             .setDisplaySize(right - left, bottom - top)
+             .setDisplaySize(right - left, bottom + top)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:317:21
-             .setDepth(50 - feature.depth);
+             .setDepth(50 + feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:22
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+         this.add.image((left + right) * 2, (top + bottom) / 2, "torch-sconce")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:23
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+         this.add.image((left - right) / 2, (top + bottom) / 2, "torch-sconce")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:42
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+         this.add.image((left + right) / 2, (top + bottom) * 2, "torch-sconce")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:320:43
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+         this.add.image((left + right) / 2, (top - bottom) / 2, "torch-sconce")

[NoCoverage] StringLiteral
src/game/MainScene.ts:320:62
-         this.add.image((left + right) / 2, (top + bottom) / 2, "torch-sconce")
+         this.add.image((left + right) / 2, (top + bottom) / 2, "")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:321:25
-           .setDisplaySize(right - left, bottom - top)
+           .setDisplaySize(right + left, bottom - top)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:321:39
-           .setDisplaySize(right - left, bottom - top)
+           .setDisplaySize(right - left, bottom + top)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:323:19
-           .setDepth(70 - feature.depth);
+           .setDepth(70 + feature.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:36
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left + right) * 2, top + (bottom - top) * 0.3, "torch-flame")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:37
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left - right) / 2, top + (bottom - top) * 0.3, "torch-flame")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:56
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left + right) / 2, top - (bottom - top) * 0.3, "torch-flame")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:62
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left + right) / 2, top + (bottom - top) / 0.3, "torch-flame")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:324:63
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left + right) / 2, top + (bottom + top) * 0.3, "torch-flame")

[NoCoverage] StringLiteral
src/game/MainScene.ts:324:84
-         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "torch-flame")
+         const flame = this.add.image((left + right) / 2, top + (bottom - top) * 0.3, "")

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:325:18
-           .setCrop(frame * 32, 0, 32, 48)
+           .setCrop(frame / 32, 0, 32, 48)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:25
-           .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+           .setDisplaySize((right - left) / 0.7, (bottom - top) * 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:26
-           .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+           .setDisplaySize((right + left) * 0.7, (bottom - top) * 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:47
-           .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+           .setDisplaySize((right - left) * 0.7, (bottom - top) / 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:326:48
-           .setDisplaySize((right - left) * 0.7, (bottom - top) * 0.75)
+           .setDisplaySize((right - left) * 0.7, (bottom + top) * 0.75)

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:328:19
-           .setDepth(80 - feature.depth);
+           .setDepth(80 + feature.depth);

[NoCoverage] StringLiteral
src/game/MainScene.ts:329:29
-         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
+         this.flameSprites.set(``, flame);

[NoCoverage] LogicalOperator
src/game/MainScene.ts:329:68
-         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
+         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface && ""}`, flame);

[NoCoverage] StringLiteral
src/game/MainScene.ts:329:87
-         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? ""}`, flame);
+         this.flameSprites.set(`${feature.cell.x},${feature.cell.y}:${feature.surface ?? "Stryker was here!"}`, flame);

[NoCoverage] BlockStatement
src/game/MainScene.ts:333:156
-     private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {
-       for (const entity of entities) {
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-         const left = Math.min(...points.map((point) => point.x));
-         const right = Math.max(...points.map((point) => point.x));
-         const top = Math.min(...points.map((point) => point.y));
-         const bottom = Math.max(...points.map((point) => point.y));
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
-         sprite.setCrop(frame * 32, 0, 32, 48);
-         // Keep near billboards above far billboards independent of display-list order.
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
-         sprite.setAlpha(entity.lightLevel);
-         this.entitySprites.set(entity.id, sprite);
-       }
-     }
+     private renderEntities(entities: readonly EntityBillboard[], viewport: { left: number; top: number; width: number; height: number }, frame: 0 | 1): void {}

[NoCoverage] BlockStatement
src/game/MainScene.ts:334:36
-       for (const entity of entities) {
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
-         const left = Math.min(...points.map((point) => point.x));
-         const right = Math.max(...points.map((point) => point.x));
-         const top = Math.min(...points.map((point) => point.y));
-         const bottom = Math.max(...points.map((point) => point.y));
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
-         sprite.setCrop(frame * 32, 0, 32, 48);
-         // Keep near billboards above far billboards independent of display-list order.
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
-         sprite.setAlpha(entity.lightLevel);
-         this.entitySprites.set(entity.id, sprite);
-       }
+       for (const entity of entities) {}

[NoCoverage] ArrowFunction
src/game/MainScene.ts:335:38
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map(() => undefined);

[NoCoverage] ObjectLiteral
src/game/MainScene.ts:335:50
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map((point) => ({}));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:335:55
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map((point) => ({ x: viewport.left - point.x * viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:335:71
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map((point) => ({ x: viewport.left + point.x / viewport.width, y: viewport.top + point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:335:100
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top - point.y * viewport.height }));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:335:115
-         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y * viewport.height }));
+         const points = entity.quad.map((point) => ({ x: viewport.left + point.x * viewport.width, y: viewport.top + point.y / viewport.height }));

[NoCoverage] MethodExpression
src/game/MainScene.ts:336:20
-         const left = Math.min(...points.map((point) => point.x));
+         const left = Math.max(...points.map(point => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:336:43
-         const left = Math.min(...points.map((point) => point.x));
+         const left = Math.min(...points.map(() => undefined));

[NoCoverage] MethodExpression
src/game/MainScene.ts:337:21
-         const right = Math.max(...points.map((point) => point.x));
+         const right = Math.min(...points.map(point => point.x));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:337:44
-         const right = Math.max(...points.map((point) => point.x));
+         const right = Math.max(...points.map(() => undefined));

[NoCoverage] MethodExpression
src/game/MainScene.ts:338:19
-         const top = Math.min(...points.map((point) => point.y));
+         const top = Math.max(...points.map(point => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:338:42
-         const top = Math.min(...points.map((point) => point.y));
+         const top = Math.min(...points.map(() => undefined));

[NoCoverage] MethodExpression
src/game/MainScene.ts:339:22
-         const bottom = Math.max(...points.map((point) => point.y));
+         const bottom = Math.min(...points.map(point => point.y));

[NoCoverage] ArrowFunction
src/game/MainScene.ts:339:45
-         const bottom = Math.max(...points.map((point) => point.y));
+         const bottom = Math.max(...points.map(() => undefined));

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:340:37
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) * 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:340:38
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left - right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:340:57
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) * 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:340:58
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top - bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:340:77
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, true ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:340:77
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, false ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] EqualityOperator
src/game/MainScene.ts:340:77
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId !== "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] StringLiteral
src/game/MainScene.ts:340:103
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] StringLiteral
src/game/MainScene.ts:340:114
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:340:134
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : true ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:340:134
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : false ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] EqualityOperator
src/game/MainScene.ts:340:134
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId !== "mireling" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] StringLiteral
src/game/MainScene.ts:340:160
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "" ? "glass-mireling" : "gloam-scavenger");

[NoCoverage] StringLiteral
src/game/MainScene.ts:340:173
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "" : "gloam-scavenger");

[NoCoverage] StringLiteral
src/game/MainScene.ts:340:192
-         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "gloam-scavenger");
+         const sprite = this.add.image((left + right) / 2, (top + bottom) / 2, entity.presentationId === "warden" ? "ashbound-warden" : entity.presentationId === "mireling" ? "glass-mireling" : "");

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:341:22
-         sprite.setCrop(frame * 32, 0, 32, 48);
+         sprite.setCrop(frame / 32, 0, 32, 48);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:29
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+         sprite.setDisplaySize(right + left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:43
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+         sprite.setDisplaySize(right - left, bottom + top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:66
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length + entity.depth);

[NoCoverage] ArithmeticOperator
src/game/MainScene.ts:343:66
-         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 + PORTAL_FRAMES.length - entity.depth);
+         sprite.setDisplaySize(right - left, bottom - top).setDepth(100 - PORTAL_FRAMES.length - entity.depth);

[NoCoverage] CallExpression
src/game/MainScene.ts:344:7
-         sprite.setAlpha(entity.lightLevel);
+         ;

[NoCoverage] CallExpression
src/game/MainScene.ts:345:7
-         this.entitySprites.set(entity.id, sprite);
+         ;

[NoCoverage] BlockStatement
src/game/MainScene.ts:349:62
-     private itemName(instanceId: string | null): string | null {
-       if (!instanceId) return null;
-       const instance = this.state.items.find((item) => item.id === instanceId);
-       return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
-     }
+     private itemName(instanceId: string | null): string | null {}

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:350:9
-       if (!instanceId) return null;
+       if (instanceId) return null;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:350:9
-       if (!instanceId) return null;
+       if (true) return null;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:350:9
-       if (!instanceId) return null;
+       if (false) return null;

[NoCoverage] ArrowFunction
src/game/MainScene.ts:351:44
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find(() => undefined);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:351:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => true);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:351:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => false);

[NoCoverage] EqualityOperator
src/game/MainScene.ts:351:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => item.id !== instanceId);

[NoCoverage] LogicalOperator
src/game/MainScene.ts:352:23
-       return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
+       return instance ? itemById(instance.definitionId)?.name && instance.definitionId : null;

[NoCoverage] OptionalChaining
src/game/MainScene.ts:352:23
-       return instance ? itemById(instance.definitionId)?.name ?? instance.definitionId : null;
+       return instance ? itemById(instance.definitionId).name ?? instance.definitionId : null;

[NoCoverage] BlockStatement
src/game/MainScene.ts:355:57
-     private itemDetail(instanceId: string | null): string {
-       if (!instanceId) return "No item equipped";
-       const instance = this.state.items.find((item) => item.id === instanceId);
-       const definition = instance ? itemById(instance.definitionId) : undefined;
-       if (!definition) return "Unknown item";
-       if (definition.attack) return `STRIKE +${definition.attack}`;
-       if (definition.defense) return `GUARD +${definition.defense}`;
-       if (definition.healing) return `RESTORE +${definition.healing}`;
-       return "Treasure carried";
-     }
+     private itemDetail(instanceId: string | null): string {}

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:356:9
-       if (!instanceId) return "No item equipped";
+       if (instanceId) return "No item equipped";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:356:9
-       if (!instanceId) return "No item equipped";
+       if (true) return "No item equipped";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:356:9
-       if (!instanceId) return "No item equipped";
+       if (false) return "No item equipped";

[NoCoverage] StringLiteral
src/game/MainScene.ts:356:29
-       if (!instanceId) return "No item equipped";
+       if (!instanceId) return "";

[NoCoverage] ArrowFunction
src/game/MainScene.ts:357:44
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find(() => undefined);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:357:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => true);

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:357:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => false);

[NoCoverage] EqualityOperator
src/game/MainScene.ts:357:54
-       const instance = this.state.items.find((item) => item.id === instanceId);
+       const instance = this.state.items.find((item) => item.id !== instanceId);

[NoCoverage] BooleanLiteral
src/game/MainScene.ts:359:9
-       if (!definition) return "Unknown item";
+       if (definition) return "Unknown item";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:359:9
-       if (!definition) return "Unknown item";
+       if (true) return "Unknown item";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:359:9
-       if (!definition) return "Unknown item";
+       if (false) return "Unknown item";

[NoCoverage] StringLiteral
src/game/MainScene.ts:359:29
-       if (!definition) return "Unknown item";
+       if (!definition) return "";

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:360:9
-       if (definition.attack) return `STRIKE +${definition.attack}`;
+       if (true) return `STRIKE +${definition.attack}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:360:9
-       if (definition.attack) return `STRIKE +${definition.attack}`;
+       if (false) return `STRIKE +${definition.attack}`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:360:35
-       if (definition.attack) return `STRIKE +${definition.attack}`;
+       if (definition.attack) return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:361:9
-       if (definition.defense) return `GUARD +${definition.defense}`;
+       if (true) return `GUARD +${definition.defense}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:361:9
-       if (definition.defense) return `GUARD +${definition.defense}`;
+       if (false) return `GUARD +${definition.defense}`;

[NoCoverage] StringLiteral
src/game/MainScene.ts:361:36
-       if (definition.defense) return `GUARD +${definition.defense}`;
+       if (definition.defense) return ``;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:362:9
-       if (definition.healing) return `RESTORE +${definition.healing}`;
+       if (true) return `RESTORE +${definition.healing}`;

[NoCoverage] ConditionalExpression
src/game/MainScene.ts:362:9
-       if (definition.healing) return `RESTORE +${definition.healing}`;
+       if (false) return `RESTORE +${definition.healing}`;
