[NoCoverage] StringLiteral
src/game/MainScene.ts:362:36
-       if (definition.healing) return `RESTORE +${definition.healing}`;
+       if (definition.healing) return ``;

[NoCoverage] StringLiteral
src/game/MainScene.ts:363:12
-       return "Treasure carried";
+       return "";

[NoCoverage] BlockStatement
src/game/palette.ts:21:51
-   export function paletteHex(color: number): string {
-     return `#${color.toString(16).padStart(6, "0")}`;
-   }
+   export function paletteHex(color: number): string {}

[NoCoverage] StringLiteral
src/game/palette.ts:22:10
-     return `#${color.toString(16).padStart(6, "0")}`;
+     return ``;

[NoCoverage] StringLiteral
src/game/palette.ts:22:45
-     return `#${color.toString(16).padStart(6, "0")}`;
+     return `#${color.toString(16).padStart(6, "")}`;

[NoCoverage] BlockStatement
src/game/palette.ts:25:67
-   export function shadeColor(color: number, amount: number): number {
-     const red = (color >> 16) & 0xff;
-     const green = (color >> 8) & 0xff;
-     const blue = color & 0xff;
-     return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
-   }
+   export function shadeColor(color: number, amount: number): number {}

[NoCoverage] ArithmeticOperator
src/game/palette.ts:29:22
-     return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
+     return (Math.round(red / amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);

[NoCoverage] ArithmeticOperator
src/game/palette.ts:29:57
-     return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
+     return (Math.round(red * amount) << 16) | (Math.round(green / amount) << 8) | Math.round(blue * amount);

[NoCoverage] ArithmeticOperator
src/game/palette.ts:29:92
-     return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue * amount);
+     return (Math.round(red * amount) << 16) | (Math.round(green * amount) << 8) | Math.round(blue / amount);

[NoCoverage] BlockStatement
src/game/portalProjection.ts:13:95
-   export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
-   }
+   export function frameToPixels(frame: PortalFrame, width: number, height: number): PortalFrame {}

[NoCoverage] ObjectLiteral
src/game/portalProjection.ts:14:10
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+     return {};

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:18
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+     return { left: frame.left / width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:45
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+     return { left: frame.left * width, right: frame.right / width, top: frame.top * height, bottom: frame.bottom * height };

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:71
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+     return { left: frame.left * width, right: frame.right * width, top: frame.top / height, bottom: frame.bottom * height };

[NoCoverage] ArithmeticOperator
src/game/portalProjection.ts:14:99
-     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom * height };
+     return { left: frame.left * width, right: frame.right * width, top: frame.top * height, bottom: frame.bottom / height };

[Survived] BlockStatement
src/game/portalProjection.ts:22:4
-   }> {
-     const tl = { x: near.left, y: near.top };
-     const tr = { x: near.right, y: near.top };
-     const bl = { x: near.left, y: near.bottom };
-     const br = { x: near.right, y: near.bottom };
-     const ftl = { x: far.left, y: far.top };
-     const ftr = { x: far.right, y: far.top };
-     const fbl = { x: far.left, y: far.bottom };
-     const fbr = { x: far.right, y: far.bottom };
-     return {
-       leftWall: [tl, ftl, fbl, bl],
-       rightWall: [ftr, tr, br, fbr],
-       ceiling: [tl, tr, ftr, ftl],
-       floor: [bl, fbl, fbr, br]
-     };
-   }
+   }> {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:24:14
-     const tr = { x: near.right, y: near.top };
+     const tr = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:23:14
-     const tl = { x: near.left, y: near.top };
+     const tl = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:25:14
-     const bl = { x: near.left, y: near.bottom };
+     const bl = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:26:14
-     const br = { x: near.right, y: near.bottom };
+     const br = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:27:15
-     const ftl = { x: far.left, y: far.top };
+     const ftl = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:28:15
-     const ftr = { x: far.right, y: far.top };
+     const ftr = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:29:15
-     const fbl = { x: far.left, y: far.bottom };
+     const fbl = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:31:10
-     return {
-       leftWall: [tl, ftl, fbl, bl],
-       rightWall: [ftr, tr, br, fbr],
-       ceiling: [tl, tr, ftr, ftl],
-       floor: [bl, fbl, fbr, br]
-     };
+     return {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ObjectLiteral
src/game/portalProjection.ts:30:15
-     const fbr = { x: far.right, y: far.bottom };
+     const fbr = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ArrayDeclaration
src/game/portalProjection.ts:32:15
-       leftWall: [tl, ftl, fbl, bl],
+       leftWall: [],
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ArrayDeclaration
src/game/portalProjection.ts:33:16
-       rightWall: [ftr, tr, br, fbr],
+       rightWall: [],
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ArrayDeclaration
src/game/portalProjection.ts:34:14
-       ceiling: [tl, tr, ftr, ftl],
+       ceiling: [],
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ArrayDeclaration
src/game/portalProjection.ts:35:12
-       floor: [bl, fbl, fbr, br]
+       floor: []
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:9:57
-   function fixtureWalls(fixture: RenderFixture): string[] {
-     const walls: string[] = [];
-     const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
-     for (let depth = 1; depth <= 4; depth += 1) {
-       wall(depth, -1);
-       wall(depth, 1);
-     }
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
-       walls.splice(walls.indexOf("1,-1"), 1);
-       walls.splice(walls.indexOf("1,1"), 1);
-     }
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
-       walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
-     }
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
-     return walls;
-   }
+   function fixtureWalls(fixture: RenderFixture): string[] {}

[NoCoverage] ArrayDeclaration
src/game/renderFixtures.ts:10:27
-     const walls: string[] = [];
+     const walls: string[] = ["Stryker was here"];

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:11:48
-     const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
+     const wall = (x: number, y: number): void => {};

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:11:61
-     const wall = (x: number, y: number): void => { walls.push(`${x},${y}`); };
+     const wall = (x: number, y: number): void => { walls.push(``); };

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:12:23
-     for (let depth = 1; depth <= 4; depth += 1) {
+     for (let depth = 1; false; depth += 1) {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:12:23
-     for (let depth = 1; depth <= 4; depth += 1) {
+     for (let depth = 1; depth < 4; depth += 1) {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:12:23
-     for (let depth = 1; depth <= 4; depth += 1) {
+     for (let depth = 1; depth > 4; depth += 1) {

[NoCoverage] AssignmentOperator
src/game/renderFixtures.ts:12:35
-     for (let depth = 1; depth <= 4; depth += 1) {
+     for (let depth = 1; depth <= 4; depth -= 1) {

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:12:47
-     for (let depth = 1; depth <= 4; depth += 1) {
-       wall(depth, -1);
-       wall(depth, 1);
-     }
+     for (let depth = 1; depth <= 4; depth += 1) {}

[NoCoverage] UnaryOperator
src/game/renderFixtures.ts:13:17
-       wall(depth, -1);
+       wall(depth, +1);

[NoCoverage] CallExpression
src/game/renderFixtures.ts:14:5
-       wall(depth, 1);
+       ;

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:16:7
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+     if (true) wall(Number(fixture.slice(5)), 0);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:16:7
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+     if (false) wall(Number(fixture.slice(5)), 0);

[NoCoverage] MethodExpression
src/game/renderFixtures.ts:16:7
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+     if (fixture.endsWith("wall-")) wall(Number(fixture.slice(5)), 0);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:16:26
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+     if (fixture.startsWith("")) wall(Number(fixture.slice(5)), 0);

[NoCoverage] MethodExpression
src/game/renderFixtures.ts:16:48
-     if (fixture.startsWith("wall-")) wall(Number(fixture.slice(5)), 0);
+     if (fixture.startsWith("wall-")) wall(Number(fixture), 0);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:7
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (true) {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:7
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (false) {

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:17:7
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture === "t-intersection" && fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:7
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (false || fixture === "four-way-intersection") {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:17:7
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture !== "t-intersection" || fixture === "four-way-intersection") {

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:17:19
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture === "" || fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:17:39
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture === "t-intersection" || false) {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:17:39
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture === "t-intersection" || fixture !== "four-way-intersection") {

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:17:51
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
+     if (fixture === "t-intersection" || fixture === "") {

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:17:76
-     if (fixture === "t-intersection" || fixture === "four-way-intersection") {
-       walls.splice(walls.indexOf("1,-1"), 1);
-       walls.splice(walls.indexOf("1,1"), 1);
-     }
+     if (fixture === "t-intersection" || fixture === "four-way-intersection") {}

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:18:32
-       walls.splice(walls.indexOf("1,-1"), 1);
+       walls.splice(walls.indexOf(""), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:19:32
-       walls.splice(walls.indexOf("1,1"), 1);
+       walls.splice(walls.indexOf(""), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (true) {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (false) {

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if ((fixture === "left-opening-1" || fixture === "left-opening-2") && fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (false || fixture === "four-way-intersection") {

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" && fixture === "left-opening-2" || fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (false || fixture === "left-opening-2" || fixture === "four-way-intersection") {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:21:7
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture !== "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:21:19
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "" || fixture === "left-opening-2" || fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:39
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || false || fixture === "four-way-intersection") {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:21:39
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || fixture !== "left-opening-2" || fixture === "four-way-intersection") {

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:21:51
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || fixture === "" || fixture === "four-way-intersection") {

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:21:71
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || fixture === "left-opening-2" || false) {

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:21:71
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture !== "four-way-intersection") {

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:21:83
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
+     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "") {

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:21:108
-     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {
-       walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
-     }
+     if (fixture === "left-opening-1" || fixture === "left-opening-2" || fixture === "four-way-intersection") {}

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:22:32
-       walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
+       walls.splice(walls.indexOf(``), 1);

[NoCoverage] MethodExpression
src/game/renderFixtures.ts:22:35
-       walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
+       walls.splice(walls.indexOf(`${fixture.startsWith("-2") ? 2 : 1},-1`), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:22:52
-       walls.splice(walls.indexOf(`${fixture.endsWith("-2") ? 2 : 1},-1`), 1);
+       walls.splice(walls.indexOf(`${fixture.endsWith("") ? 2 : 1},-1`), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:7
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (true) walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:7
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (false) walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:24:7
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "right-opening-1" && fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:7
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (false || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:24:7
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture !== "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:24:19
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:24:40
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "right-opening-1" || false) walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:24:40
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "right-opening-1" || fixture !== "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:24:52
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "right-opening-1" || fixture === "") walls.splice(walls.indexOf("1,1"), 1);

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:24:104
-     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf("1,1"), 1);
+     if (fixture === "right-opening-1" || fixture === "four-way-intersection") walls.splice(walls.indexOf(""), 1);

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:28:72
-   export function createRenderFixture(fixture: RenderFixture): GameState {
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
-     const initial = createInitialState(7391);
-     return {
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
-     };
-   }
+   export function createRenderFixture(fixture: RenderFixture): GameState {}

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:29:18
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = true ? fixture : "playing";

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:29:18
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = false ? fixture : "playing";

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:29:18
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "defeated" && fixture === "victorious" ? fixture : "playing";

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:29:18
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = false || fixture === "victorious" ? fixture : "playing";

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:29:18
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture !== "defeated" || fixture === "victorious" ? fixture : "playing";

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:29:30
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "" || fixture === "victorious" ? fixture : "playing";

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:29:44
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "defeated" || false ? fixture : "playing";

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:29:44
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "defeated" || fixture !== "victorious" ? fixture : "playing";

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:29:56
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "defeated" || fixture === "" ? fixture : "playing";

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:29:81
-     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "playing";
+     const status = fixture === "defeated" || fixture === "victorious" ? fixture : "";

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:31:10
-     return {
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
-     };
+     return {};

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:32:50
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: true ? 0 : fixture === "combat-defeat" ? 1 : 10,

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:32:50
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: false ? 0 : fixture === "combat-defeat" ? 1 : 10,

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:32:50
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status !== "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
