[NoCoverage] StringLiteral
src/game/renderFixtures.ts:32:61
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status === "" ? 0 : fixture === "combat-defeat" ? 1 : 10,

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:32:78
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : true ? 1 : 10,

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:32:78
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : false ? 1 : 10,

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:32:78
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture !== "combat-defeat" ? 1 : 10,

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:32:90
-       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "combat-defeat" ? 1 : 10,
+       ...initial, runStatus: status, playerHealth: status === "defeated" ? 0 : fixture === "" ? 1 : 10,

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:33:13
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: {},

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:33:25
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: true ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:33:25
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: false ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:33:25
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: fixture !== "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:33:37
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: fixture === "" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:33:55
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: fixture === "combat-defeat" ? {} : { x: 0, y: 0 }, facing: "east" },

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:33:72
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : {}, facing: "east" },

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:33:96
-       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "east" },
+       player: { position: fixture === "combat-defeat" ? { x: 1, y: 1 } : { x: 0, y: 0 }, facing: "" },

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:34:12
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+       walls: true ? initial.walls : fixtureWalls(fixture),

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:34:12
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+       walls: false ? initial.walls : fixtureWalls(fixture),

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:34:12
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+       walls: fixture !== "combat-defeat" ? initial.walls : fixtureWalls(fixture),

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:34:24
-       walls: fixture === "combat-defeat" ? initial.walls : fixtureWalls(fixture),
+       walls: fixture === "" ? initial.walls : fixtureWalls(fixture),

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:12
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: true ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:12
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: false ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:35:12
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" && fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:12
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: false || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:35:12
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture !== "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:35:24
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:41
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || false ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:35:41
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture !== "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:35:53
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []

[NoCoverage] ArrayDeclaration
src/game/renderFixtures.ts:35:67
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [] : []

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:35:68
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{}] : []

[NoCoverage] ObjectLiteral
src/game/renderFixtures.ts:35:80
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: {}, open: fixture === "open-door" }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:102
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: true }] : []

[NoCoverage] ConditionalExpression
src/game/renderFixtures.ts:35:102
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: false }] : []

[NoCoverage] EqualityOperator
src/game/renderFixtures.ts:35:102
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture !== "open-door" }] : []

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:35:114
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "" }] : []

[NoCoverage] ArrayDeclaration
src/game/renderFixtures.ts:35:131
-       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : []
+       doors: fixture === "closed-door" || fixture === "open-door" ? [{ position: { x: 1, y: 0 }, open: fixture === "open-door" }] : ["Stryker was here"]

[NoCoverage] BlockStatement
src/game/renderFixtures.ts:39:67
-   export function renderFixtureFromLocation(): RenderFixture | null {
-     const value = new URLSearchParams(window.location.search).get("fixture");
-     return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
-   }
+   export function renderFixtureFromLocation(): RenderFixture | null {}

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:40:65
-     const value = new URLSearchParams(window.location.search).get("fixture");
+     const value = new URLSearchParams(window.location.search).get("");

[NoCoverage] LogicalOperator
src/game/renderFixtures.ts:41:58
-     return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
+     return (RENDER_FIXTURES as readonly string[]).includes(value && "") ? value as RenderFixture : null;

[NoCoverage] StringLiteral
src/game/renderFixtures.ts:41:67
-     return (RENDER_FIXTURES as readonly string[]).includes(value ?? "") ? value as RenderFixture : null;
+     return (RENDER_FIXTURES as readonly string[]).includes(value ?? "Stryker was here!") ? value as RenderFixture : null;

[NoCoverage] BlockStatement
src/game/seed.ts:9:45
-   export function createBrowserSeed(): number {
-     const values = new Uint32Array(1);
-     crypto.getRandomValues(values);
-     return normalizeSeed(values[0]);
-   }
+   export function createBrowserSeed(): number {}

[Survived] BlockStatement
src/game/seed.ts:1:63
-   export function normalizeSeed(value: string | number): number {
-     const text = String(value).trim();
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
-     let hash = 2166136261;
-     for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
-     return (hash >>> 0) || 1;
-   }
+   export function normalizeSeed(value: string | number): number {}
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] MethodExpression
src/game/seed.ts:2:16
-     const text = String(value).trim();
+     const text = String(value);
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] ConditionalExpression
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (true) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] ConditionalExpression
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (false) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\d+/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[^+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\d$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] Regex
src/game/seed.ts:3:7
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\D+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] ConditionalExpression
src/game/seed.ts:3:39
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\d+$/.test(text)) return true;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly

[Survived] ConditionalExpression
src/game/seed.ts:3:39
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\d+$/.test(text)) return false;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly

[Survived] LogicalOperator
src/game/seed.ts:3:39
-     if (/^[+-]?\d+$/.test(text)) return (Number.parseInt(text, 10) >>> 0) || 1;
+     if (/^[+-]?\d+$/.test(text)) return Number.parseInt(text, 10) >>> 0 && 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly

[Survived] BlockStatement
src/game/seed.ts:5:33
-     for (const character of text) { hash ^= character.charCodeAt(0); hash = Math.imul(hash, 16777619); }
+     for (const character of text) {}
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] ConditionalExpression
src/game/seed.ts:6:10
-     return (hash >>> 0) || 1;
+     return true;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] ConditionalExpression
src/game/seed.ts:6:10
-     return (hash >>> 0) || 1;
+     return false;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[Survived] LogicalOperator
src/game/seed.ts:6:10
-     return (hash >>> 0) || 1;
+     return hash >>> 0 && 1;
Tests ran:
    run seed flow normalizes numeric and textual seeds reproducibly
    run seed flow keeps outcomes identical for the same seed and commands

[NoCoverage] StringLiteral
src/input/bindings.ts:31:43
-         if (command === "equipLeft") return "equipSelectedLeft";
+         if (command === "equipLeft") return "";

[NoCoverage] StringLiteral
src/input/bindings.ts:32:44
-         if (command === "equipRight") return "equipSelectedRight";
+         if (command === "equipRight") return "";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:36:7
-     if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
+     if (true) return "rotateInventoryPrevious";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:36:7
-     if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
+     if (false) return "rotateInventoryPrevious";

[NoCoverage] StringLiteral
src/input/bindings.ts:36:57
-     if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
+     if (bindings.inventoryPrevious.includes(code)) return "";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:37:7
-     if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
+     if (true) return "rotateInventoryNext";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:37:7
-     if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
+     if (false) return "rotateInventoryNext";

[NoCoverage] StringLiteral
src/input/bindings.ts:37:53
-     if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
+     if (bindings.inventoryNext.includes(code)) return "";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:38:7
-     if (bindings.pickup.includes(code)) return "pickup";
+     if (true) return "pickup";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:38:7
-     if (bindings.pickup.includes(code)) return "pickup";
+     if (false) return "pickup";

[NoCoverage] StringLiteral
src/input/bindings.ts:38:46
-     if (bindings.pickup.includes(code)) return "pickup";
+     if (bindings.pickup.includes(code)) return "";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:39:7
-     if (bindings.drop.includes(code)) return "dropSelected";
+     if (true) return "dropSelected";

[NoCoverage] ConditionalExpression
src/input/bindings.ts:39:7
-     if (bindings.drop.includes(code)) return "dropSelected";
+     if (false) return "dropSelected";

[NoCoverage] StringLiteral
src/input/bindings.ts:39:44
-     if (bindings.drop.includes(code)) return "dropSelected";
+     if (bindings.drop.includes(code)) return "";

[Survived] BlockStatement
src/input/bindings.ts:28:115
-   export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {
-     for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-       if (bindings[command].includes(code)) {
-         if (command === "equipLeft") return "equipSelectedLeft";
-         if (command === "equipRight") return "equipSelectedRight";
-         return command;
-       }
-     }
-     if (bindings.inventoryPrevious.includes(code)) return "rotateInventoryPrevious";
-     if (bindings.inventoryNext.includes(code)) return "rotateInventoryNext";
-     if (bindings.pickup.includes(code)) return "pickup";
-     if (bindings.drop.includes(code)) return "dropSelected";
-     return null;
-   }
+   export function commandForKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): GameplayCommand | null {}
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] BlockStatement
src/input/bindings.ts:29:163
-     for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {
-       if (bindings[command].includes(code)) {
-         if (command === "equipLeft") return "equipSelectedLeft";
-         if (command === "equipRight") return "equipSelectedRight";
-         return command;
-       }
-     }
+     for (const command of ["moveForward", "moveBackward", "turnLeft", "turnRight", "attackLeft", "attackRight", "useSelected", "equipLeft", "equipRight"] as const) {}
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:30:9
-       if (bindings[command].includes(code)) {
+       if (true) {
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:30:9
-       if (bindings[command].includes(code)) {
+       if (false) {
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] BlockStatement
src/input/bindings.ts:30:43
-       if (bindings[command].includes(code)) {
-         if (command === "equipLeft") return "equipSelectedLeft";
-         if (command === "equipRight") return "equipSelectedRight";
-         return command;
-       }
+       if (bindings[command].includes(code)) {}
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:31:11
-         if (command === "equipLeft") return "equipSelectedLeft";
+         if (true) return "equipSelectedLeft";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:31:11
-         if (command === "equipLeft") return "equipSelectedLeft";
+         if (false) return "equipSelectedLeft";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] EqualityOperator
src/input/bindings.ts:31:11
-         if (command === "equipLeft") return "equipSelectedLeft";
+         if (command !== "equipLeft") return "equipSelectedLeft";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] StringLiteral
src/input/bindings.ts:31:23
-         if (command === "equipLeft") return "equipSelectedLeft";
+         if (command === "") return "equipSelectedLeft";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:32:11
-         if (command === "equipRight") return "equipSelectedRight";
+         if (true) return "equipSelectedRight";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/bindings.ts:32:11
-         if (command === "equipRight") return "equipSelectedRight";
+         if (false) return "equipSelectedRight";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] EqualityOperator
src/input/bindings.ts:32:11
-         if (command === "equipRight") return "equipSelectedRight";
+         if (command !== "equipRight") return "equipSelectedRight";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] StringLiteral
src/input/bindings.ts:32:23
-         if (command === "equipRight") return "equipSelectedRight";
+         if (command === "") return "equipSelectedRight";
Tests ran:
    keyboard input adapter maps physical keys to explicit commands
    keyboard input adapter emits commands and never mutates state

[Survived] BlockStatement
src/input/bindings.ts:43:97
-   export function isPauseKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): boolean {
-     return bindings.pause.includes(code);
-   }
+   export function isPauseKey(code: string, bindings: KeyBindings = DEFAULT_KEY_BINDINGS): boolean {}
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ObjectLiteral
src/input/bindings.ts:20:50
-   export const DEFAULT_KEY_BINDINGS: KeyBindings = {
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
-   };
+   export const DEFAULT_KEY_BINDINGS: KeyBindings = {};
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:21:16
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: [], moveBackward: ["KeyS", "ArrowDown"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:21:17
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: ["", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:21:25
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: ["KeyW", ""], moveBackward: ["KeyS", "ArrowDown"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:21:52
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["", "ArrowDown"],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:21:51
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: ["KeyW", "ArrowUp"], moveBackward: [],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:21:60
-     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", "ArrowDown"],
+     moveForward: ["KeyW", "ArrowUp"], moveBackward: ["KeyS", ""],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:22:13
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: [], turnRight: ["KeyD", "ArrowRight"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:22:14
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: ["", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:22:22
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: ["KeyA", ""], turnRight: ["KeyD", "ArrowRight"],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:22:47
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: ["KeyA", "ArrowLeft"], turnRight: [],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:22:48
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["", "ArrowRight"],
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:22:56
-     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", "ArrowRight"],
+     turnLeft: ["KeyA", "ArrowLeft"], turnRight: ["KeyD", ""],
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:22
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: [], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.
