[Survived] StringLiteral
src/input/bindings.ts:23:23
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: [""], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:47
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: [], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:48
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: [""], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:64
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: [], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:65
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: [""], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:88
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: [], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:89
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: [""], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:112
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: [], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:113
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: [""], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:135
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: [], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:136
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: [""], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:156
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: [], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:157
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: [""], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:178
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: [], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:179
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: [""], pickup: ["KeyP"], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:196
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: [], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:197
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: [""], drop: ["Backspace"]
Ran all tests for this mutant.

[Survived] ArrayDeclaration
src/input/bindings.ts:23:212
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: []
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/bindings.ts:23:213
-     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: ["Backspace"]
+     inventoryPrevious: ["KeyQ"], inventoryNext: ["KeyE"], pause: ["Escape"], attackLeft: ["Space"], attackRight: ["KeyF"], useSelected: ["KeyR"], equipLeft: ["KeyZ"], equipRight: ["KeyX"], pickup: ["KeyP"], drop: [""]
Ran all tests for this mutant.

[NoCoverage] BlockStatement
src/input/input-controller.ts:22:18
-     detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
+     detach(): void {}

[NoCoverage] StringLiteral
src/input/input-controller.ts:22:52
-     detach(): void { this.target.removeEventListener("keydown", this.onKeyDownBound); }
+     detach(): void { this.target.removeEventListener("", this.onKeyDownBound); }

[NoCoverage] BlockStatement
src/input/input-controller.ts:26:48
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+       if (isPauseKey(event.code, this.bindings)) {}

[NoCoverage] CallExpression
src/input/input-controller.ts:26:50
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+       if (isPauseKey(event.code, this.bindings)) { ; this.togglePause(); return; }

[NoCoverage] CallExpression
src/input/input-controller.ts:26:74
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); ; return; }

[Survived] ArrowFunction
src/input/input-controller.ts:15:37
-     private readonly onKeyDownBound = (event: KeyboardEvent): void => this.onKeyDown(event);
+     private readonly onKeyDownBound = () => undefined;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] BlockStatement
src/input/input-controller.ts:17:48
-     constructor(options: InputControllerOptions) {
-       this.target = options.target; this.bindings = options.bindings ?? DEFAULT_KEY_BINDINGS;
-       this.emit = options.emit; this.togglePause = options.togglePause; this.getMode = options.getMode;
-     }
+     constructor(options: InputControllerOptions) {}
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] LogicalOperator
src/input/input-controller.ts:18:51
-       this.target = options.target; this.bindings = options.bindings ?? DEFAULT_KEY_BINDINGS;
+       this.target = options.target; this.bindings = options.bindings && DEFAULT_KEY_BINDINGS;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] BlockStatement
src/input/input-controller.ts:21:18
-     attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
+     attach(): void {}
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] StringLiteral
src/input/input-controller.ts:21:49
-     attach(): void { this.target.addEventListener("keydown", this.onKeyDownBound); }
+     attach(): void { this.target.addEventListener("", this.onKeyDownBound); }
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] BlockStatement
src/input/input-controller.ts:23:49
-     private onKeyDown(event: KeyboardEvent): void {
-       const target = event.target as HTMLElement | null;
-       if (target && FORM_TAGS.has(target.tagName)) return;
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
-       if (this.getMode() !== "active") return;
-       if (event.repeat) { event.preventDefault(); return; }
-       const command = commandForKey(event.code, this.bindings);
-       if (!command) return;
-       event.preventDefault();
-       this.emit(command);
-     }
+     private onKeyDown(event: KeyboardEvent): void {}
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:25:9
-       if (target && FORM_TAGS.has(target.tagName)) return;
+       if (true) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:25:9
-       if (target && FORM_TAGS.has(target.tagName)) return;
+       if (false) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:26:9
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+       if (true) { event.preventDefault(); this.togglePause(); return; }
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] LogicalOperator
src/input/input-controller.ts:25:9
-       if (target && FORM_TAGS.has(target.tagName)) return;
+       if (target || FORM_TAGS.has(target.tagName)) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:26:9
-       if (isPauseKey(event.code, this.bindings)) { event.preventDefault(); this.togglePause(); return; }
+       if (false) { event.preventDefault(); this.togglePause(); return; }
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:27:9
-       if (this.getMode() !== "active") return;
+       if (true) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:27:9
-       if (this.getMode() !== "active") return;
+       if (false) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] EqualityOperator
src/input/input-controller.ts:27:9
-       if (this.getMode() !== "active") return;
+       if (this.getMode() === "active") return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] StringLiteral
src/input/input-controller.ts:27:28
-       if (this.getMode() !== "active") return;
+       if (this.getMode() !== "") return;
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat
    keyboard input adapter disables gameplay input in terminal modes

[Survived] ConditionalExpression
src/input/input-controller.ts:28:9
-       if (event.repeat) { event.preventDefault(); return; }
+       if (true) { event.preventDefault(); return; }
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat

[Survived] ConditionalExpression
src/input/input-controller.ts:28:9
-       if (event.repeat) { event.preventDefault(); return; }
+       if (false) { event.preventDefault(); return; }
Tests ran:
    keyboard input adapter emits commands and never mutates state
    keyboard input adapter ignores form focus and browser key repeat

[Survived] BlockStatement
src/input/input-controller.ts:28:23
-       if (event.repeat) { event.preventDefault(); return; }
+       if (event.repeat) {}
Tests ran:
    keyboard input adapter ignores form focus and browser key repeat

[Survived] CallExpression
src/input/input-controller.ts:28:25
-       if (event.repeat) { event.preventDefault(); return; }
+       if (event.repeat) { ; return; }
Tests ran:
    keyboard input adapter ignores form focus and browser key repeat

[Survived] BooleanLiteral
src/input/input-controller.ts:30:9
-       if (!command) return;
+       if (command) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/input-controller.ts:30:9
-       if (!command) return;
+       if (true) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state

[Survived] ConditionalExpression
src/input/input-controller.ts:30:9
-       if (!command) return;
+       if (false) return;
Tests ran:
    keyboard input adapter emits commands and never mutates state

[Survived] CallExpression
src/input/input-controller.ts:31:5
-       event.preventDefault();
+       ;
Tests ran:
    keyboard input adapter emits commands and never mutates state

[Survived] CallExpression
src/input/input-controller.ts:32:5
-       this.emit(command);
+       ;
Tests ran:
    keyboard input adapter emits commands and never mutates state

[Survived] ArrayDeclaration
src/input/input-controller.ts:7:27
-   const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+   const FORM_TAGS = new Set([]);
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/input-controller.ts:7:28
-   const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+   const FORM_TAGS = new Set(["", "TEXTAREA", "SELECT"]);
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/input-controller.ts:7:49
-   const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+   const FORM_TAGS = new Set(["INPUT", "TEXTAREA", ""]);
Ran all tests for this mutant.

[Survived] StringLiteral
src/input/input-controller.ts:7:37
-   const FORM_TAGS = new Set(["INPUT", "TEXTAREA", "SELECT"]);
+   const FORM_TAGS = new Set(["INPUT", "", "SELECT"]);
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:22:50
-   export const DUNGEON_SURFACE_ATLAS: PixelAtlas = {
-     id: "tarmin-dungeon-surfaces-v2",
-     source: "/assets/dungeon/dungeon-surfaces.png",
-     pixelSize: 32,
-     width: 136,
-     height: 68,
-     regions: [
-       { id: "crypt-stone", x: 1, y: 1, width: 32, height: 32 },
-       { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
-       { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
-       { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
-       { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
-       { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
-       { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
-       { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
-     ]
-   };
+   export const DUNGEON_SURFACE_ATLAS: PixelAtlas = {};
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:23:7
-     id: "tarmin-dungeon-surfaces-v2",
+     id: "",
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:24:11
-     source: "/assets/dungeon/dungeon-surfaces.png",
+     source: "",
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:30:5
-       { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:30:11
-       { id: "burial-masonry", x: 35, y: 1, width: 32, height: 32 },
+       { id: "", x: 35, y: 1, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:31:11
-       { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
+       { id: "", x: 69, y: 1, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:31:5
-       { id: "basalt", x: 69, y: 1, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:32:5
-       { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:32:11
-       { id: "timber-door", x: 103, y: 1, width: 32, height: 32 },
+       { id: "", x: 103, y: 1, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:33:5
-       { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:33:11
-       { id: "iron-door", x: 1, y: 35, width: 32, height: 32 },
+       { id: "", x: 1, y: 35, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:34:5
-       { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:34:11
-       { id: "floor-stone", x: 35, y: 35, width: 32, height: 32 },
+       { id: "", x: 35, y: 35, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:35:5
-       { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
+       {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:35:11
-       { id: "ceiling-stone", x: 69, y: 35, width: 32, height: 32 },
+       { id: "", x: 69, y: 35, width: 32, height: 32 },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/assets/dungeonAtlas.ts:36:5
-       { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
+       {}
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/assets/dungeonAtlas.ts:36:11
-       { id: "darkness", x: 103, y: 35, width: 32, height: 32 }
+       { id: "", x: 103, y: 35, width: 32, height: 32 }
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/entities/entityProjection.ts:28:39
-   const key = (point: Point): string => `${point.x},${point.y}`;
+   const key = (point: Point): string => ``;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:30:100
-   function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {
-     const forward = DELTAS[state.player.facing];
-     const dx = position.x - state.player.position.x;
-     const dy = position.y - state.player.position.y;
-     const depth = dx * forward.x + dy * forward.y;
-     const lateral = dx * -forward.y + dy * forward.x;
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
-     return { depth, lateral };
-   }
+   function entityDepth(state: GameState, position: Point): { depth: number; lateral: number } | null {}
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:32:14
-     const dx = position.x - state.player.position.x;
+     const dx = position.x + state.player.position.x;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:33:14
-     const dy = position.y - state.player.position.y;
+     const dy = position.y + state.player.position.y;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:34:17
-     const depth = dx * forward.x + dy * forward.y;
+     const depth = dx * forward.x - dy * forward.y;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:34:17
-     const depth = dx * forward.x + dy * forward.y;
+     const depth = dx / forward.x + dy * forward.y;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:34:34
-     const depth = dx * forward.x + dy * forward.y;
+     const depth = dx * forward.x + dy / forward.y;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:35:19
-     const lateral = dx * -forward.y + dy * forward.x;
+     const lateral = dx * -forward.y - dy * forward.x;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!
