[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:35:19
-     const lateral = dx * -forward.y + dy * forward.x;
+     const lateral = dx / -forward.y + dy * forward.x;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] UnaryOperator
src/renderer/entities/entityProjection.ts:35:24
-     const lateral = dx * -forward.y + dy * forward.x;
+     const lateral = dx * +forward.y + dy * forward.x;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:35:37
-     const lateral = dx * -forward.y + dy * forward.x;
+     const lateral = dx * -forward.y + dy / forward.x;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (true) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (false) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if ((!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length) && Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (false || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if ((!Number.isInteger(depth) || depth < 1) && depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (false || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) && depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BooleanLiteral
src/renderer/entities/entityProjection.ts:36:7
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:35
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || false || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:35
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth <= 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:35
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth >= 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:48
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || false || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:48
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || depth > PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:48
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || depth < PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:36:81
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || false) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:81
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) >= depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:36:81
-     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) > depth) return null;
+     if (!Number.isInteger(depth) || depth < 1 || depth >= PORTAL_FRAMES.length || Math.abs(lateral) <= depth) return null;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:37:10
-     return { depth, lateral };
+     return {};
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:40:62
-   function nearestOpaqueDepth(state: GameState): number | null {
-     const forward = DELTAS[state.player.facing];
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
-     }
-     return null;
-   }
+   function nearestOpaqueDepth(state: GameState): number | null {}
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:42:23
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
+     for (let depth = 1; false; depth += 1) {
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:42:23
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
+     for (let depth = 1; depth <= PORTAL_FRAMES.length; depth += 1) {
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:42:23
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
+     for (let depth = 1; depth >= PORTAL_FRAMES.length; depth += 1) {
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] AssignmentOperator
src/renderer/entities/entityProjection.ts:42:53
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
+     for (let depth = 1; depth < PORTAL_FRAMES.length; depth -= 1) {
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:42:65
-     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
-     }
+     for (let depth = 1; depth < PORTAL_FRAMES.length; depth += 1) {}
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:43:19
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+       const point = {};
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:24
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+       const point = { x: state.player.position.x - forward.x * depth, y: state.player.position.y + forward.y * depth };
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:50
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+       const point = { x: state.player.position.x + forward.x / depth, y: state.player.position.y + forward.y * depth };
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:72
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y - forward.y * depth };
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:43:98
-       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y * depth };
+       const point = { x: state.player.position.x + forward.x * depth, y: state.player.position.y + forward.y / depth };
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:44:35
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+       const door = state.doors.find(() => undefined);
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:44:50
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+       const door = state.doors.find((candidate) => true);
Tests ran:
    perspective entity billboards does not project through a wall or closed door

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:44:50
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+       const door = state.doors.find((candidate) => false);
Tests ran:
    perspective entity billboards does not project through a wall or closed door

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:44:50
-       const door = state.doors.find((candidate) => key(candidate.position) === key(point));
+       const door = state.doors.find((candidate) => key(candidate.position) !== key(point));
Tests ran:
    perspective entity billboards does not project through a wall or closed door

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:45:9
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (true) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:45:9
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (false) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:45:9
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (state.walls.includes(key(point)) && door?.open === false) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:45:45
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (state.walls.includes(key(point)) || false) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:45:45
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (state.walls.includes(key(point)) || door?.open !== false) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] OptionalChaining
src/renderer/entities/entityProjection.ts:45:45
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (state.walls.includes(key(point)) || door.open === false) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BooleanLiteral
src/renderer/entities/entityProjection.ts:45:60
-       if (state.walls.includes(key(point)) || door?.open === false) return depth;
+       if (state.walls.includes(key(point)) || door?.open === true) return depth;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:50:68
-   function billboardQuad(depth: number, lateral: number): PortalQuad {
-     const near = PORTAL_FRAMES[depth - 1];
-     const far = PORTAL_FRAMES[depth];
-     const scale = DEPTH_SCALE[depth];
-     const frameWidth = far.right - far.left;
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
-     const width = frameWidth * 0.52 * scale;
-     const height = (far.bottom - far.top) * 0.78 * scale;
-     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
-     const top = bottom - height;
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
-   }
+   function billboardQuad(depth: number, lateral: number): PortalQuad {}
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:51:30
-     const near = PORTAL_FRAMES[depth - 1];
+     const near = PORTAL_FRAMES[depth + 1];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:54:22
-     const frameWidth = far.right - far.left;
+     const frameWidth = far.right + far.left;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:18
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) / 2 - lateral / Math.max(1, depth) * frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:18
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) * 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:19
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left - far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:47
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) / 2 + lateral / Math.max(1, depth) * frameWidth / 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:47
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) / 2 + lateral / Math.max(1, depth) / frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:55:48
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) / 2 + (lateral * Math.max(1, depth)) * frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection
