[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:55:58
-     const center = (far.left + far.right) / 2 + (lateral / Math.max(1, depth)) * frameWidth * 0.34;
+     const center = (far.left + far.right) / 2 + (lateral / Math.min(1, depth)) * frameWidth * 0.34;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:56:17
-     const width = frameWidth * 0.52 * scale;
+     const width = frameWidth * 0.52 / scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:56:17
-     const width = frameWidth * 0.52 * scale;
+     const width = frameWidth / 0.52 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:57:18
-     const height = (far.bottom - far.top) * 0.78 * scale;
+     const height = (far.bottom - far.top) * 0.78 / scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:57:18
-     const height = (far.bottom - far.top) * 0.78 * scale;
+     const height = (far.bottom - far.top) / 0.78 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:57:19
-     const height = (far.bottom - far.top) * 0.78 * scale;
+     const height = (far.bottom + far.top) * 0.78 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:18
-     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+     const bottom = far.bottom + (far.bottom - near.bottom) * 0.12 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:31
-     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 / scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:31
-     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+     const bottom = far.bottom - (far.bottom - near.bottom) / 0.12 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:58:32
-     const bottom = far.bottom - (far.bottom - near.bottom) * 0.12 * scale;
+     const bottom = far.bottom - (far.bottom + near.bottom) * 0.12 * scale;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:59:15
-     const top = bottom - height;
+     const top = bottom + height;
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArrayDeclaration
src/renderer/entities/entityProjection.ts:60:10
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:60:11
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{}, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:16
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center + width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:25
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width * 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:60:46
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, {}, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:51
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center - width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:60
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width * 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:60:81
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, {}, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:86
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center - width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:95
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width * 2, y: bottom }, { x: center - width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:60:119
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, {}];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:124
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center + width / 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:60:133
-     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width / 2, y: bottom }];
+     return [{ x: center - width / 2, y: top }, { x: center + width / 2, y: top }, { x: center + width / 2, y: bottom }, { x: center - width * 2, y: bottom }];
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:63:113
-   export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {
-     const opaqueDepth = nearestOpaqueDepth(state);
-     return sources
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-       .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
-       .map(({ source, coordinates }) => ({
-         id: source.id,
-         definitionId: source.definitionId,
-         presentationId: source.presentationId,
-         kind: source.kind,
-         depth: coordinates.depth,
-         position: source.position,
-         quad: billboardQuad(coordinates.depth, coordinates.lateral),
-         lightLevel: DEPTH_LIGHT[coordinates.depth]
-       }))
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
-   }
+   export function projectEntities(state: GameState, sources: readonly EntitySource[]): readonly EntityBillboard[] {}
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or

[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:65:10
-     return sources
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-       .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
-       .map(({ source, coordinates }) => ({
-         id: source.id,
-         definitionId: source.definitionId,
-         presentationId: source.presentationId,
-         kind: source.kind,
-         depth: coordinates.depth,
-         position: source.position,
-         quad: billboardQuad(coordinates.depth, coordinates.lateral),
-         lightLevel: DEPTH_LIGHT[coordinates.depth]
-       }))
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+     return sources.map(source => ({
+     source,
+     coordinates: entityDepth(state, source.position)
+   })).filter((entry): entry is {
+     source: EntitySource;
+     coordinates: {
+       depth: number;
+       lateral: number;
+     };
+   } => Boolean(entry.coordinates)).filter(({
+     coordinates
+   }) => opaqueDepth === null || coordinates.depth < opaqueDepth).map(({
+     source,

[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:65:10
-     return sources
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-       .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+     return sources.map(source => ({
+     source,
+     coordinates: entityDepth(state, source.position)
+   })).filter((entry): entry is {
+     source: EntitySource;
+     coordinates: {
+       depth: number;
+       lateral: number;
+     };
+   } => Boolean(entry.coordinates))
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] MethodExpression
src/renderer/entities/entityProjection.ts:65:10
-     return sources
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
-       .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
+     return sources.map(source => ({
+     source,
+     coordinates: entityDepth(state, source.position)
+   }))
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:66:10
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
+       .map(() => undefined)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:66:23
-       .map((source) => ({ source, coordinates: entityDepth(state, source.position) }))
+       .map((source) => ({}))
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:67:13
-       .filter((entry): entry is { source: EntitySource; coordinates: { depth: number; lateral: number } } => Boolean(entry.coordinates))
+       .filter(() => undefined)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:68:13
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(() => undefined)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:68:34
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => true)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:68:34
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => false)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:68:34
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => opaqueDepth === null && coordinates.depth < opaqueDepth)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:68:34
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => false || coordinates.depth < opaqueDepth)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:68:34
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => opaqueDepth !== null || coordinates.depth < opaqueDepth)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:68:58
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => opaqueDepth === null || false)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards does not project through a wall or closed door
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:68:58
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth <= opaqueDepth)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards does not project through a wall or closed door
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] EqualityOperator
src/renderer/entities/entityProjection.ts:68:58
-       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth < opaqueDepth)
+       .filter(({ coordinates }) => opaqueDepth === null || coordinates.depth >= opaqueDepth)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards does not project through a wall or closed door
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:69:10
-       .map(({ source, coordinates }) => ({
-         id: source.id,
-         definitionId: source.definitionId,
-         presentationId: source.presentationId,
-         kind: source.kind,
-         depth: coordinates.depth,
-         position: source.position,
-         quad: billboardQuad(coordinates.depth, coordinates.lateral),
-         lightLevel: DEPTH_LIGHT[coordinates.depth]
-       }))
+       .map(() => undefined)
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ObjectLiteral
src/renderer/entities/entityProjection.ts:69:40
-       .map(({ source, coordinates }) => ({
-         id: source.id,
-         definitionId: source.definitionId,
-         presentationId: source.presentationId,
-         kind: source.kind,
-         depth: coordinates.depth,
-         position: source.position,
-         quad: billboardQuad(coordinates.depth, coordinates.lateral),
-         lightLevel: DEPTH_LIGHT[coordinates.depth]
-       }))
+       .map(({ source, coordinates }) => ({}))
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:79:11
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+       .sort(() => undefined);
Tests ran:
    perspective entity billboards projects the canonical encounter at its discrete forward depth
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards does not project through a wall or closed door
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:79:30
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+       .sort((first, second) => true);
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically

[Survived] ConditionalExpression
src/renderer/entities/entityProjection.ts:79:30
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+       .sort((first, second) => false);
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically

[Survived] LogicalOperator
src/renderer/entities/entityProjection.ts:79:30
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+       .sort((first, second) => second.depth - first.depth && first.id.localeCompare(second.id));
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically

[Survived] ArithmeticOperator
src/renderer/entities/entityProjection.ts:79:30
-       .sort((first, second) => second.depth - first.depth || first.id.localeCompare(second.id));
+       .sort((first, second) => second.depth + first.depth || first.id.localeCompare(second.id));
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:82:79
-   export function entitySignature(entities: readonly EntityBillboard[]): string {
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
-   }
+   export function entitySignature(entities: readonly EntityBillboard[]): string {}
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection
