[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:83:23
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map(() => undefined).join("|");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] StringLiteral
src/renderer/entities/entityProjection.ts:83:35
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map((entity) => ``).join("|");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:83:104
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map(() => undefined).join(";")}`).join("|");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] StringLiteral
src/renderer/entities/entityProjection.ts:83:115
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => ``).join(";")}`).join("|");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] StringLiteral
src/renderer/entities/entityProjection.ts:83:158
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] StringLiteral
src/renderer/entities/entityProjection.ts:83:145
-     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return entities.map((entity) => `${entity.id}:${entity.depth}:${entity.lightLevel}:${entity.quad.map((point) => `${point.x},${point.y}`).join("")}`).join("|");
Tests ran:
    perspective entity billboards scales and orders near/far billboards deterministically
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] BlockStatement
src/renderer/entities/entityProjection.ts:86:69
-   export function billboardFrameAt(presentationTimeMs: number): 0 | 1 {
-     return Math.floor(Math.max(0, presentationTimeMs) / 260) % 2 as 0 | 1;
-   }
+   export function billboardFrameAt(presentationTimeMs: number): 0 | 1 {}
Tests ran:
    perspective entity billboards keeps animation timing outside the authoritative entity projection

[Survived] ArrowFunction
src/renderer/entities/entityProjection.ts:28:13
-   const key = (point: Point): string => `${point.x},${point.y}`;
+   const key = () => undefined;
Ran all tests for this mutant.

[Survived] BlockStatement
src/renderer/firstPerson/handPresentation.ts:16:77
-   function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
-     const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
-     return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
-   }
+   function resolveSlot(state: GameState, hand: HandSlot): FirstPersonHandSlot {}
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:17:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = true ? state.leftHand : state.rightHand;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:17:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = false ? state.leftHand : state.rightHand;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] EqualityOperator
src/renderer/firstPerson/handPresentation.ts:17:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = hand !== "left" ? state.leftHand : state.rightHand;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:17:27
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = hand === "" ? state.leftHand : state.rightHand;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ArrowFunction
src/renderer/firstPerson/handPresentation.ts:18:42
-     const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+     const item = itemId ? state.items.find(() => undefined) : undefined;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:18:56
-     const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+     const item = itemId ? state.items.find((instance) => true) : undefined;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ConditionalExpression
src/renderer/firstPerson/handPresentation.ts:18:56
-     const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+     const item = itemId ? state.items.find((instance) => false) : undefined;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] EqualityOperator
src/renderer/firstPerson/handPresentation.ts:18:56
-     const item = itemId ? state.items.find((instance) => instance.id === itemId) : undefined;
+     const item = itemId ? state.items.find((instance) => instance.id !== itemId) : undefined;
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ObjectLiteral
src/renderer/firstPerson/handPresentation.ts:19:10
-     return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
+     return {};
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] LogicalOperator
src/renderer/firstPerson/handPresentation.ts:19:49
-     return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
+     return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId && null : null };
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] BlockStatement
src/renderer/firstPerson/handPresentation.ts:27:91
-   export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {
-     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
-   }
+   export function resolveFirstPersonPresentation(state: GameState): FirstPersonPresentation {}
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] OptionalChaining
src/renderer/firstPerson/handPresentation.ts:19:49
-     return { hand, itemId, presentationId: item ? itemById(item.definitionId)?.presentationId ?? null : null };
+     return { hand, itemId, presentationId: item ? itemById(item.definitionId).presentationId ?? null : null };
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] ObjectLiteral
src/renderer/firstPerson/handPresentation.ts:28:10
-     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+     return {};
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:28:21
-     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+     return { assetId: "", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:28:64
-     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+     return { assetId: "fp-hands-empty", left: resolveSlot(state, ""), right: resolveSlot(state, "right") };
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[Survived] StringLiteral
src/renderer/firstPerson/handPresentation.ts:28:99
-     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "right") };
+     return { assetId: "fp-hands-empty", left: resolveSlot(state, "left"), right: resolveSlot(state, "") };
Tests ran:
    first-person hand presentation derives both slots from canonical equipment and presentation IDs
    first-person hand presentation keeps the empty-hand asset when equipped art is unsupported

[NoCoverage] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:43:129
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "", quads.rightWall));

[NoCoverage] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:71:178
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
+     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length + 1], variation });

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:12:87
-   function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {
-     const forward = DELTAS[state.player.facing];
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
-   }
+   function sidePoint(state: GameState, distance: number, side: "left" | "right"): Point {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:14:19
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = true ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:14:19
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = false ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:14:19
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side !== "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:14:28
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side === "" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:14:37
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side === "left" ? {} : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] UnaryOperator
src/renderer/perspective/perspectiveRenderer.ts:14:56
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side === "left" ? { x: forward.y, y: +forward.x } : { x: -forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:14:71
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] UnaryOperator
src/renderer/perspective/perspectiveRenderer.ts:14:76
-     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: -forward.y, y: forward.x };
+     const lateral = side === "left" ? { x: forward.y, y: -forward.x } : { x: +forward.y, y: forward.x };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:15:10
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:15
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x + forward.x * distance - lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:15
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x - forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:41
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x + forward.x / distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:78
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance - lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:78
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y - forward.y * distance + lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:15:104
-     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y * distance + lateral.y };
+     return { x: state.player.position.x + forward.x * distance + lateral.x, y: state.player.position.y + forward.y / distance + lateral.y };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrayDeclaration
src/renderer/perspective/perspectiveRenderer.ts:19:36
-     const result: ScenePrimitive[] = [];
+     const result: ScenePrimitive[] = ["Stryker was here"];
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrayDeclaration
src/renderer/perspective/perspectiveRenderer.ts:20:40
-     const features: ProjectedFeature[] = [];
+     const features: ProjectedFeature[] = ["Stryker was here"];
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:22:48
-     const cells = [1, 2, 3, 4].map((distance) => {
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
-       return { distance, point, kind: visibleCellKind(state, point) };
-     });
+     const cells = [1, 2, 3, 4].map((distance) => {});
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrayDeclaration
src/renderer/perspective/perspectiveRenderer.ts:22:17
-     const cells = [1, 2, 3, 4].map((distance) => {
+     const cells = [].map((distance) => {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:23:19
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+       const point = {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:24
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+       const point = { x: state.player.position.x - forward.x * distance, y: state.player.position.y + forward.y * distance };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:50
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+       const point = { x: state.player.position.x + forward.x / distance, y: state.player.position.y + forward.y * distance };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:75
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y - forward.y * distance };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!
