[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:23:101
-       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y * distance };
+       const point = { x: state.player.position.x + forward.x * distance, y: state.player.position.y + forward.y / distance };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:24:12
-       return { distance, point, kind: visibleCellKind(state, point) };
+       return {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrowFunction
src/renderer/perspective/perspectiveRenderer.ts:26:35
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex(() => undefined);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:26:45
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => true);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:26:45
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => false);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:26:45
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind !== "passage" || cell.kind !== "open-door");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:26:45
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => true && cell.kind !== "open-door");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:26:45
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind === "passage" && cell.kind !== "open-door");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:26:59
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind !== "" && cell.kind !== "open-door");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:26:72
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && true);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:26:72
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind === "open-door");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:27:22
-     const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+     const startIndex = true ? cells.length - 1 : blocker;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:26:86
-     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "open-door");
+     const blocker = cells.findIndex((cell) => cell.kind !== "passage" && cell.kind !== "");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:27:22
-     const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+     const startIndex = false ? cells.length - 1 : blocker;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:27:22
-     const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+     const startIndex = blocker !== -1 ? cells.length - 1 : blocker;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:27:39
-     const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+     const startIndex = blocker === -1 ? cells.length + 1 : blocker;
Tests ran:
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker

[Survived] UnaryOperator
src/renderer/perspective/perspectiveRenderer.ts:27:34
-     const startIndex = blocker === -1 ? cells.length - 1 : blocker;
+     const startIndex = blocker === +1 ? cells.length - 1 : blocker;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:28:32
-     for (let index = startIndex; index >= 0; index -= 1) {
+     for (let index = startIndex; false; index -= 1) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:28:32
-     for (let index = startIndex; index >= 0; index -= 1) {
+     for (let index = startIndex; index < 0; index -= 1) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:28:32
-     for (let index = startIndex; index >= 0; index -= 1) {
+     for (let index = startIndex; index > 0; index -= 1) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] AssignmentOperator
src/renderer/perspective/perspectiveRenderer.ts:28:44
-     for (let index = startIndex; index >= 0; index -= 1) {
+     for (let index = startIndex; index >= 0; index += 1) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:31:9
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (true) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:30:69
-       const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index + 1]);
+       const quads = intervalQuads(PORTAL_FRAMES[index], PORTAL_FRAMES[index - 1]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:31:9
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (false) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:31:9
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind === "passage" && cell.kind === "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:31:9
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind !== "passage" || cell.kind === "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:31:9
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (false || cell.kind === "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:31:23
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind === "" || cell.kind === "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:31:36
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind === "passage" || cell.kind !== "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:31:36
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind === "passage" || false) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:31:50
-       if (cell.kind === "passage" || cell.kind === "open-door") {
+       if (cell.kind === "passage" || cell.kind === "") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:31:63
-       if (cell.kind === "passage" || cell.kind === "open-door") {
-       }
+       if (cell.kind === "passage" || cell.kind === "open-door") {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 3 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:34:60
-       addPrimitive(result, state, cell.distance, cell.point, "ceiling", cell.kind, quads.ceiling);
+       addPrimitive(result, state, cell.distance, cell.point, "", cell.kind, quads.ceiling);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:35:60
-       addPrimitive(result, state, cell.distance, cell.point, "floor", cell.kind, quads.floor);
+       addPrimitive(result, state, cell.distance, cell.point, "", cell.kind, quads.floor);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:37:56
-       const rightPoint = sidePoint(state, cell.distance, "right");
+       const rightPoint = sidePoint(state, cell.distance, "");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:36:55
-       const leftPoint = sidePoint(state, cell.distance, "left");
+       const leftPoint = sidePoint(state, cell.distance, "");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:41:60
-       addPrimitive(result, state, cell.distance, rightPoint, "right", rightKind, quads.rightWall);
+       addPrimitive(result, state, cell.distance, rightPoint, "", rightKind, quads.rightWall);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:40:59
-       addPrimitive(result, state, cell.distance, leftPoint, "left", leftKind, quads.leftWall);
+       addPrimitive(result, state, cell.distance, leftPoint, "", leftKind, quads.leftWall);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:42:9
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (true) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:42:9
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (false) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:42:9
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (leftKind === "wall" || shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:42:9
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (true && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:42:9
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (leftKind !== "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:42:22
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (leftKind === "" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:42:65
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:42:127
-       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "left", quads.leftWall));
+       if (leftKind === "wall" && shouldPlaceSconce(cell.distance, "left")) features.push(torchSconce(cell.distance, cell.point, "", quads.leftWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:43:9
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (true) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:43:9
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (false) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!
