[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:43:9
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (rightKind === "wall" || shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:43:9
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (true && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:43:9
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (rightKind !== "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:43:23
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (rightKind === "" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:43:66
-       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "right")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
+       if (rightKind === "wall" && shouldPlaceSconce(cell.distance, "")) features.push(torchSconce(cell.distance, cell.point, "right", quads.rightWall));
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:44:9
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (true) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:44:9
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (false) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:44:9
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind !== "passage" || cell.kind !== "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:44:9
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (true && cell.kind !== "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:44:9
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind === "passage" && cell.kind !== "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:44:23
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind !== "" && cell.kind !== "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:44:36
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind !== "passage" && true) {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:44:36
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind !== "passage" && cell.kind === "open-door") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:44:50
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
+       if (cell.kind !== "passage" && cell.kind !== "") {
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:44:63
-       if (cell.kind !== "passage" && cell.kind !== "open-door") {
-         const frame = PORTAL_FRAMES[index + 1];
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
-       }
+       if (cell.kind !== "passage" && cell.kind !== "open-door") {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:45:35
-         const frame = PORTAL_FRAMES[index + 1];
+         const frame = PORTAL_FRAMES[index - 1];
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:46:62
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrayDeclaration
src/renderer/perspective/perspectiveRenderer.ts:46:82
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, []);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:46:83
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{}, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:46:116
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, {}, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:46:150
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, {}, { x: frame.left, y: frame.bottom }]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:46:187
-         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, { x: frame.left, y: frame.bottom }]);
+         addPrimitive(result, state, cell.distance, cell.point, "front", cell.kind, [{ x: frame.left, y: frame.top }, { x: frame.right, y: frame.top }, { x: frame.right, y: frame.bottom }, {}]);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:49:10
-     return { primitives: result, features };
+     return {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:52:79
-   function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
-   }
+   function shouldPlaceSconce(depth: number, surface: "left" | "right"): boolean {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:10
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return true;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:10
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return false;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:53:10
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return depth === 1 && surface === "left" && depth === 3 && surface === "right";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:11
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (false) || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:53:11
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 || surface === "left") || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:11
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (true && surface === "left") || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:53:11
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth !== 1 && surface === "left") || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:26
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && true) || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:53:26
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface !== "left") || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:53:38
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "") || (depth === 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:50
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (false);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:53:50
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (depth === 3 || surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:50
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (true && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:53:50
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (depth !== 3 && surface === "right");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:53:65
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (depth === 3 && true);
Tests ran:
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:53:65
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (depth === 3 && surface !== "right");
Tests ran:
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:53:77
-     return (depth === 1 && surface === "left") || (depth === 3 && surface === "right");
+     return (depth === 1 && surface === "left") || (depth === 3 && surface === "");
Tests ran:
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:56:113
-   function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
-     const inset = quad.map((point) => ({ x: center.x + (point.x - center.x) * 0.5, y: center.y + (point.y - center.y) * 0.55 })) as unknown as PortalQuad;
-     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
-   }
+   function torchSconce(depth: number, cell: Point, surface: "left" | "right", quad: PortalQuad): ProjectedFeature {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArrowFunction
src/renderer/perspective/perspectiveRenderer.ts:57:30
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce(() => undefined, { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:57:48
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({}), { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:53
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({ x: point.x - next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:63
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({ x: point.x + next.x * 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!
