[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:78
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y - next.y / 4 }), { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:57:88
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y * 4 }), { x: 0, y: 0 });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:57:103
-     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), { x: 0, y: 0 });
+     const center = quad.reduce((point, next) => ({ x: point.x + next.x / 4, y: point.y + next.y / 4 }), {});
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:59:10
-     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+     return {};
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:59:18
-     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+     return { kind: "", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:59:81
-     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] && DEPTH_LIGHT_LEVELS[3] };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:59:100
-     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[3] };
+     return { kind: "torch-sconce", depth, cell, surface, quad: inset, lightLevel: DEPTH_LIGHT_LEVELS[depth + 1] ?? DEPTH_LIGHT_LEVELS[3] };
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:62:89
-   function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {
-     const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
-     let hash = 2166136261;
-     for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
-     return (hash >>> 0) % 4;
-   }
+   function stableVariation(state: GameState, point: Point, surface: SceneSurface): number {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:63:16
-     const text = `${state.seed}:${state.floor}:${point.x}:${point.y}:${surface}`;
+     const text = ``;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/perspective/perspectiveRenderer.ts:65:23
-     for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+     for (let index = 0; false; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:65:23
-     for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+     for (let index = 0; index <= text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] EqualityOperator
src/renderer/perspective/perspectiveRenderer.ts:65:23
-     for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+     for (let index = 0; index >= text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] AssignmentOperator
src/renderer/perspective/perspectiveRenderer.ts:65:44
-     for (let index = 0; index < text.length; index += 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
+     for (let index = 0; index < text.length; index -= 1) hash = Math.imul(hash ^ text.charCodeAt(index), 16777619);
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:66:10
-     return (hash >>> 0) % 4;
+     return (hash >>> 0) * 4;
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:69:172
-   function addPrimitive(result: ScenePrimitive[], state: GameState, depth: number, cell: Point, surface: SceneSurface, kind: ScenePrimitive["kind"], quad: PortalQuad): void {
-     const variation = stableVariation(state, cell, surface);
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
-   }
+   function addPrimitive(result: ScenePrimitive[], state: GameState, depth: number, cell: Point, surface: SceneSurface, kind: ScenePrimitive["kind"], quad: PortalQuad): void {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:71:15
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
+     result.push({});
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/renderer/perspective/perspectiveRenderer.ts:71:27
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
+     result.push({ geometry: {}, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] LogicalOperator
src/renderer/perspective/perspectiveRenderer.ts:71:126
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
+     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] && DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ArithmeticOperator
src/renderer/perspective/perspectiveRenderer.ts:71:145
-     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth - 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
+     result.push({ geometry: { depth, surface, cell, quad }, kind, material: materialFor(kind, surface, variation), lightLevel: DEPTH_LIGHT_LEVELS[depth + 1] ?? DEPTH_LIGHT_LEVELS[DEPTH_LIGHT_LEVELS.length - 1], variation });
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/renderer/perspective/perspectiveRenderer.ts:74:84
-   export function primitiveSignature(primitives: readonly RenderPrimitive[]): string {
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
-   }
+   export function primitiveSignature(primitives: readonly RenderPrimitive[]): string {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] ArrowFunction
src/renderer/perspective/perspectiveRenderer.ts:75:25
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(() => undefined).join("|");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:75:82
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => ``).join("|");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] ArrowFunction
src/renderer/perspective/perspectiveRenderer.ts:75:226
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map(() => undefined).join(";")}`).join("|");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:75:237
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => ``).join(";")}`).join("|");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:75:267
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join("")}`).join("|");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] StringLiteral
src/renderer/perspective/perspectiveRenderer.ts:75:280
-     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("|");
+     return primitives.map(({ geometry, kind, material, lightLevel, variation }) => `${geometry.depth}:${geometry.surface}:${geometry.cell.x},${geometry.cell.y}:${kind}:${material}:${lightLevel}:${variation}:${geometry.quad.map((point) => `${point.x},${point.y}`).join(";")}`).join("");
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces

[Survived] BlockStatement
src/renderer/materials.ts:32:106
-   export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
-     if (kind === "passage" || kind === "open-door") return "darkness";
-     if (surface === "floor") return "floor-stone";
-     if (surface === "ceiling") return "ceiling-stone";
-     return variation === 0 ? "crypt-stone" : variation === 1 ? "burial-masonry" : "basalt";
-   }
+   export function materialFor(kind: VisibleCellKind, surface: SceneSurface, variation: number): MaterialId {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:33:7
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (true) return variation % 2 === 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:33:7
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (false) return variation % 2 === 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:33:7
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind !== "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:33:16
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "") return variation % 2 === 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:33:38
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return true ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/materials.ts:33:38
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return false ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] EqualityOperator
src/renderer/materials.ts:33:38
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return variation % 2 !== 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] ArithmeticOperator
src/renderer/materials.ts:33:38
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return variation * 2 === 0 ? "timber-door" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] StringLiteral
src/renderer/materials.ts:33:60
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return variation % 2 === 0 ? "" : "iron-door";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] StringLiteral
src/renderer/materials.ts:33:76
-     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "iron-door";
+     if (kind === "closed-door") return variation % 2 === 0 ? "timber-door" : "";
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker
  and 1 more test!

[Survived] ConditionalExpression
src/renderer/materials.ts:34:7
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (true) return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:34:7
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (false) return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] LogicalOperator
src/renderer/materials.ts:34:7
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "passage" && kind === "open-door") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:34:7
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (false || kind === "open-door") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:34:7
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind !== "passage" || kind === "open-door") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:34:16
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "" || kind === "open-door") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:34:29
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "passage" || false) return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!
