[Survived] EqualityOperator
src/renderer/materials.ts:34:29
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "passage" || kind !== "open-door") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:34:38
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "passage" || kind === "") return "darkness";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:34:58
-     if (kind === "passage" || kind === "open-door") return "darkness";
+     if (kind === "passage" || kind === "open-door") return "";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:36:7
-     if (surface === "ceiling") return "ceiling-stone";
+     if (true) return "ceiling-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:35:7
-     if (surface === "floor") return "floor-stone";
+     if (true) return "floor-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:35:7
-     if (surface === "floor") return "floor-stone";
+     if (false) return "floor-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:35:7
-     if (surface === "floor") return "floor-stone";
+     if (surface !== "floor") return "floor-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] ConditionalExpression
src/renderer/materials.ts:36:7
-     if (surface === "ceiling") return "ceiling-stone";
+     if (false) return "ceiling-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:35:19
-     if (surface === "floor") return "floor-stone";
+     if (surface === "") return "floor-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 5 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:35:35
-     if (surface === "floor") return "floor-stone";
+     if (surface === "floor") return "";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives keeps feature geometry deterministic and independent of seed
  and 3 more tests!

[Survived] EqualityOperator
src/renderer/materials.ts:36:7
-     if (surface === "ceiling") return "ceiling-stone";
+     if (surface !== "ceiling") return "ceiling-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:36:19
-     if (surface === "ceiling") return "ceiling-stone";
+     if (surface === "") return "ceiling-stone";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/renderer/materials.ts:36:37
-     if (surface === "ceiling") return "ceiling-stone";
+     if (surface === "ceiling") return "";
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives keeps feature geometry deterministic and independent of seed
  and 2 more tests!

[Survived] ObjectLiteral
src/renderer/materials.ts:23:21
-     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+     "burial-masonry": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:23:27
-     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+     "burial-masonry": { id: "", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:23:58
-     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+     "burial-masonry": { id: "burial-masonry", atlasRegion: "", fallbackColor: 0x3e3d2b, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:23:109
-     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "tile" },
+     "burial-masonry": { id: "burial-masonry", atlasRegion: "burial-masonry", fallbackColor: 0x3e3d2b, repeat: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:24:11
-     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+     basalt: {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:24:17
-     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+     basalt: { id: "", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:24:40
-     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+     basalt: { id: "basalt", atlasRegion: "", fallbackColor: 0x242820, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:24:83
-     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "tile" },
+     basalt: { id: "basalt", atlasRegion: "basalt", fallbackColor: 0x242820, repeat: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:25:18
-     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
+     "timber-door": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:25:24
-     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
+     "timber-door": { id: "", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:25:52
-     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
+     "timber-door": { id: "timber-door", atlasRegion: "", fallbackColor: 0x665735, repeat: "stretch" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:25:100
-     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "stretch" },
+     "timber-door": { id: "timber-door", atlasRegion: "timber-door", fallbackColor: 0x665735, repeat: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:26:16
-     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
+     "iron-door": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:26:22
-     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
+     "iron-door": { id: "", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:26:48
-     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
+     "iron-door": { id: "iron-door", atlasRegion: "", fallbackColor: 0x4b4e43, repeat: "stretch" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:26:94
-     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "stretch" },
+     "iron-door": { id: "iron-door", atlasRegion: "iron-door", fallbackColor: 0x4b4e43, repeat: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:27:18
-     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+     "floor-stone": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:27:24
-     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+     "floor-stone": { id: "", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:27:100
-     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:27:52
-     "floor-stone": { id: "floor-stone", atlasRegion: "floor-stone", fallbackColor: 0x343629, repeat: "tile" },
+     "floor-stone": { id: "floor-stone", atlasRegion: "", fallbackColor: 0x343629, repeat: "tile" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:28:20
-     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
+     "ceiling-stone": {},
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:28:26
-     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
+     "ceiling-stone": { id: "", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:28:56
-     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
+     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "", fallbackColor: 0x202519, repeat: "tile" },
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:28:106
-     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "tile" },
+     "ceiling-stone": { id: "ceiling-stone", atlasRegion: "ceiling-stone", fallbackColor: 0x202519, repeat: "" },
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/renderer/materials.ts:29:13
-     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+     darkness: {}
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:29:19
-     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+     darkness: { id: "", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:29:44
-     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+     darkness: { id: "darkness", atlasRegion: "", fallbackColor: 0x0e110b, repeat: "stretch" }
Ran all tests for this mutant.

[Survived] StringLiteral
src/renderer/materials.ts:29:89
-     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "stretch" }
+     darkness: { id: "darkness", atlasRegion: "darkness", fallbackColor: 0x0e110b, repeat: "" }
Ran all tests for this mutant.

[NoCoverage] StringLiteral
src/renderer/meshGeometry.ts:11:32
-     if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+     if (!region) throw new Error(``);

[Survived] BlockStatement
src/renderer/meshGeometry.ts:8:94
-   export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {
-     const atlasRegion = MATERIALS[material].atlasRegion;
-     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
-     if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
-     const inset = 0.25;
-     const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
-     const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
-     const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
-     const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
-   }
+   export function atlasUvQuad(material: MaterialId): readonly [MeshUv, MeshUv, MeshUv, MeshUv] {}
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrowFunction
src/renderer/meshGeometry.ts:10:53
-     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+     const region = DUNGEON_SURFACE_ATLAS.regions.find(() => undefined);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:10:65
-     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => false);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:10:65
-     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => true);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] EqualityOperator
src/renderer/meshGeometry.ts:10:65
-     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id === atlasRegion);
+     const region = DUNGEON_SURFACE_ATLAS.regions.find(({ id }) => id !== atlasRegion);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:11:7
-     if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+     if (true) throw new Error(`Missing dungeon atlas region for ${material}`);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] BooleanLiteral
src/renderer/meshGeometry.ts:11:7
-     if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+     if (region) throw new Error(`Missing dungeon atlas region for ${material}`);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ConditionalExpression
src/renderer/meshGeometry.ts:11:7
-     if (!region) throw new Error(`Missing dungeon atlas region for ${material}`);
+     if (false) throw new Error(`Missing dungeon atlas region for ${material}`);
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:13:17
-     const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
+     const left = (region.x - inset) / DUNGEON_SURFACE_ATLAS.width;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:13:16
-     const left = (region.x + inset) / DUNGEON_SURFACE_ATLAS.width;
+     const left = (region.x + inset) * DUNGEON_SURFACE_ATLAS.width;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:14:17
-     const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
+     const right = (region.x + region.width - inset) * DUNGEON_SURFACE_ATLAS.width;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:14:18
-     const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
+     const right = (region.x + region.width + inset) / DUNGEON_SURFACE_ATLAS.width;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:14:18
-     const right = (region.x + region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
+     const right = (region.x - region.width - inset) / DUNGEON_SURFACE_ATLAS.width;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:15:15
-     const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
+     const top = (region.y + inset) * DUNGEON_SURFACE_ATLAS.height;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:15:16
-     const top = (region.y + inset) / DUNGEON_SURFACE_ATLAS.height;
+     const top = (region.y - inset) / DUNGEON_SURFACE_ATLAS.height;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:16:19
-     const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
+     const bottom = (region.y + region.height + inset) / DUNGEON_SURFACE_ATLAS.height;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:16:19
-     const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
+     const bottom = (region.y - region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArithmeticOperator
src/renderer/meshGeometry.ts:16:18
-     const bottom = (region.y + region.height - inset) / DUNGEON_SURFACE_ATLAS.height;
+     const bottom = (region.y + region.height - inset) * DUNGEON_SURFACE_ATLAS.height;
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:10
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
+     return [];
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:11
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
+     return [[], [right, top], [right, bottom], [left, bottom]];
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:24
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
+     return [[left, top], [], [right, bottom], [left, bottom]];
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:38
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
+     return [[left, top], [right, top], [], [left, bottom]];
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrowFunction
src/renderer/meshGeometry.ts:22:23
-     return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
+     return quad.flatMap(() => undefined);
Tests ran:
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:17:55
-     return [[left, top], [right, top], [right, bottom], [left, bottom]];
+     return [[left, top], [right, top], [right, bottom], []];
Tests ran:
    dungeon Mesh2D geometry maps each material to its inset atlas swatch
    dungeon Mesh2D geometry keeps every UV corner inside its assigned atlas region
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] BlockStatement
src/renderer/meshGeometry.ts:20:80
-   export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {
-     const uv = atlasUvQuad(material);
-     return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
-   }
+   export function meshVertices(quad: PortalQuad, material: MaterialId): number[] {}
Tests ran:
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[Survived] ArrayDeclaration
src/renderer/meshGeometry.ts:22:54
-     return quad.flatMap((point: PortalPoint, index) => [point.x, point.y, uv[index][0], uv[index][1]]);
+     return quad.flatMap((point: PortalPoint, index) => []);
Tests ran:
    dungeon Mesh2D geometry preserves projected corners while supplying four textured vertices

[NoCoverage] BlockStatement
src/save/checkpoint.ts:17:47
-   function browserStorage(): StorageLike | null {
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
-   }
+   function browserStorage(): StorageLike | null {}

[NoCoverage] BlockStatement
src/save/checkpoint.ts:18:7
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try {} catch { return null; }

[NoCoverage] ConditionalExpression
src/save/checkpoint.ts:18:16
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try { return true ? null : window.localStorage; } catch { return null; }

[NoCoverage] ConditionalExpression
src/save/checkpoint.ts:18:16
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try { return false ? null : window.localStorage; } catch { return null; }

[NoCoverage] EqualityOperator
src/save/checkpoint.ts:18:16
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try { return typeof window !== "undefined" ? null : window.localStorage; } catch { return null; }

[NoCoverage] StringLiteral
src/save/checkpoint.ts:18:34
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try { return typeof window === "" ? null : window.localStorage; } catch { return null; }

[NoCoverage] BlockStatement
src/save/checkpoint.ts:18:84
-     try { return typeof window === "undefined" ? null : window.localStorage; } catch { return null; }
+     try { return typeof window === "undefined" ? null : window.localStorage; } catch {}

[NoCoverage] BooleanLiteral
src/save/checkpoint.ts:22:51
-     if (!value || typeof value !== "object") return false;
+     if (!value || typeof value !== "object") return true;
