[Survived] BlockStatement
src/save/checkpoint.ts:21:64
-   function isCheckpointState(value: unknown): value is GameState {
-     if (!value || typeof value !== "object") return false;
-     const state = value as Partial<GameState>;
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
-       && typeof state.objective === "object" && state.objective !== null;
-   }
+   function isCheckpointState(value: unknown): value is GameState {}
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:22:7
-     if (!value || typeof value !== "object") return false;
+     if (false) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:22:7
-     if (!value || typeof value !== "object") return false;
+     if (true) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:22:7
-     if (!value || typeof value !== "object") return false;
+     if (!value && typeof value !== "object") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] BooleanLiteral
src/save/checkpoint.ts:22:7
-     if (!value || typeof value !== "object") return false;
+     if (value || typeof value !== "object") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:22:17
-     if (!value || typeof value !== "object") return false;
+     if (!value || false) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:22:17
-     if (!value || typeof value !== "object") return false;
+     if (!value || typeof value === "object") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] StringLiteral
src/save/checkpoint.ts:22:34
-     if (!value || typeof value !== "object") return false;
+     if (!value || typeof value !== "") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
-       && typeof state.objective === "object" && state.objective !== null;
+     return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
-       && typeof state.objective === "object" && state.objective !== null;
+     return true;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
-       && typeof state.objective === "object" && state.objective !== null;
+     return true && state.objective !== null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
+     return true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
-       && typeof state.player === "object" && state.player !== null
+     return true && state.player !== null
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
+     return true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
+     return true && Array.isArray(state.loot)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
-       && Array.isArray(state.items) && Array.isArray(state.ring) && Array.isArray(state.loot)
+     return true && Array.isArray(state.ring) && Array.isArray(state.loot)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn) && Array.isArray(state.walls) && Array.isArray(state.doors) || Array.isArray(state.monsters)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return true && Array.isArray(state.monsters)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn) && Array.isArray(state.walls) || Array.isArray(state.doors) && Array.isArray(state.monsters)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return true && Array.isArray(state.doors) && Array.isArray(state.monsters)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
-       && Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn) || Array.isArray(state.walls) && Array.isArray(state.doors) && Array.isArray(state.monsters)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" && Number.isInteger(state.floor) || Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return true && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) && state.runStatus === "playing" || Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return true && Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState) || state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return true && Number.isInteger(state.rngState)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return state.rulesVersion === 3 && Number.isInteger(state.seed) || Number.isInteger(state.rngState)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] LogicalOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return state.rulesVersion === 3 || Number.isInteger(state.seed) && Number.isInteger(state.rngState)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return true && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:24:10
-     return state.rulesVersion === 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
+     return state.rulesVersion !== 3 && Number.isInteger(state.seed) && Number.isInteger(state.rngState)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:25:8
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+       && true && Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:25:8
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+       && state.runStatus !== "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] StringLiteral
src/save/checkpoint.ts:25:28
-       && state.runStatus === "playing" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
+       && state.runStatus === "" && Number.isInteger(state.floor) && Number.isInteger(state.turn)
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:28:8
-       && typeof state.player === "object" && state.player !== null
+       && true && state.player !== null
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:28:8
-       && typeof state.player === "object" && state.player !== null
+       && typeof state.player !== "object" && state.player !== null
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] StringLiteral
src/save/checkpoint.ts:28:32
-       && typeof state.player === "object" && state.player !== null
+       && typeof state.player === "" && state.player !== null
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:28:44
-       && typeof state.player === "object" && state.player !== null
+       && typeof state.player === "object" && true
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:28:44
-       && typeof state.player === "object" && state.player !== null
+       && typeof state.player === "object" && state.player === null
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:29:8
-       && typeof state.objective === "object" && state.objective !== null;
+       && true && state.objective !== null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:29:8
-       && typeof state.objective === "object" && state.objective !== null;
+       && typeof state.objective !== "object" && state.objective !== null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] StringLiteral
src/save/checkpoint.ts:29:35
-       && typeof state.objective === "object" && state.objective !== null;
+       && typeof state.objective === "" && state.objective !== null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] ConditionalExpression
src/save/checkpoint.ts:29:47
-       && typeof state.objective === "object" && state.objective !== null;
+       && typeof state.objective === "object" && true;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] EqualityOperator
src/save/checkpoint.ts:29:47
-       && typeof state.objective === "object" && state.objective !== null;
+       && typeof state.objective === "object" && state.objective === null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state

[Survived] BlockStatement
src/save/checkpoint.ts:32:107
-   export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {
-     if (!storage || state.runStatus !== "playing") return false;
-     const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
-   }
+   export function saveCheckpoint(state: GameState, storage: StorageLike | null = browserStorage()): boolean {}
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] ConditionalExpression
src/save/checkpoint.ts:33:7
-     if (!storage || state.runStatus !== "playing") return false;
+     if (true) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] ConditionalExpression
src/save/checkpoint.ts:33:7
-     if (!storage || state.runStatus !== "playing") return false;
+     if (false) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] BooleanLiteral
src/save/checkpoint.ts:33:7
-     if (!storage || state.runStatus !== "playing") return false;
+     if (storage || state.runStatus !== "playing") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] LogicalOperator
src/save/checkpoint.ts:33:7
-     if (!storage || state.runStatus !== "playing") return false;
+     if (!storage && state.runStatus !== "playing") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] ConditionalExpression
src/save/checkpoint.ts:33:19
-     if (!storage || state.runStatus !== "playing") return false;
+     if (!storage || false) return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] EqualityOperator
src/save/checkpoint.ts:33:19
-     if (!storage || state.runStatus !== "playing") return false;
+     if (!storage || state.runStatus === "playing") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] StringLiteral
src/save/checkpoint.ts:33:39
-     if (!storage || state.runStatus !== "playing") return false;
+     if (!storage || state.runStatus !== "") return false;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] BooleanLiteral
src/save/checkpoint.ts:33:57
-     if (!storage || state.runStatus !== "playing") return false;
+     if (!storage || state.runStatus !== "playing") return true;
Tests ran:
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ObjectLiteral
src/save/checkpoint.ts:34:40
-     const envelope: CheckpointEnvelope = { schemaVersion: CHECKPOINT_SCHEMA_VERSION, state };
+     const envelope: CheckpointEnvelope = {};
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BlockStatement
src/save/checkpoint.ts:35:7
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+     try {} catch { return false; }
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] CallExpression
src/save/checkpoint.ts:35:9
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+     try { ; return true; } catch { return false; }
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BooleanLiteral
src/save/checkpoint.ts:35:83
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return false; } catch { return false; }
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence clears a completed run's checkpoint

[Survived] BlockStatement
src/save/checkpoint.ts:35:97
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch {}
Tests ran:
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BooleanLiteral
src/save/checkpoint.ts:35:106
-     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return false; }
+     try { storage.setItem(CHECKPOINT_STORAGE_KEY, JSON.stringify(envelope)); return true; } catch { return true; }
Tests ran:
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BlockStatement
src/save/checkpoint.ts:38:98
-   export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {
-     if (!storage) return null;
-     try {
-       const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-       if (!raw) return null;
-       const envelope: unknown = JSON.parse(raw);
-       if (!envelope || typeof envelope !== "object") return null;
-       const candidate = envelope as Partial<CheckpointEnvelope>;
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
-     } catch { return null; }
-   }
+   export function loadCheckpoint(storage: StorageLike | null = browserStorage()): GameState | null {}
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] BooleanLiteral
src/save/checkpoint.ts:39:7
-     if (!storage) return null;
+     if (storage) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] ConditionalExpression
src/save/checkpoint.ts:39:7
-     if (!storage) return null;
+     if (true) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] ConditionalExpression
src/save/checkpoint.ts:39:7
-     if (!storage) return null;
+     if (false) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!

[Survived] BlockStatement
src/save/checkpoint.ts:40:7
-     try {
-       const raw = storage.getItem(CHECKPOINT_STORAGE_KEY);
-       if (!raw) return null;
-       const envelope: unknown = JSON.parse(raw);
-       if (!envelope || typeof envelope !== "object") return null;
-       const candidate = envelope as Partial<CheckpointEnvelope>;
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
-     } catch { return null; }
+     try {} catch { return null; }
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint
  and 1 more test!
