[Survived] BooleanLiteral
src/save/checkpoint.ts:42:9
-       if (!raw) return null;
+       if (raw) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint

[Survived] ConditionalExpression
src/save/checkpoint.ts:42:9
-       if (!raw) return null;
+       if (false) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint

[Survived] ConditionalExpression
src/save/checkpoint.ts:42:9
-       if (!raw) return null;
+       if (true) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence clears a completed run's checkpoint

[Survived] ConditionalExpression
src/save/checkpoint.ts:44:9
-       if (!envelope || typeof envelope !== "object") return null;
+       if (true) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ConditionalExpression
src/save/checkpoint.ts:44:9
-       if (!envelope || typeof envelope !== "object") return null;
+       if (false) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] LogicalOperator
src/save/checkpoint.ts:44:9
-       if (!envelope || typeof envelope !== "object") return null;
+       if (!envelope && typeof envelope !== "object") return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] BooleanLiteral
src/save/checkpoint.ts:44:9
-       if (!envelope || typeof envelope !== "object") return null;
+       if (envelope || typeof envelope !== "object") return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ConditionalExpression
src/save/checkpoint.ts:44:22
-       if (!envelope || typeof envelope !== "object") return null;
+       if (!envelope || false) return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] EqualityOperator
src/save/checkpoint.ts:44:22
-       if (!envelope || typeof envelope !== "object") return null;
+       if (!envelope || typeof envelope === "object") return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] StringLiteral
src/save/checkpoint.ts:44:42
-       if (!envelope || typeof envelope !== "object") return null;
+       if (!envelope || typeof envelope !== "") return null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ConditionalExpression
src/save/checkpoint.ts:46:12
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+       return true ? candidate.state : null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ConditionalExpression
src/save/checkpoint.ts:46:12
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+       return false ? candidate.state : null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] LogicalOperator
src/save/checkpoint.ts:46:12
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION || isCheckpointState(candidate.state) ? candidate.state : null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] ConditionalExpression
src/save/checkpoint.ts:46:12
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+       return true && isCheckpointState(candidate.state) ? candidate.state : null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] EqualityOperator
src/save/checkpoint.ts:46:12
-       return candidate.schemaVersion === CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
+       return candidate.schemaVersion !== CHECKPOINT_SCHEMA_VERSION && isCheckpointState(candidate.state) ? candidate.state : null;
Tests ran:
    checkpoint persistence round-trips a playing canonical state
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints

[Survived] BlockStatement
src/save/checkpoint.ts:47:11
-     } catch { return null; }
+     } catch {}
Tests ran:
    checkpoint persistence rejects malformed, unsupported, and terminal checkpoints
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BlockStatement
src/save/checkpoint.ts:50:87
-   export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {
-     try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
-   }
+   export function clearCheckpoint(storage: StorageLike | null = browserStorage()): void {}
Tests ran:
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] BlockStatement
src/save/checkpoint.ts:51:7
-     try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
+     try {} catch { /* unavailable storage is non-fatal */ }
Tests ran:
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] OptionalChaining
src/save/checkpoint.ts:51:9
-     try { storage?.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
+     try { storage.removeItem(CHECKPOINT_STORAGE_KEY); } catch { /* unavailable storage is non-fatal */ }
Tests ran:
    checkpoint persistence clears a completed run's checkpoint
    checkpoint persistence degrades safely when browser storage is unavailable

[Survived] StringLiteral
src/save/checkpoint.ts:4:39
-   export const CHECKPOINT_STORAGE_KEY = "project-tarmin.checkpoint";
+   export const CHECKPOINT_STORAGE_KEY = "";
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/rng.ts:3:141
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return {}; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ObjectLiteral
src/sim/rng.ts:2:144
-   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return {}; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] LogicalOperator
src/sim/rng.ts:2:153
-   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 && 1 }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BlockStatement
src/sim/rng.ts:3:105
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/rng.ts:2:153
-   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: true }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/rng.ts:2:153
-   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: false }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BlockStatement
src/sim/rng.ts:2:40
-   export function nextRng(rng: Rng): Rng { let value = rng.state >>> 0; value ^= value << 13; value ^= value >>> 17; value ^= value << 5; return { state: value >>> 0 || 1 }; }
+   export function nextRng(rng: Rng): Rng {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/rng.ts:3:150
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min - next.state % (max - min + 1), rng: next }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/rng.ts:3:157
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state * (max - min + 1)), rng: next }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/rng.ts:3:171
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min - 1)), rng: next }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/rng.ts:3:171
-   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max - min + 1)), rng: next }; }
+   export function roll(rng: Rng, min: number, max: number): { readonly value: number; readonly rng: Rng } { const next = nextRng(rng); return { value: min + (next.state % (max + min + 1)), rng: next }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[NoCoverage] AssignmentOperator
src/sim/state.ts:44:5
-       cursor -= entry.weight;
+       cursor += entry.weight;

[NoCoverage] ArithmeticOperator
src/sim/state.ts:46:16
-     return table[table.length - 1].itemId;
+     return table[table.length + 1].itemId;

[NoCoverage] ObjectLiteral
src/sim/state.ts:67:45
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (state.runStatus !== "playing") return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:67:62
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (state.runStatus !== "playing") return { state, events: ["Stryker was here"] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:100:20
-       return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null }, {});
+       return advance({}, {});

[NoCoverage] ObjectLiteral
src/sim/state.ts:121:36
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (!state.ring.length) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:121:53
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (!state.ring.length) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:121:54
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (!state.ring.length) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:121:62
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (!state.ring.length) return { state, events: [{ type: "", reason: "emptyRing" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:121:88
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:127:94
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "" : "right";

[NoCoverage] StringLiteral
src/sim/state.ts:128:99
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "Stryker was here!");

[NoCoverage] ObjectLiteral
src/sim/state.ts:129:51
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.handUsage) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:129:68
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.handUsage) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:129:69
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.handUsage) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:129:77
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "", reason: "invalidAction" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:129:103
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:130:36
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = hand === "left" ? "" : "rightHand";

[NoCoverage] StringLiteral
src/sim/state.ts:134:131
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "Stryker was here!");

[NoCoverage] ObjectLiteral
src/sim/state.ts:135:49
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.healing) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:135:66
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.healing) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:135:67
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.healing) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:135:75
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.healing) return { state, events: [{ type: "", reason: "invalidAction" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:135:101
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:141:25
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (!itemId) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:141:42
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (!itemId) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:141:43
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (!itemId) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:141:51
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (!itemId) return { state, events: [{ type: "", reason: "noLoot" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:141:77
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:142:47
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length >= CAPACITY) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:142:64
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length >= CAPACITY) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:142:65
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length >= CAPACITY) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:142:73
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "", reason: "inventoryFull" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:142:99
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] BlockStatement
src/sim/state.ts:146:35
-     if (command === "dropSelected") {
-       const itemId = selected(state);
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-       const ring = state.ring.filter((id) => id !== itemId);
-     }
+     if (command === "dropSelected") {}

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] LogicalOperator
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if ((!itemId || itemId === state.leftHand) && itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (false || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] LogicalOperator
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId && itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] BooleanLiteral
src/sim/state.ts:148:9
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:20
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || false || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] EqualityOperator
src/sim/state.ts:148:20
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId !== state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] ConditionalExpression
src/sim/state.ts:148:49
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || false) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] EqualityOperator
src/sim/state.ts:148:49
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId !== state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:148:84
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return {};

[NoCoverage] ArrayDeclaration
src/sim/state.ts:148:101
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [] };

[NoCoverage] ObjectLiteral
src/sim/state.ts:148:102
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{}] };

[NoCoverage] StringLiteral
src/sim/state.ts:148:110
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "", reason: "invalidAction" }] };

[NoCoverage] StringLiteral
src/sim/state.ts:148:136
-       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || itemId === state.leftHand || itemId === state.rightHand) return { state, events: [{ type: "commandIgnored", reason: "" }] };

[NoCoverage] MethodExpression
src/sim/state.ts:149:18
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring;

[NoCoverage] ArrowFunction
src/sim/state.ts:149:36
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/sim/state.ts:149:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => true);

[NoCoverage] ConditionalExpression
src/sim/state.ts:149:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => false);
