[NoCoverage] EqualityOperator
src/sim/state.ts:149:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => id === itemId);

[Survived] ObjectLiteral
src/sim/state.ts:24:166
-   const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });
+   const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? {} : {}) });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] StringLiteral
src/sim/state.ts:20:39
-   const key = (point: Point): string => `${point.x},${point.y}`;
+   const key = (point: Point): string => ``;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 30 more tests!

[Survived] BlockStatement
src/sim/state.ts:26:70
-   function encounterFromMonster(monster: MonsterInstance): CombatState {
-     const definition = monsterById(monster.definitionId)!;
-     return { id: monster.id, definitionId: definition.id, name: definition.name, health: monster.health, maxHealth: definition.vitality, attack: definition.attack, position: monster.position };
-   }
+   function encounterFromMonster(monster: MonsterInstance): CombatState {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:28:10
-     return { id: monster.id, definitionId: definition.id, name: definition.name, health: monster.health, maxHealth: definition.vitality, attack: definition.attack, position: monster.position };
+     return {};
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:24:121
-   const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });
+   const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({});
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BlockStatement
src/sim/state.ts:31:84
-   function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
-   }
+   function monsterAt(state: GameState, position: Point): MonsterInstance | undefined {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ArrowFunction
src/sim/state.ts:32:30
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find(() => undefined);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:32:43
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => true);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:32:43
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => false);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] LogicalOperator
src/sim/state.ts:32:43
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => !monster.defeated || key(monster.position) === key(position));
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] BlockStatement
src/sim/state.ts:35:115
-   function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
-   }
+   function updateMonster(state: GameState, id: string, patch: Partial<MonsterInstance>): readonly MonsterInstance[] {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArrowFunction
src/sim/state.ts:36:29
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+     return state.monsters.map(() => undefined);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:32:43
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => monster.defeated && key(monster.position) === key(position));
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:32:64
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => !monster.defeated && true);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] EqualityOperator
src/sim/state.ts:32:64
-     return state.monsters.find((monster) => !monster.defeated && key(monster.position) === key(position));
+     return state.monsters.find((monster) => !monster.defeated && key(monster.position) !== key(position));
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:36:42
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+     return state.monsters.map((monster) => true ? { ...monster, ...patch } : monster);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:36:42
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+     return state.monsters.map((monster) => false ? { ...monster, ...patch } : monster);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BlockStatement
src/sim/state.ts:39:120
-   function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {
-     const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
-     let cursor = (rollValue - 1) % totalWeight;
-     for (const entry of table) {
-       if (cursor < entry.weight) return entry.itemId;
-       cursor -= entry.weight;
-     }
-     return table[table.length - 1].itemId;
-   }
+   function chooseLoot(table: readonly { readonly itemId: string; readonly weight: number }[], rollValue: number): string {}
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] EqualityOperator
src/sim/state.ts:36:42
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+     return state.monsters.map((monster) => monster.id !== id ? { ...monster, ...patch } : monster);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:36:62
-     return state.monsters.map((monster) => monster.id === id ? { ...monster, ...patch } : monster);
+     return state.monsters.map((monster) => monster.id === id ? {} : monster);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArrowFunction
src/sim/state.ts:40:36
-     const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
+     const totalWeight = table.reduce(() => undefined, 0);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:40:54
-     const totalWeight = table.reduce((total, entry) => total + entry.weight, 0);
+     const totalWeight = table.reduce((total, entry) => total - entry.weight, 0);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:41:16
-     let cursor = (rollValue - 1) % totalWeight;
+     let cursor = (rollValue - 1) * totalWeight;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:41:17
-     let cursor = (rollValue - 1) % totalWeight;
+     let cursor = (rollValue + 1) % totalWeight;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] BlockStatement
src/sim/state.ts:42:30
-     for (const entry of table) {
-       if (cursor < entry.weight) return entry.itemId;
-       cursor -= entry.weight;
-     }
+     for (const entry of table) {}
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:43:9
-       if (cursor < entry.weight) return entry.itemId;
+       if (true) return entry.itemId;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:43:9
-       if (cursor < entry.weight) return entry.itemId;
+       if (false) return entry.itemId;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] EqualityOperator
src/sim/state.ts:43:9
-       if (cursor < entry.weight) return entry.itemId;
+       if (cursor <= entry.weight) return entry.itemId;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] EqualityOperator
src/sim/state.ts:43:9
-       if (cursor < entry.weight) return entry.itemId;
+       if (cursor >= entry.weight) return entry.itemId;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] CallExpression
src/sim/state.ts:50:3
-     assertValidContent();
+     ;
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BlockStatement
src/sim/state.ts:49:60
-   export function createInitialState(seed = 7391): GameState {
-     assertValidContent();
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
-     const monsters: readonly MonsterInstance[] = [
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
-     ];
-   }
+   export function createInitialState(seed = 7391): GameState {}
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persis

[Survived] ArrayDeclaration
src/sim/state.ts:51:17
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = [];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:18
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:24
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:30
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:36
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:42
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:48
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:54
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:60
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:66
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:72
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:78
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:84
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:90
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!
