[Survived] StringLiteral
src/sim/state.ts:51:96
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:108
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:102
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:114
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:120
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:126
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:132
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:138
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:144
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:150
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:156
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:162
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:168
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","","3,6","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:174
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","","4,6","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:180
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","","5,6","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:186
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","","6,6","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:192
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","","3,1","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:198
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","","3,4"];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:51:204
-     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1","3,4"];
+     const walls = ["0,0","1,0","2,0","3,0","4,0","5,0","6,0","0,1","6,1","0,2","2,2","3,2","6,2","0,3","6,3","0,4","6,4","0,5","1,5","2,5","4,5","5,5","6,5","0,6","1,6","2,6","3,6","4,6","5,6","6,6","3,1",""];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:52:48
-     const monsters: readonly MonsterInstance[] = [
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
-     ];
+     const monsters: readonly MonsterInstance[] = [];
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:53:5
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:53:11
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+       { id: "", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:53:45
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+       { id: "monster-warden-1", definitionId: "", position: { x: 2, y: 1 }, health: 5, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:53:74
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+       { id: "monster-warden-1", definitionId: "ashbound-warden", position: {}, health: 5, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:53:111
-       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: false },
+       { id: "monster-warden-1", definitionId: "ashbound-warden", position: { x: 2, y: 1 }, health: 5, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:54:5
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:54:11
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+       { id: "", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:54:47
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+       { id: "monster-mireling-1", definitionId: "", position: { x: 4, y: 1 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:54:75
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+       { id: "monster-mireling-1", definitionId: "glass-mireling", position: {}, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:54:112
-       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: false },
+       { id: "monster-mireling-1", definitionId: "glass-mireling", position: { x: 4, y: 1 }, health: 4, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:55:11
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+       { id: "", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:55:5
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:55:47
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+       { id: "monster-mireling-2", definitionId: "", position: { x: 5, y: 2 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:55:75
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+       { id: "monster-mireling-2", definitionId: "glass-mireling", position: {}, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:55:112
-       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: false },
+       { id: "monster-mireling-2", definitionId: "glass-mireling", position: { x: 5, y: 2 }, health: 4, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:56:5
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:56:11
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+       { id: "", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:56:47
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+       { id: "monster-mireling-3", definitionId: "", position: { x: 5, y: 3 }, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:56:112
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:56:75
-       { id: "monster-mireling-3", definitionId: "glass-mireling", position: { x: 5, y: 3 }, health: 4, defeated: false },
+       { id: "monster-mireling-3", definitionId: "glass-mireling", position: {}, health: 4, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:57:5
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!
