[Survived] StringLiteral
src/sim/state.ts:57:11
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+       { id: "", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:57:48
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-1", definitionId: "", position: { x: 4, y: 4 }, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:57:77
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: {}, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:57:114
-       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-1", definitionId: "gloam-scavenger", position: { x: 4, y: 4 }, health: 3, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:58:5
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+       {},
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:58:11
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+       { id: "", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:58:48
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-2", definitionId: "", position: { x: 5, y: 4 }, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:58:77
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: {}, health: 3, defeated: false },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:58:114
-       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: false },
+       { id: "monster-scavenger-2", definitionId: "gloam-scavenger", position: { x: 5, y: 4 }, health: 3, defeated: true },
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:59:5
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+       {}
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:59:48
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+       { id: "monster-scavenger-3", definitionId: "", position: { x: 3, y: 5 }, health: 3, defeated: false }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] StringLiteral
src/sim/state.ts:59:11
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+       { id: "", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:59:77
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: {}, health: 3, defeated: false }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:59:114
-       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: false }
+       { id: "monster-scavenger-3", definitionId: "gloam-scavenger", position: { x: 3, y: 5 }, health: 3, defeated: true }
Tests ran:
    persistent dungeon world creates serializable monster instances with stable identity and location
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
  and 44 more tests!

[Survived] BlockStatement
src/sim/state.ts:64:53
-   export function restartRun(seed: number): GameState { return createInitialState(seed); }
+   export function restartRun(seed: number): GameState {}
Tests ran:
    deterministic combat and ring inventory restarts cleanly for the same and a new seed

[Survived] BlockStatement
src/sim/state.ts:66:62
-   export function completeRun(state: GameState): CommandResult {
-     if (state.runStatus !== "playing") return { state, events: [] };
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
-   }
+   export function completeRun(state: GameState): CommandResult {}
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] ConditionalExpression
src/sim/state.ts:67:7
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (true) return { state, events: [] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] ConditionalExpression
src/sim/state.ts:67:7
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (false) return { state, events: [] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] EqualityOperator
src/sim/state.ts:67:7
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (state.runStatus === "playing") return { state, events: [] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] StringLiteral
src/sim/state.ts:67:27
-     if (state.runStatus !== "playing") return { state, events: [] };
+     if (state.runStatus !== "") return { state, events: [] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] ConditionalExpression
src/sim/state.ts:68:7
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (true) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] ConditionalExpression
src/sim/state.ts:68:7
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (false) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] LogicalOperator
src/sim/state.ts:68:7
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired && key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] BooleanLiteral
src/sim/state.ts:68:7
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up
  and 1 more test!

[Survived] ObjectLiteral
src/sim/state.ts:68:101
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return {};
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective requires the exit and objective when completing directly

[Survived] ConditionalExpression
src/sim/state.ts:68:36
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || false) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] EqualityOperator
src/sim/state.ts:68:36
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || key(state.player.position) === key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ArrayDeclaration
src/sim/state.ts:68:118
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective requires the exit and objective when completing directly

[Survived] ObjectLiteral
src/sim/state.ts:68:119
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{}] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective requires the exit and objective when completing directly

[Survived] StringLiteral
src/sim/state.ts:68:127
-     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "exitLocked", position: state.player.position }] };
+     if (!state.objective.acquired || key(state.player.position) !== key(state.objective.exit)) return { state, events: [{ type: "", position: state.player.position }] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective requires the exit and objective when completing directly

[Survived] ObjectLiteral
src/sim/state.ts:69:10
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return {};
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ObjectLiteral
src/sim/state.ts:69:27
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({}, {}), events: [{ type: "runVictorious" }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] StringLiteral
src/sim/state.ts:69:50
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ObjectLiteral
src/sim/state.ts:69:92
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: {} }, {}), events: [{ type: "runVictorious" }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ArrayDeclaration
src/sim/state.ts:69:147
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] BooleanLiteral
src/sim/state.ts:69:124
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: false } }, {}), events: [{ type: "runVictorious" }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ObjectLiteral
src/sim/state.ts:69:148
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{}] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ConditionalExpression
src/sim/state.ts:72:102
-   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => true);
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker

[Survived] ConditionalExpression
src/sim/state.ts:72:102
-   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => false);
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker

[Survived] LogicalOperator
src/sim/state.ts:73:55
-   const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
+   const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] && null;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] EqualityOperator
src/sim/state.ts:72:102
-   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) !== key(point));
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker

[Survived] StringLiteral
src/sim/state.ts:69:156
-     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "runVictorious" }] };
+     return { state: advance({ ...state, runStatus: "victorious", encounter: null, objective: { ...state.objective, complete: true } }, {}), events: [{ type: "" }] };
Tests ran:
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ConditionalExpression
src/sim/state.ts:78:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = false ? state.leftHand : state.rightHand;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:78:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = true ? state.leftHand : state.rightHand;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] EqualityOperator
src/sim/state.ts:78:18
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = hand !== "left" ? state.leftHand : state.rightHand;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ArrowFunction
src/sim/state.ts:72:92
-   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find(() => undefined);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 29 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:74:78
-   const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
+   const advance = (state: GameState, patch: Partial<GameState>): GameState => ({});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:74:106
-   const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
+   const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn - 1 });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] StringLiteral
src/sim/state.ts:78:27
-     const itemId = hand === "left" ? state.leftHand : state.rightHand;
+     const itemId = hand === "" ? state.leftHand : state.rightHand;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] LogicalOperator
src/sim/state.ts:79:31
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find(value => value.id === itemId)?.definitionId && "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!
