[Survived] OptionalChaining
src/sim/state.ts:79:31
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find(value => value.id === itemId).definitionId ?? "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ArrowFunction
src/sim/state.ts:79:48
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find(() => undefined)?.definitionId ?? "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] StringLiteral
src/sim/state.ts:79:97
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "Stryker was here!");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:79:59
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find((value) => true)?.definitionId ?? "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:79:59
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find((value) => false)?.definitionId ?? "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] EqualityOperator
src/sim/state.ts:79:59
-     const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+     const definition = itemById(state.items.find((value) => value.id !== itemId)?.definitionId ?? "");
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:80:15
-     events.push({ type: "attackAttempt", hand });
+     events.push({});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] StringLiteral
src/sim/state.ts:80:23
-     events.push({ type: "attackAttempt", hand });
+     events.push({ type: "", hand });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:81:7
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (true) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:81:7
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (false) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] BlockStatement
src/sim/state.ts:81:39
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || !definition?.attack) {}
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ObjectLiteral
src/sim/state.ts:81:53
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || !definition?.attack) { events.push({}); return state; }
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] LogicalOperator
src/sim/state.ts:81:7
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target && !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] StringLiteral
src/sim/state.ts:81:61
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || !definition?.attack) { events.push({ type: "", reason: "invalidAction" }); return state; }
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:81:87
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "" }); return state; }
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] BooleanLiteral
src/sim/state.ts:81:7
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:81:18
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:84:43
-     if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+     if (accuracy.value <= 5) return advance({}, {});
Tests ran:
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands

[Survived] OptionalChaining
src/sim/state.ts:81:19
-     if (!target || !definition?.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
+     if (!target || !definition.attack) { events.push({ type: "commandIgnored", reason: "invalidAction" }); return state; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:82:13
-     let rng = { state: state.rngState };
+     let rng = {};
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:84:7
-     if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+     if (false) return advance({ ...state, rngState: rng.state }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:84:7
-     if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+     if (true) return advance({ ...state, rngState: rng.state }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] EqualityOperator
src/sim/state.ts:84:7
-     if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+     if (accuracy.value < 5) return advance({ ...state, rngState: rng.state }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] EqualityOperator
src/sim/state.ts:84:7
-     if (accuracy.value <= 5) return advance({ ...state, rngState: rng.state }, {});
+     if (accuracy.value > 5) return advance({ ...state, rngState: rng.state }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:86:18
-     const health = target.health - damage.value;
+     const health = target.health + damage.value;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:85:47
-     const damage = roll(rng, definition.attack, definition.attack + 1); rng = damage.rng;
+     const damage = roll(rng, definition.attack, definition.attack - 1); rng = damage.rng;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:87:15
-     events.push({ type: "hit", target: target.id, damage: damage.value });
+     events.push({});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] StringLiteral
src/sim/state.ts:87:23
-     events.push({ type: "hit", target: target.id, damage: damage.value });
+     events.push({ type: "", target: target.id, damage: damage.value });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:88:7
-     if (health <= 0) {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:88:7
-     if (health <= 0) {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] EqualityOperator
src/sim/state.ts:88:7
-     if (health <= 0) {
+     if (health < 0) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BlockStatement
src/sim/state.ts:88:20
-     if (health <= 0) {
-       events.push({ type: "monsterDefeated", monsterId: target.id });
-       const table = LOOT_TABLES[monsterById(target.definitionId)!.lootTableId];
-       const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
-       const lootItemId = chooseLoot(table, lootRoll.value);
-       const lootEntry = table.find((entry) => entry.itemId === lootItemId);
-       const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
-       if (lootEntry) {
-         const lootId = `item-loot-${state.turn + 1}`;
-         events.push({ type: "itemAcquired", itemId: lootId });
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
-       }
-       return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null }, {});
-     }
+     if (health <= 0) {}
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] EqualityOperator
src/sim/state.ts:88:7
-     if (health <= 0) {
+     if (health > 0) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] StringLiteral
src/sim/state.ts:89:25
-       events.push({ type: "monsterDefeated", monsterId: target.id });
+       events.push({ type: "", monsterId: target.id });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:89:17
-       events.push({ type: "monsterDefeated", monsterId: target.id });
+       events.push({});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArrowFunction
src/sim/state.ts:91:48
-       const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
+       const lootRoll = roll(rng, 1, table.reduce(() => undefined, 0)); rng = lootRoll.rng;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:91:66
-       const lootRoll = roll(rng, 1, table.reduce((total, entry) => total + entry.weight, 0)); rng = lootRoll.rng;
+       const lootRoll = roll(rng, 1, table.reduce((total, entry) => total - entry.weight, 0)); rng = lootRoll.rng;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArrowFunction
src/sim/state.ts:93:34
-       const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+       const lootEntry = table.find(() => undefined);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:93:45
-       const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+       const lootEntry = table.find((entry) => true);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:93:45
-       const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+       const lootEntry = table.find((entry) => false);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] EqualityOperator
src/sim/state.ts:93:45
-       const lootEntry = table.find((entry) => entry.itemId === lootItemId);
+       const lootEntry = table.find((entry) => entry.itemId !== lootItemId);
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:94:54
-       const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
+       const defeated = updateMonster(state, target.id, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:94:77
-       const defeated = updateMonster(state, target.id, { health: 0, defeated: true });
+       const defeated = updateMonster(state, target.id, { health: 0, defeated: false });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:95:9
-       if (lootEntry) {
+       if (true) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:95:9
-       if (lootEntry) {
+       if (false) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] BlockStatement
src/sim/state.ts:95:20
-       if (lootEntry) {
-         const lootId = `item-loot-${state.turn + 1}`;
-         events.push({ type: "itemAcquired", itemId: lootId });
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
-       }
+       if (lootEntry) {}
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] StringLiteral
src/sim/state.ts:96:22
-         const lootId = `item-loot-${state.turn + 1}`;
+         const lootId = ``;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:96:35
-         const lootId = `item-loot-${state.turn + 1}`;
+         const lootId = `item-loot-${state.turn - 1}`;
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:97:19
-         events.push({ type: "itemAcquired", itemId: lootId });
+         events.push({});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] StringLiteral
src/sim/state.ts:97:27
-         events.push({ type: "itemAcquired", itemId: lootId });
+         events.push({ type: "", itemId: lootId });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:98:22
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
+         return advance({}, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:98:98
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
+         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:98:130
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
+         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [] }, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] StringLiteral
src/sim/state.ts:98:178
-         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "world", state.player.position)] }, {});
+         return advance({ ...state, rngState: rng.state, monsters: defeated, encounter: null, loot: [...state.loot, lootId], items: [...state.items, item(lootId, lootEntry.itemId, "", state.player.position)] }, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 2 more tests!

[Survived] MethodExpression
src/sim/state.ts:103:24
-     const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
+     const playerHealth = Math.min(0, state.playerHealth - retaliation.value);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:104:7
-     if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+     if (true) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!
