[Survived] ArithmeticOperator
src/sim/state.ts:103:36
-     const playerHealth = Math.max(0, state.playerHealth - retaliation.value);
+     const playerHealth = Math.max(0, state.playerHealth + retaliation.value);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:104:7
-     if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+     if (false) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] BlockStatement
src/sim/state.ts:105:22
-     if (!playerHealth) {
-       events.push({ type: "playerDefeated" }, { type: "runDefeated" });
-       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});
-     }
+     if (!playerHealth) {}
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] StringLiteral
src/sim/state.ts:104:46
-     if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+     if (retaliation.value) events.push({ type: "", monsterId: target.id, damage: retaliation.value });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 6 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:104:38
-     if (retaliation.value) events.push({ type: "monsterAttack", monsterId: target.id, damage: retaliation.value });
+     if (retaliation.value) events.push({});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 6 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:106:17
-       events.push({ type: "playerDefeated" }, { type: "runDefeated" });
+       events.push({}, { type: "runDefeated" });
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] StringLiteral
src/sim/state.ts:106:25
-       events.push({ type: "playerDefeated" }, { type: "runDefeated" });
+       events.push({ type: "" }, { type: "runDefeated" });
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] ObjectLiteral
src/sim/state.ts:106:45
-       events.push({ type: "playerDefeated" }, { type: "runDefeated" });
+       events.push({ type: "playerDefeated" }, {});
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] ObjectLiteral
src/sim/state.ts:107:20
-       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});
+       return advance({}, {});
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] StringLiteral
src/sim/state.ts:106:53
-       events.push({ type: "playerDefeated" }, { type: "runDefeated" });
+       events.push({ type: "playerDefeated" }, { type: "" });
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] ObjectLiteral
src/sim/state.ts:107:95
-       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});
+       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, {}), playerHealth, encounter: null, runStatus: "defeated" }, {});
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] BooleanLiteral
src/sim/state.ts:105:7
-     if (!playerHealth) {
+     if (playerHealth) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:105:7
-     if (!playerHealth) {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] StringLiteral
src/sim/state.ts:107:150
-       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "defeated" }, {});
+       return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: null, runStatus: "" }, {});
Tests ran:
    deterministic combat and ring inventory represents player defeat when retaliation reaches zero
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run

[Survived] ConditionalExpression
src/sim/state.ts:105:7
-     if (!playerHealth) {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:109:18
-     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: { ...target, health } }, {});
+     return advance({}, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 5 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:109:93
-     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: { ...target, health } }, {});
+     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, {}), playerHealth, encounter: { ...target, health } }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 5 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:109:131
-     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: { ...target, health } }, {});
+     return advance({ ...state, rngState: rng.state, monsters: updateMonster(state, target.id, { health }), playerHealth, encounter: {} }, {});
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 5 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:113:45
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "playing") return {};
Tests ran:
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands

[Survived] ArrayDeclaration
src/sim/state.ts:113:62
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "playing") return { state, events: [] };
Tests ran:
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands

[Survived] ObjectLiteral
src/sim/state.ts:113:63
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "playing") return { state, events: [{}] };
Tests ran:
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands

[Survived] StringLiteral
src/sim/state.ts:113:71
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "playing") return { state, events: [{ type: "", reason: "terminal" }] };
Tests ran:
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands

[Survived] StringLiteral
src/sim/state.ts:113:97
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "" }] };
Tests ran:
    deterministic combat and ring inventory blocks every later command after defeat without mutating the terminal run
    deterministic combat and ring inventory supports a terminal victory hook and blocks later commands

[Survived] ConditionalExpression
src/sim/state.ts:113:7
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (true) return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:113:7
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (false) return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] EqualityOperator
src/sim/state.ts:113:7
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus === "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] StringLiteral
src/sim/state.ts:113:27
-     if (state.runStatus !== "playing") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
+     if (state.runStatus !== "") return { state, events: [{ type: "commandIgnored", reason: "terminal" }] };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 25 more tests!

[Survived] BlockStatement
src/sim/state.ts:115:24
-     if (state.encounter) {
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
-     }
+     if (state.encounter) {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 11 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:116:9
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (true) return { state: advance(state, { encounter: null }), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 11 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:116:9
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (false) return { state: advance(state, { encounter: null }), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 11 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:114:31
-     const events: GameEvent[] = [];
+     const events: GameEvent[] = ["Stryker was here"];
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:116:39
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (command === "retreat") return {};
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    authoritative exploration retreats from combat without changing position

[Survived] ConditionalExpression
src/sim/state.ts:115:7
-     if (state.encounter) {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:115:7
-     if (state.encounter) {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:116:63
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (command === "retreat") return { state: advance(state, {}), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    authoritative exploration retreats from combat without changing position

[Survived] EqualityOperator
src/sim/state.ts:116:9
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (command !== "retreat") return { state: advance(state, { encounter: null }), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 11 more tests!

[Survived] StringLiteral
src/sim/state.ts:116:21
-       if (command === "retreat") return { state: advance(state, { encounter: null }), events };
+       if (command === "") return { state: advance(state, { encounter: null }), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 11 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (false) return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (true) return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] LogicalOperator
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if ((command === "attack" || command === "attackLeft") && command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (false || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] LogicalOperator
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" && command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (false || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] EqualityOperator
src/sim/state.ts:117:9
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command !== "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:61
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || false) return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] StringLiteral
src/sim/state.ts:117:21
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 10 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:33
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || false || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 9 more tests!

[Survived] EqualityOperator
src/sim/state.ts:117:33
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command !== "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 9 more tests!

[Survived] EqualityOperator
src/sim/state.ts:117:61
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command !== "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] StringLiteral
src/sim/state.ts:117:45
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 9 more tests!

[Survived] StringLiteral
src/sim/state.ts:117:73
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] StringLiteral
src/sim/state.ts:117:146
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "" : "left", events), events };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
