[Survived] ObjectLiteral
src/sim/state.ts:118:12
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+       return {};
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] ObjectLiteral
src/sim/state.ts:117:95
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return {};
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:118
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, true ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:117:118
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, false ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] EqualityOperator
src/sim/state.ts:117:118
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command !== "attackRight" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] StringLiteral
src/sim/state.ts:117:130
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "" ? "right" : "left", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 8 more tests!

[Survived] StringLiteral
src/sim/state.ts:117:156
-       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "left", events), events };
+       if (command === "attack" || command === "attackLeft" || command === "attackRight") return { state: combat(state, command === "attackRight" ? "right" : "", events), events };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 7 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:118:29
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+       return { state, events: [] };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] ObjectLiteral
src/sim/state.ts:118:30
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+       return { state, events: [{}] };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] StringLiteral
src/sim/state.ts:118:38
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+       return { state, events: [{ type: "", reason: "encounter" }] };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] StringLiteral
src/sim/state.ts:118:64
-       return { state, events: [{ type: "commandIgnored", reason: "encounter" }] };
+       return { state, events: [{ type: "commandIgnored", reason: "" }] };
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    authoritative exploration keeps identical seeds and commands deterministic

[Survived] ConditionalExpression
src/sim/state.ts:120:7
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:120:7
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] LogicalOperator
src/sim/state.ts:120:7
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command === "rotateInventoryNext" && command === "rotateInventoryPrevious") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] BlockStatement
src/sim/state.ts:120:83
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
-       const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
-     }
+     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {}
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] StringLiteral
src/sim/state.ts:120:19
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command === "" || command === "rotateInventoryPrevious") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:120:7
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (false || command === "rotateInventoryPrevious") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] EqualityOperator
src/sim/state.ts:120:7
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command !== "rotateInventoryNext" || command === "rotateInventoryPrevious") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:120:44
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command === "rotateInventoryNext" || false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:121:9
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:121:9
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:121:9
-       if (!state.ring.length) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "emptyRing" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:122:19
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
+       const delta = true ? 1 : -1;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:122:19
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
+       const delta = false ? 1 : -1;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] EqualityOperator
src/sim/state.ts:122:19
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
+       const delta = command !== "rotateInventoryNext" ? 1 : -1;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] StringLiteral
src/sim/state.ts:122:31
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
+       const delta = command === "" ? 1 : -1;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] UnaryOperator
src/sim/state.ts:122:59
-       const delta = command === "rotateInventoryNext" ? 1 : -1;
+       const delta = command === "rotateInventoryNext" ? 1 : +1;
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArithmeticOperator
src/sim/state.ts:123:19
-       const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
+       const index = (state.selectedRingIndex + delta + state.ring.length) * state.ring.length;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArithmeticOperator
src/sim/state.ts:123:20
-       const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
+       const index = (state.selectedRingIndex + delta - state.ring.length) % state.ring.length;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArithmeticOperator
src/sim/state.ts:123:20
-       const index = (state.selectedRingIndex + delta + state.ring.length) % state.ring.length;
+       const index = (state.selectedRingIndex - delta + state.ring.length) % state.ring.length;
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ObjectLiteral
src/sim/state.ts:124:12
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
+       return {};
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ObjectLiteral
src/sim/state.ts:124:36
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
+       return { state: advance(state, {}), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArrayDeclaration
src/sim/state.ts:124:75
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
+       return { state: advance(state, { selectedRingIndex: index }), events: [] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ObjectLiteral
src/sim/state.ts:124:76
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
+       return { state: advance(state, { selectedRingIndex: index }), events: [{}] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] StringLiteral
src/sim/state.ts:124:84
-       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "inventoryRotated", selectedItemId: state.ring[index] }] };
+       return { state: advance(state, { selectedRingIndex: index }), events: [{ type: "", selectedItemId: state.ring[index] }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] EqualityOperator
src/sim/state.ts:120:44
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command === "rotateInventoryNext" || command !== "rotateInventoryPrevious") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] StringLiteral
src/sim/state.ts:120:56
-     if (command === "rotateInventoryNext" || command === "rotateInventoryPrevious") {
+     if (command === "rotateInventoryNext" || command === "") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] LogicalOperator
src/sim/state.ts:126:7
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command === "equipSelectedLeft" && command === "equipSelectedRight") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:126:7
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:126:7
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:126:7
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (false || command === "equipSelectedRight") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] BlockStatement
src/sim/state.ts:126:76
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-       const slot = hand === "left" ? "leftHand" : "rightHand";
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
-     }
+     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {}
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] EqualityOperator
src/sim/state.ts:126:7
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command !== "equipSelectedLeft" || command === "equipSelectedRight") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:127:60
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = true ? "left" : "right";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:127:60
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = false ? "left" : "right";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] EqualityOperator
src/sim/state.ts:127:60
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = command !== "equipSelectedLeft" ? "left" : "right";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:126:19
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command === "" || command === "equipSelectedRight") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:126:42
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command === "equipSelectedLeft" || false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] StringLiteral
src/sim/state.ts:127:72
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = command === "" ? "left" : "right";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:127:103
-       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "right";
+       const itemId = selected(state); const hand: HandSlot = command === "equipSelectedLeft" ? "left" : "";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] LogicalOperator
src/sim/state.ts:128:33
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find(value => value.id === itemId)?.definitionId && "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] OptionalChaining
src/sim/state.ts:128:33
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find(value => value.id === itemId).definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ArrowFunction
src/sim/state.ts:128:50
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find(() => undefined)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:128:61
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find((value) => true)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:128:61
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find((value) => false)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] EqualityOperator
src/sim/state.ts:128:61
-       const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const definition = itemById(state.items.find((value) => value.id !== itemId)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:129:9
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:129:9
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] LogicalOperator
src/sim/state.ts:129:9
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId && !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] BooleanLiteral
src/sim/state.ts:129:9
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] BooleanLiteral
src/sim/state.ts:129:20
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item
