[Survived] OptionalChaining
src/sim/state.ts:129:21
-       if (!itemId || !definition?.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition.handUsage) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:130:18
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = true ? "leftHand" : "rightHand";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ConditionalExpression
src/sim/state.ts:130:18
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = false ? "leftHand" : "rightHand";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] EqualityOperator
src/sim/state.ts:130:18
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = hand !== "left" ? "leftHand" : "rightHand";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:130:27
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = hand === "" ? "leftHand" : "rightHand";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:130:49
-       const slot = hand === "left" ? "leftHand" : "rightHand";
+       const slot = hand === "left" ? "leftHand" : "";
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ObjectLiteral
src/sim/state.ts:131:12
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
+       return {};
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ObjectLiteral
src/sim/state.ts:131:29
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
+       return { state: advance({}, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:126:54
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command === "equipSelectedLeft" || command === "") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] EqualityOperator
src/sim/state.ts:126:42
-     if (command === "equipSelectedLeft" || command === "equipSelectedRight") {
+     if (command === "equipSelectedLeft" || command !== "equipSelectedRight") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:131:72
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
+       return { state: advance({ ...state, [slot]: itemId }, {}), events: [] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] ObjectLiteral
src/sim/state.ts:131:73
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
+       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{}] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] StringLiteral
src/sim/state.ts:131:81
-       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "equipmentChanged", hand, itemId }] };
+       return { state: advance({ ...state, [slot]: itemId }, {}), events: [{ type: "", hand, itemId }] };
Tests ran:
    deterministic combat and ring inventory rejects an empty hand and accepts a right-hand equipped item

[Survived] BlockStatement
src/sim/state.ts:133:34
-     if (command === "useSelected") {
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
-       const ring = state.ring.filter((id) => id !== itemId);
-     }
+     if (command === "useSelected") {}
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] LogicalOperator
src/sim/state.ts:134:65
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find(value => value.id === itemId)?.definitionId && "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] OptionalChaining
src/sim/state.ts:134:65
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find(value => value.id === itemId).definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArrowFunction
src/sim/state.ts:134:82
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find(() => undefined)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:134:93
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find((value) => true)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:134:93
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find((value) => false)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] EqualityOperator
src/sim/state.ts:134:93
-       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id === itemId)?.definitionId ?? "");
+       const itemId = selected(state); const definition = itemById(state.items.find((value) => value.id !== itemId)?.definitionId ?? "");
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:135:9
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:135:9
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] LogicalOperator
src/sim/state.ts:135:9
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId && !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] BooleanLiteral
src/sim/state.ts:135:9
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] BooleanLiteral
src/sim/state.ts:135:20
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] OptionalChaining
src/sim/state.ts:135:21
-       if (!itemId || !definition?.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
+       if (!itemId || !definition.healing) return { state, events: [{ type: "commandIgnored", reason: "invalidAction" }] };
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] MethodExpression
src/sim/state.ts:136:18
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring;
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ArrowFunction
src/sim/state.ts:136:36
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter(() => undefined);
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:136:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => true);
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:136:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => false);
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] ConditionalExpression
src/sim/state.ts:133:7
-     if (command === "useSelected") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:133:7
-     if (command === "useSelected") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] EqualityOperator
src/sim/state.ts:136:44
-       const ring = state.ring.filter((id) => id !== itemId);
+       const ring = state.ring.filter((id) => id === itemId);
Tests ran:
    deterministic combat and ring inventory wraps ring selection and consumes a tonic with stable removal

[Survived] EqualityOperator
src/sim/state.ts:133:7
-     if (command === "useSelected") {
+     if (command !== "useSelected") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] StringLiteral
src/sim/state.ts:133:19
-     if (command === "useSelected") {
+     if (command === "") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 24 more tests!

[Survived] BlockStatement
src/sim/state.ts:139:29
-     if (command === "pickup") {
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
-       const pickedItem = state.items.find((value) => value.id === itemId);
-     }
+     if (command === "pickup") {}
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ArrowFunction
src/sim/state.ts:140:36
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find(() => undefined);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:44
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => true);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:44
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => false);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] LogicalOperator
src/sim/state.ts:140:44
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find(itemValue => itemValue.id === id)?.position || key(state.items.find(itemValue => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] OptionalChaining
src/sim/state.ts:140:44
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find(itemValue => itemValue.id === id).position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ArrowFunction
src/sim/state.ts:140:61
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find(() => undefined)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:76
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => true)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:76
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => false)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:139:7
-     if (command === "pickup") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:139:7
-     if (command === "pickup") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:139:7
-     if (command === "pickup") {
+     if (command !== "pickup") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] StringLiteral
src/sim/state.ts:139:19
-     if (command === "pickup") {
+     if (command === "") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:140:76
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id !== id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:110
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && true);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] EqualityOperator
src/sim/state.ts:140:110
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find(itemValue => itemValue.id === id)!.position!) !== key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ArrowFunction
src/sim/state.ts:140:131
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find(() => undefined)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:146
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => true)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:140:146
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => false)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] EqualityOperator
src/sim/state.ts:140:146
-       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id === id)!.position!) === key(state.player.position));
+       const itemId = state.loot.find((id) => state.items.find((itemValue) => itemValue.id === id)?.position && key(state.items.find((itemValue) => itemValue.id !== id)!.position!) === key(state.player.position));
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] BooleanLiteral
src/sim/state.ts:141:9
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:141:9
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:141:9
-       if (!itemId) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "noLoot" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:142:9
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (true) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:142:9
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (false) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] EqualityOperator
src/sim/state.ts:142:9
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length > CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] EqualityOperator
src/sim/state.ts:142:9
-       if (state.ring.length >= CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
+       if (state.ring.length < CAPACITY) return { state, events: [{ type: "commandIgnored", reason: "inventoryFull" }] };
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ArrowFunction
src/sim/state.ts:143:41
-       const pickedItem = state.items.find((value) => value.id === itemId);
+       const pickedItem = state.items.find(() => undefined);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:143:52
-       const pickedItem = state.items.find((value) => value.id === itemId);
+       const pickedItem = state.items.find((value) => true);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:143:52
-       const pickedItem = state.items.find((value) => value.id === itemId);
+       const pickedItem = state.items.find((value) => false);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup
