[Survived] EqualityOperator
src/sim/state.ts:143:52
-       const pickedItem = state.items.find((value) => value.id === itemId);
+       const pickedItem = state.items.find((value) => value.id !== itemId);
Tests ran:
    persistent dungeon world keeps loot at its dungeon location until pickup
    one-floor run objective awards the seal from the warden and records possession on pickup

[Survived] ConditionalExpression
src/sim/state.ts:146:7
-     if (command === "dropSelected") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:146:7
-     if (command === "dropSelected") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:146:7
-     if (command === "dropSelected") {
+     if (command !== "dropSelected") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] StringLiteral
src/sim/state.ts:146:19
-     if (command === "dropSelected") {
+     if (command === "") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:152:18
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = true ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:152:18
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = false ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:152:18
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command !== "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] StringLiteral
src/sim/state.ts:152:30
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command === "" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:152:71
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command === "turnLeft" ? LEFT[state.player.facing] : true ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:152:71
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command === "turnLeft" ? LEFT[state.player.facing] : false ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:152:71
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command !== "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:154:7
-     if (command === "moveForward" || command === "moveBackward") {
+     if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] StringLiteral
src/sim/state.ts:152:83
-     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "turnRight" ? RIGHT[state.player.facing] : state.player.facing;
+     const facing = command === "turnLeft" ? LEFT[state.player.facing] : command === "" ? RIGHT[state.player.facing] : state.player.facing;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:154:7
-     if (command === "moveForward" || command === "moveBackward") {
+     if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:154:36
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command === "moveForward" || command !== "moveBackward") {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:154:36
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command === "moveForward" || false) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] StringLiteral
src/sim/state.ts:154:48
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command === "moveForward" || command === "") {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] LogicalOperator
src/sim/state.ts:154:7
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command === "moveForward" && command === "moveBackward") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:154:7
-     if (command === "moveForward" || command === "moveBackward") {
+     if (false || command === "moveBackward") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] EqualityOperator
src/sim/state.ts:154:7
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command !== "moveForward" || command === "moveBackward") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] StringLiteral
src/sim/state.ts:154:19
-     if (command === "moveForward" || command === "moveBackward") {
+     if (command === "" || command === "moveBackward") {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 23 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:155:89
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : {};
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    authoritative exploration moves backward as a discrete authoritative command

[Survived] UnaryOperator
src/sim/state.ts:155:94
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: +forward.x, y: -forward.y };
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    authoritative exploration moves backward as a discrete authoritative command

[Survived] BlockStatement
src/sim/state.ts:154:64
-     if (command === "moveForward" || command === "moveBackward") {
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
-       const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
-         position = next; events.push({ type: "moved", position });
-       } else events.push({ type: "movementBlocked", position: next });
-     }
+     if (command === "moveForward" || command === "moveBackward") {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:155:51
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = true ? forward : { x: -forward.x, y: -forward.y };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:155:51
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = false ? forward : { x: -forward.x, y: -forward.y };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] UnaryOperator
src/sim/state.ts:155:109
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: +forward.y };
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    authoritative exploration moves backward as a discrete authoritative command

[Survived] EqualityOperator
src/sim/state.ts:155:51
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = command !== "moveForward" ? forward : { x: -forward.x, y: -forward.y };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] StringLiteral
src/sim/state.ts:155:63
-       const forward = DELTAS[facing]; const delta = command === "moveForward" ? forward : { x: -forward.x, y: -forward.y };
+       const forward = DELTAS[facing]; const delta = command === "" ? forward : { x: -forward.x, y: -forward.y };
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:156:18
-       const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
+       const next = {}; const door = doorAt(state, next);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:156:23
-       const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
+       const next = { x: position.x - delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ArithmeticOperator
src/sim/state.ts:156:48
-       const next = { x: position.x + delta.x, y: position.y + delta.y }; const door = doorAt(state, next);
+       const next = { x: position.x + delta.x, y: position.y - delta.y }; const door = doorAt(state, next);
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:157:9
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (true) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:157:9
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (false) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] LogicalOperator
src/sim/state.ts:157:9
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (!state.walls.includes(key(next)) || !door || door.open) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:157:9
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (state.walls.includes(key(next)) && (!door || door.open)) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 21 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:157:46
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (!state.walls.includes(key(next)) && (true)) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] LogicalOperator
src/sim/state.ts:157:46
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (!state.walls.includes(key(next)) && (!door && door.open)) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] BooleanLiteral
src/sim/state.ts:157:46
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
+       if (!state.walls.includes(key(next)) && (door || door.open)) {
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] BlockStatement
src/sim/state.ts:157:67
-       if (!state.walls.includes(key(next)) && (!door || door.open)) {
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
-         position = next; events.push({ type: "moved", position });
-       } else events.push({ type: "movementBlocked", position: next });
+       if (!state.walls.includes(key(next)) && (!door || door.open)) {} else events.push({ type: "movementBlocked", position: next });
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:158:23
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+         const monster = true ? monsterAt(state, next) : undefined;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:158:23
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+         const monster = false ? monsterAt(state, next) : undefined;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] EqualityOperator
src/sim/state.ts:158:23
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+         const monster = command !== "moveForward" ? monsterAt(state, next) : undefined;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] StringLiteral
src/sim/state.ts:158:35
-         const monster = command === "moveForward" ? monsterAt(state, next) : undefined;
+         const monster = command === "" ? monsterAt(state, next) : undefined;
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] BlockStatement
src/sim/state.ts:159:20
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:159:78
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) { const encounter = encounterFromMonster(monster); return {}; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:159:11
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (true) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:159:11
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (false) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:159:102
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, {}), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:161:24
-       } else events.push({ type: "movementBlocked", position: next });
+       } else events.push({});
Tests ran:
    authoritative exploration does not move through a wall
    authoritative exploration reports blocked movement without changing coordinates
