[Survived] ArrayDeclaration
src/sim/state.ts:159:126
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] StringLiteral
src/sim/state.ts:161:32
-       } else events.push({ type: "movementBlocked", position: next });
+       } else events.push({ type: "", position: next });
Tests ran:
    authoritative exploration does not move through a wall
    authoritative exploration reports blocked movement without changing coordinates

[Survived] ObjectLiteral
src/sim/state.ts:160:36
-         position = next; events.push({ type: "moved", position });
+         position = next; events.push({});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 5 more tests!

[Survived] StringLiteral
src/sim/state.ts:160:44
-         position = next; events.push({ type: "moved", position });
+         position = next; events.push({ type: "", position });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 5 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:159:127
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{}] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] StringLiteral
src/sim/state.ts:159:135
-         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "encounterStarted", name: encounter.name, monsterId: monster.id }] }; }
+         if (monster) { const encounter = encounterFromMonster(monster); return { state: advance(state, { encounter }), events: [{ type: "", name: encounter.name, monsterId: monster.id }] }; }
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 14 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:163:7
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (true) events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:163:7
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (false) events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] LogicalOperator
src/sim/state.ts:163:7
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" && command === "turnRight") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:163:7
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (false || command === "turnRight") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] EqualityOperator
src/sim/state.ts:163:7
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command !== "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] StringLiteral
src/sim/state.ts:163:19
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "" || command === "turnRight") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:163:33
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" || false) events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] EqualityOperator
src/sim/state.ts:163:33
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" || command !== "turnRight") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:163:70
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" || command === "turnRight") events.push({});
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
    authoritative exploration turns and moves only in discrete commands
  and 6 more tests!

[Survived] StringLiteral
src/sim/state.ts:163:45
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" || command === "") events.push({ type: "turned", facing });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] StringLiteral
src/sim/state.ts:163:78
-     if (command === "turnLeft" || command === "turnRight") events.push({ type: "turned", facing });
+     if (command === "turnLeft" || command === "turnRight") events.push({ type: "", facing });
Tests ran:
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
    authoritative exploration turns and moves only in discrete commands
  and 6 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:164:37
-     const movedState = advance(state, { player: { position, facing } });
+     const movedState = advance(state, {});
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:164:47
-     const movedState = advance(state, { player: { position, facing } });
+     const movedState = advance(state, { player: {} });
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:165:7
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if (true) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:165:7
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if (false) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] LogicalOperator
src/sim/state.ts:165:7
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if (command === "moveForward" || command === "moveBackward" || key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:165:8
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((true) && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] LogicalOperator
src/sim/state.ts:165:8
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" && command === "moveBackward") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:165:8
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((false || command === "moveBackward") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] StringLiteral
src/sim/state.ts:165:20
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] EqualityOperator
src/sim/state.ts:165:8
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command !== "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 9 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:165:37
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" || false) && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] EqualityOperator
src/sim/state.ts:165:37
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" || command !== "moveBackward") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] BlockStatement
src/sim/state.ts:165:113
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
-       const completion = completeRun(movedState);
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
-       events.push(...completion.events);
-     }
+     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {}
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ConditionalExpression
src/sim/state.ts:167:9
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (true) return { state: completion.state, events: [...events, ...completion.events] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] StringLiteral
src/sim/state.ts:165:49
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" || command === "") && key(position) === key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:167:9
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (false) return { state: completion.state, events: [...events, ...completion.events] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] EqualityOperator
src/sim/state.ts:167:9
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (completion.events[0]?.type !== "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] OptionalChaining
src/sim/state.ts:167:9
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (completion.events[0].type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] StringLiteral
src/sim/state.ts:167:40
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (completion.events[0]?.type === "") return { state: completion.state, events: [...events, ...completion.events] };
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ConditionalExpression
src/sim/state.ts:165:68
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" || command === "moveBackward") && true) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:167:64
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (completion.events[0]?.type === "runVictorious") return {};
Tests ran:
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] ArrayDeclaration
src/sim/state.ts:167:99
-       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [...events, ...completion.events] };
+       if (completion.events[0]?.type === "runVictorious") return { state: completion.state, events: [] };
Tests ran:
    one-floor run objective awards authoritative victory at the exit after the seal is picked up

[Survived] CallExpression
src/sim/state.ts:168:5
-       events.push(...completion.events);
+       ;
Tests ran:
    one-floor run objective does not award victory at the exit before the seal is possessed

[Survived] BlockStatement
src/sim/state.ts:174:113
-   export function visibleCells(state: GameState): readonly { distance: number; point: Point; blocked: boolean }[] {
-     const delta = DELTAS[state.player.facing];
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
-   }
+   export function visibleCells(state: GameState): readonly { distance: number; point: Point; blocked: boolean }[] {}
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] EqualityOperator
src/sim/state.ts:165:68
-     if ((command === "moveForward" || command === "moveBackward") && key(position) === key(state.objective.exit)) {
+     if ((command === "moveForward" || command === "moveBackward") && key(position) !== key(state.objective.exit)) {
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 7 more tests!

[Survived] ArrayDeclaration
src/sim/state.ts:176:10
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] BlockStatement
src/sim/state.ts:176:41
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => {});
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ObjectLiteral
src/sim/state.ts:176:57
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = {}; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ArithmeticOperator
src/sim/state.ts:176:62
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x - delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ArithmeticOperator
src/sim/state.ts:176:88
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x / distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ArithmeticOperator
src/sim/state.ts:176:111
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y - delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ArithmeticOperator
src/sim/state.ts:176:137
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y / distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ObjectLiteral
src/sim/state.ts:176:166
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return {}; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ConditionalExpression
src/sim/state.ts:176:194
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: true }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer
