[Survived] ConditionalExpression
src/sim/state.ts:176:194
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] LogicalOperator
src/sim/state.ts:176:194
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) && doorAt(state, point)?.open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] ConditionalExpression
src/sim/state.ts:176:230
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] EqualityOperator
src/sim/state.ts:176:230
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open !== false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] OptionalChaining
src/sim/state.ts:176:230
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point).open === false }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] BooleanLiteral
src/sim/state.ts:176:261
-     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === false }; });
+     return [1, 2, 3, 4].map((distance) => { const point = { x: state.player.position.x + delta.x * distance, y: state.player.position.y + delta.y * distance }; return { distance, point, blocked: state.walls.includes(key(point)) || doorAt(state, point)?.open === true }; });
Tests ran:
    authoritative exploration exposes forward cells for the presentation layer

[Survived] BlockStatement
src/sim/state.ts:179:82
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind {}
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:179:123
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (true) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] ObjectLiteral
src/sim/state.ts:170:10
-     return { state: movedState, events };
+     return {};
Tests ran:
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world reaches the populated east branch and starts the stable Mireling encounter
    persistent dungeon world keeps populated-world loot deterministic for identical seeds and commands
  and 8 more tests!

[Survived] ConditionalExpression
src/sim/state.ts:179:123
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (false) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] BlockStatement
src/sim/state.ts:173:77
-   export function applyCommand(state: GameState, command: Command): GameState { return executeCommand(state, command).state; }
+   export function applyCommand(state: GameState, command: Command): GameState {}
Tests ran:
    persistent dungeon world restores surviving monster health and identity after retreat and re-entry
    persistent dungeon world marks a defeated monster permanently and does not respawn it on revisit
    persistent dungeon world keeps loot at its dungeon location until pickup
  and 19 more tests!

[Survived] StringLiteral
src/sim/state.ts:179:148
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker

[Survived] StringLiteral
src/sim/state.ts:179:219
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "" : "passage"; }
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] StringLiteral
src/sim/state.ts:179:162
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : ""; return state.walls.includes(key(point)) ? "wall" : "passage"; }
Tests ran:
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
    renderer-neutral perspective primitives keeps sconce projection presentation-only and occluded by the nearest blocker

[Survived] StringLiteral
src/sim/state.ts:179:228
-   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : "passage"; }
+   export function visibleCellKind(state: GameState, point: Point): VisibleCellKind { const door = doorAt(state, point); if (door) return door.open ? "open-door" : "closed-door"; return state.walls.includes(key(point)) ? "wall" : ""; }
Tests ran:
    renderer-neutral perspective primitives is deterministic and draws far-to-near surfaces
    renderer-neutral perspective primitives terminates at a wall or closed door and leaves open doors traversable
    renderer-neutral perspective primitives frames only passage cells and never projects a feature through a blocker
  and 4 more tests!

[Survived] UnaryOperator
src/sim/state.ts:17:59
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: +1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:17:48
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: {}, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:17:71
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: {}, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:17:39
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = {};
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:17:116
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: {} };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:17:94
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: {}, west: { x: -1, y: 0 } };
Ran all tests for this mutant.

[Survived] UnaryOperator
src/sim/state.ts:17:121
-   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: -1, y: 0 } };
+   const DELTAS: Record<Facing, Point> = { north: { x: 0, y: -1 }, east: { x: 1, y: 0 }, south: { x: 0, y: 1 }, west: { x: +1, y: 0 } };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:18:38
-   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+   const LEFT: Record<Facing, Facing> = {};
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:18:47
-   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+   const LEFT: Record<Facing, Facing> = { north: "", west: "south", south: "east", east: "north" };
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:18:61
-   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+   const LEFT: Record<Facing, Facing> = { north: "west", west: "", south: "east", east: "north" };
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:18:77
-   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "", east: "north" };
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:18:91
-   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "north" };
+   const LEFT: Record<Facing, Facing> = { north: "west", west: "south", south: "east", east: "" };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:19:39
-   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+   const RIGHT: Record<Facing, Facing> = {};
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:19:48
-   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+   const RIGHT: Record<Facing, Facing> = { north: "", east: "south", south: "west", west: "north" };
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:19:62
-   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+   const RIGHT: Record<Facing, Facing> = { north: "east", east: "", south: "west", west: "north" };
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:19:92
-   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "" };
Ran all tests for this mutant.

[Survived] ObjectLiteral
src/sim/state.ts:22:37
-   export const EXIT_POSITION: Point = { x: 2, y: 4 };
+   export const EXIT_POSITION: Point = {};
Ran all tests for this mutant.

[Survived] StringLiteral
src/sim/state.ts:19:78
-   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "west", west: "north" };
+   const RIGHT: Record<Facing, Facing> = { north: "east", east: "south", south: "", west: "north" };
Ran all tests for this mutant.

[Survived] ArrowFunction
src/sim/state.ts:20:13
-   const key = (point: Point): string => `${point.x},${point.y}`;
+   const key = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/sim/state.ts:24:14
-   const item = (id: string, definitionId: string, location: ItemInstance["location"], position?: Point): ItemInstance => ({ id, definitionId, location, ...(position ? { position } : {}) });
+   const item = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/sim/state.ts:72:16
-   const doorAt = (state: GameState, point: Point): DoorState | undefined => state.doors.find((door) => key(door.position) === key(point));
+   const doorAt = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/sim/state.ts:73:18
-   const selected = (state: GameState): string | null => state.ring[state.selectedRingIndex] ?? null;
+   const selected = () => undefined;
Ran all tests for this mutant.

[Survived] ArrowFunction
src/sim/state.ts:74:17
-   const advance = (state: GameState, patch: Partial<GameState>): GameState => ({ ...state, ...patch, turn: state.turn + 1 });
+   const advance = () => undefined;
Ran all tests for this mutant.

[NoCoverage] StringLiteral
src/main.ts:10:44
-   document.documentElement.style.setProperty("--background-void", paletteHex(DUNGEON_PALETTE.backgroundVoid));
+   document.documentElement.style.setProperty("", paletteHex(DUNGEON_PALETTE.backgroundVoid));

[NoCoverage] StringLiteral
src/main.ts:11:44
-   document.documentElement.style.setProperty("--narrative-text", paletteHex(DUNGEON_PALETTE.narrativeText));
+   document.documentElement.style.setProperty("", paletteHex(DUNGEON_PALETTE.narrativeText));

[NoCoverage] ObjectLiteral
src/main.ts:13:30
-   const game = new Phaser.Game({
-     type: Phaser.WEBGL,
-     parent: "game",
-     width: 1280,
-     height: 720,
-     backgroundColor: DUNGEON_PALETTE.backgroundVoid,
-     pixelArt: true,
-     antialias: false,
-     scene: MainScene,
-     scale: { mode: Phaser.Scale.FIT, autoCenter: Phaser.Scale.CENTER_BOTH }
-   });
+   const game = new Phaser.Game({});

[NoCoverage] StringLiteral
src/main.ts:15:11
-     parent: "game",
+     parent: "",

[NoCoverage] BooleanLiteral
src/main.ts:19:13
-     pixelArt: true,
+     pixelArt: false,

[NoCoverage] BooleanLiteral
src/main.ts:20:14
-     antialias: false,
+     antialias: true,

[NoCoverage] ObjectLiteral
src/main.ts:22:10
-     scale: { mode: Phaser.Scale.FIT, autoCenter: Phaser.Scale.CENTER_BOTH }
+     scale: {}

[NoCoverage] StringLiteral
src/main.ts:27:25
-   window.addEventListener("pagehide", () => {
+   window.addEventListener("", () => {

[NoCoverage] BlockStatement
src/main.ts:27:43
-   window.addEventListener("pagehide", () => {
-     healthCue.dispose();
-     actionCue.dispose();
-     ambientCue.dispose();
-   });
+   window.addEventListener("pagehide", () => {});

[NoCoverage] CallExpression
src/main.ts:28:3
-     healthCue.dispose();
+     ;

[NoCoverage] CallExpression
src/main.ts:29:3
-     actionCue.dispose();
+     ;

[NoCoverage] CallExpression
src/main.ts:30:3
-     ambientCue.dispose();
+     ;

[NoCoverage] StringLiteral
src/main.ts:33:35
-   const ui = document.createElement("section");
+   const ui = document.createElement("");

[NoCoverage] StringLiteral
src/main.ts:34:16
-   ui.className = "shell-ui";
+   ui.className = "";

[NoCoverage] CallExpression
src/main.ts:48:1
-   document.body.append(ui);
+   ;

[NoCoverage] BlockStatement
src/main.ts:75:56
-   const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
+   const emit = (name: string, detail?: unknown): void => {};

[NoCoverage] ObjectLiteral
src/main.ts:75:101
-   const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, { detail })); };
+   const emit = (name: string, detail?: unknown): void => { window.dispatchEvent(new CustomEvent(name, {})); };

[NoCoverage] OptionalChaining
src/main.ts:76:1
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("form").addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });

[NoCoverage] StringLiteral
src/main.ts:76:18
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });

[NoCoverage] StringLiteral
src/main.ts:76:44
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("form")?.addEventListener("", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });

[NoCoverage] BlockStatement
src/main.ts:76:65
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("form")?.addEventListener("submit", (event) => {});

[NoCoverage] CallExpression
src/main.ts:76:67
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("form")?.addEventListener("submit", (event) => { ; emit("tarmin-start", normalizeSeed(seed.value)); });

[NoCoverage] StringLiteral
src/main.ts:76:96
-   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("tarmin-start", normalizeSeed(seed.value)); });
+   ui.querySelector("form")?.addEventListener("submit", (event) => { event.preventDefault(); emit("", normalizeSeed(seed.value)); });

[NoCoverage] OptionalChaining
src/main.ts:77:1
-   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-generate]").addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] StringLiteral
src/main.ts:77:18
-   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] StringLiteral
src/main.ts:77:55
-   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-generate]")?.addEventListener("", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] BlockStatement
src/main.ts:77:70
-   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-generate]")?.addEventListener("click", () => {});

[NoCoverage] StringLiteral
src/main.ts:77:140
-   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-generate]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("", value); });

[NoCoverage] OptionalChaining
src/main.ts:78:1
-   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+   ui.querySelector("[data-continue]").addEventListener("click", () => emit("tarmin-continue"));

[NoCoverage] StringLiteral
src/main.ts:78:18
-   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+   ui.querySelector("")?.addEventListener("click", () => emit("tarmin-continue"));

[NoCoverage] StringLiteral
src/main.ts:78:55
-   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+   ui.querySelector("[data-continue]")?.addEventListener("", () => emit("tarmin-continue"));

[NoCoverage] ArrowFunction
src/main.ts:78:64
-   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+   ui.querySelector("[data-continue]")?.addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
src/main.ts:78:75
-   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit("tarmin-continue"));
+   ui.querySelector("[data-continue]")?.addEventListener("click", () => emit(""));

[NoCoverage] OptionalChaining
src/main.ts:79:1
-   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-pause]").addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] StringLiteral
src/main.ts:79:18
-   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] StringLiteral
src/main.ts:79:52
-   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-pause]")?.addEventListener("", () => emit("tarmin-toggle-pause"));

[NoCoverage] ArrowFunction
src/main.ts:79:61
-   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-pause]")?.addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
src/main.ts:79:72
-   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-pause]")?.addEventListener("click", () => emit(""));

[NoCoverage] OptionalChaining
src/main.ts:80:1
-   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-resume]").addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] StringLiteral
src/main.ts:80:18
-   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("")?.addEventListener("click", () => emit("tarmin-toggle-pause"));

[NoCoverage] StringLiteral
src/main.ts:80:53
-   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-resume]")?.addEventListener("", () => emit("tarmin-toggle-pause"));

[NoCoverage] ArrowFunction
src/main.ts:80:62
-   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-resume]")?.addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
src/main.ts:80:73
-   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit("tarmin-toggle-pause"));
+   ui.querySelector("[data-resume]")?.addEventListener("click", () => emit(""));

[NoCoverage] OptionalChaining
src/main.ts:81:1
-   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+   ui.querySelector("[data-restart-same]").addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));

[NoCoverage] StringLiteral
src/main.ts:81:18
-   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+   ui.querySelector("")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));

[NoCoverage] StringLiteral
src/main.ts:81:59
-   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+   ui.querySelector("[data-restart-same]")?.addEventListener("", () => emit("tarmin-start", normalizeSeed(seed.value)));

[NoCoverage] ArrowFunction
src/main.ts:81:68
-   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
src/main.ts:81:79
-   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("tarmin-start", normalizeSeed(seed.value)));
+   ui.querySelector("[data-restart-same]")?.addEventListener("click", () => emit("", normalizeSeed(seed.value)));

[NoCoverage] OptionalChaining
src/main.ts:82:1
-   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-restart-new]").addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] StringLiteral
src/main.ts:82:18
-   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
