[NoCoverage] StringLiteral
src/main.ts:82:58
-   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-restart-new]")?.addEventListener("", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });

[NoCoverage] BlockStatement
src/main.ts:82:73
-   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => {});

[NoCoverage] StringLiteral
src/main.ts:82:143
-   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("tarmin-start", value); });
+   ui.querySelector("[data-restart-new]")?.addEventListener("click", () => { const value = createBrowserSeed(); seed.value = String(value); emit("", value); });

[NoCoverage] StringLiteral
src/main.ts:83:25
-   motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
+   motion.addEventListener("", () => emit("tarmin-motion", motion.checked));

[NoCoverage] ArrowFunction
src/main.ts:83:35
-   motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
+   motion.addEventListener("change", () => undefined);

[NoCoverage] StringLiteral
src/main.ts:83:46
-   motion.addEventListener("change", () => emit("tarmin-motion", motion.checked));
+   motion.addEventListener("change", () => emit("", motion.checked));

[NoCoverage] StringLiteral
src/main.ts:84:25
-   window.addEventListener("tarmin-mode", (event) => {
+   window.addEventListener("", (event) => {

[NoCoverage] ConditionalExpression
src/main.ts:86:21
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(true ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:21
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(false ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:86:21
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode !== "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:30
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:41
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:52
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : true ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:52
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : false ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:86:52
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode !== "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:61
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:72
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:83
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : true ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:86:83
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : false ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:86:83
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode !== "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:92
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:101
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:86:110
-     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     healthCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "");

[NoCoverage] ConditionalExpression
src/main.ts:87:21
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(true ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:21
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(false ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:87:21
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode !== "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:30
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:41
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:52
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : true ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:52
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : false ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:87:52
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode !== "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:61
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:72
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:83
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : true ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:87:83
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : false ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:87:83
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode !== "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:92
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:101
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:87:110
-     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     actionCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "");

[NoCoverage] ConditionalExpression
src/main.ts:88:22
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(true ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:88:22
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(false ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:88:22
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode !== "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:31
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:42
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:88:53
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : true ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:88:53
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : false ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:88:53
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode !== "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:62
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "" ? "paused" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:73
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "" : mode === "menu" ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:88:84
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : true ? "menu" : "terminal");

[NoCoverage] ConditionalExpression
src/main.ts:88:84
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : false ? "menu" : "terminal");

[NoCoverage] EqualityOperator
src/main.ts:88:84
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode !== "menu" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:93
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "" ? "menu" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:102
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "" : "terminal");

[NoCoverage] StringLiteral
src/main.ts:88:111
-     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "terminal");
+     ambientCue.setMode(mode === "active" ? "active" : mode === "paused" ? "paused" : mode === "menu" ? "menu" : "");

[NoCoverage] StringLiteral
src/main.ts:89:33
-     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+     Object.defineProperty(window, "", { configurable: true, get: () => healthCue.diagnostics() });

[NoCoverage] ObjectLiteral
src/main.ts:89:53
-     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AUDIO__", {});

[NoCoverage] BooleanLiteral
src/main.ts:89:69
-     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: false, get: () => healthCue.diagnostics() });

[NoCoverage] ArrowFunction
src/main.ts:89:80
-     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => healthCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AUDIO__", { configurable: true, get: () => undefined });

[NoCoverage] StringLiteral
src/main.ts:90:33
-     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+     Object.defineProperty(window, "", { configurable: true, get: () => actionCue.diagnostics() });

[NoCoverage] ObjectLiteral
src/main.ts:90:60
-     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", {});

[NoCoverage] BooleanLiteral
src/main.ts:90:76
-     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: false, get: () => actionCue.diagnostics() });

[NoCoverage] ArrowFunction
src/main.ts:90:87
-     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => actionCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_ACTION_AUDIO__", { configurable: true, get: () => undefined });

[NoCoverage] StringLiteral
src/main.ts:91:33
-     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+     Object.defineProperty(window, "", { configurable: true, get: () => ambientCue.diagnostics() });

[NoCoverage] ObjectLiteral
src/main.ts:91:61
-     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", {});

[NoCoverage] BooleanLiteral
src/main.ts:91:77
-     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: false, get: () => ambientCue.diagnostics() });

[NoCoverage] ArrowFunction
src/main.ts:91:88
-     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => ambientCue.diagnostics() });
+     Object.defineProperty(window, "__TARMIN_AMBIENT_AUDIO__", { configurable: true, get: () => undefined });

[NoCoverage] ConditionalExpression
src/main.ts:92:19
-     const running = mode !== "menu";
+     const running = true;

[NoCoverage] ConditionalExpression
src/main.ts:92:19
-     const running = mode !== "menu";
+     const running = false;

[NoCoverage] EqualityOperator
src/main.ts:92:19
-     const running = mode !== "menu";
+     const running = mode === "menu";

[NoCoverage] StringLiteral
src/main.ts:92:28
-     const running = mode !== "menu";
+     const running = mode !== "";

[NoCoverage] BooleanLiteral
src/main.ts:93:40
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] ConditionalExpression
src/main.ts:93:70
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = true; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] ConditionalExpression
src/main.ts:93:70
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = false; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] EqualityOperator
src/main.ts:93:70
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode === "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] StringLiteral
src/main.ts:93:79
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== ""; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";

[NoCoverage] ConditionalExpression
src/main.ts:93:154
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = true;

[NoCoverage] ConditionalExpression
src/main.ts:93:154
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = false;

[NoCoverage] EqualityOperator
src/main.ts:93:154
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode === "paused";

[NoCoverage] StringLiteral
src/main.ts:93:163
-     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "paused";
+     start.hidden = running; hud.hidden = !running; pausePanel.hidden = mode !== "paused"; (ui.querySelector("[data-pause-scrim]") as HTMLElement).hidden = mode !== "";

[NoCoverage] ConditionalExpression
src/main.ts:94:26
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = true;

[NoCoverage] ConditionalExpression
src/main.ts:94:26
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = false;

[NoCoverage] LogicalOperator
src/main.ts:94:26
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode !== "defeated" || mode !== "victorious";

[NoCoverage] ConditionalExpression
src/main.ts:94:26
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = true && mode !== "victorious";

[NoCoverage] EqualityOperator
src/main.ts:94:26
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode === "defeated" && mode !== "victorious";

[NoCoverage] StringLiteral
src/main.ts:94:35
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode !== "" && mode !== "victorious";

[NoCoverage] ConditionalExpression
src/main.ts:94:49
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode !== "defeated" && true;

[NoCoverage] EqualityOperator
src/main.ts:94:49
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode !== "defeated" && mode === "victorious";

[NoCoverage] StringLiteral
src/main.ts:94:58
-     terminalPanel.hidden = mode !== "defeated" && mode !== "victorious";
+     terminalPanel.hidden = mode !== "defeated" && mode !== "";

[NoCoverage] ConditionalExpression
src/main.ts:97:7
-     if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+     if (true) (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] ConditionalExpression
src/main.ts:97:7
-     if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+     if (false) (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] EqualityOperator
src/main.ts:97:7
-     if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+     if (mode !== "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] StringLiteral
src/main.ts:97:16
-     if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+     if (mode === "") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();

[NoCoverage] CallExpression
src/main.ts:97:26
-     if (mode === "paused") (ui.querySelector("[data-resume]") as HTMLButtonElement).focus();
+     if (mode === "paused") ;

[NoCoverage] ConditionalExpression
src/main.ts:98:7
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (true) (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] ConditionalExpression
src/main.ts:98:7
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (false) (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] LogicalOperator
src/main.ts:98:7
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "defeated" && mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] ConditionalExpression
src/main.ts:98:7
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (false || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] EqualityOperator
src/main.ts:98:7
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode !== "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] StringLiteral
src/main.ts:98:16
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] ConditionalExpression
src/main.ts:98:30
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "defeated" || false) (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] EqualityOperator
src/main.ts:98:30
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "defeated" || mode !== "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] StringLiteral
src/main.ts:98:39
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "defeated" || mode === "") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();

[NoCoverage] CallExpression
src/main.ts:98:53
-     if (mode === "defeated" || mode === "victorious") (ui.querySelector("[data-restart-same]") as HTMLButtonElement).focus();
+     if (mode === "defeated" || mode === "victorious") ;

[NoCoverage] CallExpression
src/main.ts:100:1
-   window.addEventListener("tarmin-events", (event) => {
-     const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
-   });
+   ;

[NoCoverage] StringLiteral
src/main.ts:100:25
-   window.addEventListener("tarmin-events", (event) => {
+   window.addEventListener("", (event) => {
