[NoCoverage] BlockStatement
src/main.ts:100:53
-   window.addEventListener("tarmin-events", (event) => {
-     const events = (event as CustomEvent<readonly { type: string }[]>).detail;
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
-   });
+   window.addEventListener("tarmin-events", (event) => {});

[NoCoverage] ConditionalExpression
src/main.ts:102:7
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (true) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:102:7
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (false) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] MethodExpression
src/main.ts:102:7
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.every(value => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] ArrowFunction
src/main.ts:102:19
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some(() => undefined)) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:102:30
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some((value) => true)) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:102:30
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some((value) => false)) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] EqualityOperator
src/main.ts:102:30
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some((value) => value.type !== "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:102:45
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "")) actionCue.play("encounter" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:102:81
-     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("encounter" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "encounterStarted")) actionCue.play("" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:103:7
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (true) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:103:7
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (false) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] MethodExpression
src/main.ts:103:7
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.every(value => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] ArrowFunction
src/main.ts:103:19
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some(() => undefined)) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:103:30
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some((value) => true)) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:103:30
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some((value) => false)) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] EqualityOperator
src/main.ts:103:30
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some((value) => value.type !== "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:103:45
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "")) actionCue.play("pickup" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:103:77
-     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("pickup" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "itemAcquired")) actionCue.play("" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:104:7
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (true) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:104:7
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (false) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] MethodExpression
src/main.ts:104:7
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.every(value => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] ArrowFunction
src/main.ts:104:19
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some(() => undefined)) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:104:30
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some((value) => true)) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:104:30
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some((value) => false)) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] EqualityOperator
src/main.ts:104:30
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some((value) => value.type !== "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:104:45
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "")) actionCue.play("attack" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:104:78
-     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("attack" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "attackAttempt")) actionCue.play("" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:105:7
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (true) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:105:7
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (false) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] MethodExpression
src/main.ts:105:7
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.every(value => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] ArrowFunction
src/main.ts:105:19
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some(() => undefined)) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:105:30
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some((value) => true)) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] ConditionalExpression
src/main.ts:105:30
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some((value) => false)) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] EqualityOperator
src/main.ts:105:30
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some((value) => value.type !== "itemUsed")) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:105:45
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "")) actionCue.play("use" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:105:73
-     if (events.some((value) => value.type === "itemUsed")) actionCue.play("use" satisfies ActionCueKind);
+     if (events.some((value) => value.type === "itemUsed")) actionCue.play("" satisfies ActionCueKind);

[NoCoverage] StringLiteral
src/main.ts:107:25
-   window.addEventListener("tarmin-state", (event) => {
+   window.addEventListener("", (event) => {

[NoCoverage] StringLiteral
src/main.ts:109:23
-     floor.textContent = `FLOOR ${detail.floor} · TURN ${detail.turn} · SEED ${detail.seed}`;
+     floor.textContent = ``;

[NoCoverage] StringLiteral
src/main.ts:110:26
-     location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toUpperCase()}`;
+     location.textContent = ``;

[NoCoverage] MethodExpression
src/main.ts:110:80
-     location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toUpperCase()}`;
+     location.textContent = `${detail.position.x},${detail.position.y} · FACING ${detail.facing.toLowerCase()}`;

[NoCoverage] StringLiteral
src/main.ts:111:55
-     objective.textContent = detail.objective.complete ? "OBJECTIVE COMPLETE" : detail.objective.acquired ? `SEAL FOUND · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}` : `FIND SEAL · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}`;
+     objective.textContent = detail.objective.complete ? "" : detail.objective.acquired ? `SEAL FOUND · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}` : `FIND SEAL · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}`;

[NoCoverage] StringLiteral
src/main.ts:111:106
-     objective.textContent = detail.objective.complete ? "OBJECTIVE COMPLETE" : detail.objective.acquired ? `SEAL FOUND · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}` : `FIND SEAL · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}`;
+     objective.textContent = detail.objective.complete ? "OBJECTIVE COMPLETE" : detail.objective.acquired ? `` : `FIND SEAL · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}`;

[NoCoverage] StringLiteral
src/main.ts:111:182
-     objective.textContent = detail.objective.complete ? "OBJECTIVE COMPLETE" : detail.objective.acquired ? `SEAL FOUND · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}` : `FIND SEAL · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}`;
+     objective.textContent = detail.objective.complete ? "OBJECTIVE COMPLETE" : detail.objective.acquired ? `SEAL FOUND · EXIT ${detail.objective.exit.x},${detail.objective.exit.y}` : ``;

[NoCoverage] StringLiteral
src/main.ts:112:24
-     health.textContent = `${detail.health}/${detail.maxHealth}`;
+     health.textContent = ``;

[NoCoverage] CallExpression
src/main.ts:113:3
-     healthCue.update(detail.health, detail.maxHealth);
+     ;

[NoCoverage] StringLiteral
src/main.ts:114:27
-     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+     healthBar.style.width = ``;

[NoCoverage] MethodExpression
src/main.ts:114:30
-     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+     healthBar.style.width = `${Math.min(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;

[NoCoverage] MethodExpression
src/main.ts:114:42
-     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+     healthBar.style.width = `${Math.max(0, Math.max(100, detail.health / detail.maxHealth * 100))}%`;

[NoCoverage] ArithmeticOperator
src/main.ts:114:56
-     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth / 100))}%`;

[NoCoverage] ArithmeticOperator
src/main.ts:114:56
-     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health / detail.maxHealth * 100))}%`;
+     healthBar.style.width = `${Math.max(0, Math.min(100, detail.health * detail.maxHealth * 100))}%`;

[NoCoverage] LogicalOperator
src/main.ts:116:22
-     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+     left.textContent = detail.leftHand && "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";

[NoCoverage] StringLiteral
src/main.ts:116:41
-     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+     left.textContent = detail.leftHand ?? ""; right.textContent = detail.rightHand ?? "EMPTY";

[NoCoverage] LogicalOperator
src/main.ts:116:70
-     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand && "EMPTY";

[NoCoverage] StringLiteral
src/main.ts:116:90
-     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "EMPTY";
+     left.textContent = detail.leftHand ?? "EMPTY"; right.textContent = detail.rightHand ?? "";

[NoCoverage] StringLiteral
src/main.ts:118:27
-     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+     ringCount.textContent = ``; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";

[NoCoverage] LogicalOperator
src/main.ts:118:94
-     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] && "EMPTY" : "EMPTY";

[NoCoverage] StringLiteral
src/main.ts:118:135
-     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "" : "EMPTY";

[NoCoverage] StringLiteral
src/main.ts:118:145
-     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "EMPTY";
+     ringCount.textContent = `${detail.ring.length}/6`; ring.textContent = detail.ring.length ? detail.ring[detail.selectedRingIndex] ?? "EMPTY" : "";

[NoCoverage] BooleanLiteral
src/main.ts:120:23
-     combatCard.hidden = !detail.encounter;
+     combatCard.hidden = detail.encounter;

[NoCoverage] ConditionalExpression
src/main.ts:121:7
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (true) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] ConditionalExpression
src/main.ts:121:7
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (false) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] BlockStatement
src/main.ts:121:25
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) {}

[NoCoverage] StringLiteral
src/main.ts:121:108
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = ``; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] StringLiteral
src/main.ts:121:195
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = ``; }

[NoCoverage] MethodExpression
src/main.ts:121:198
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.min(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] MethodExpression
src/main.ts:121:210
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.max(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] ArithmeticOperator
src/main.ts:121:224
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth / 100))}%`; }

[NoCoverage] ArithmeticOperator
src/main.ts:121:224
-     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health / detail.encounter.maxHealth * 100))}%`; }
+     if (detail.encounter) { encounterName.textContent = detail.encounter.name; encounterHealth.textContent = `${detail.encounter.health}/${detail.encounter.maxHealth} HP`; threatBar.style.width = `${Math.max(0, Math.min(100, detail.encounter.health * detail.encounter.maxHealth * 100))}%`; }

[NoCoverage] StringLiteral
src/main.ts:123:25
-   window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
+   window.addEventListener("", () => { document.body.classList.add("in-run"); });

[NoCoverage] BlockStatement
src/main.ts:123:47
-   window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
+   window.addEventListener("tarmin-start", () => {});

[NoCoverage] StringLiteral
src/main.ts:123:77
-   window.addEventListener("tarmin-start", () => { document.body.classList.add("in-run"); });
+   window.addEventListener("tarmin-start", () => { document.body.classList.add(""); });

[NoCoverage] CallExpression
src/main.ts:124:1
-   window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+   ;

[NoCoverage] StringLiteral
src/main.ts:124:25
-   window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+   window.addEventListener("", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });

[NoCoverage] BlockStatement
src/main.ts:124:57
-   window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+   window.addEventListener("tarmin-checkpoint", (event) => {});

[NoCoverage] BooleanLiteral
src/main.ts:124:127
-   window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = !(event as CustomEvent<boolean>).detail; });
+   window.addEventListener("tarmin-checkpoint", (event) => { (ui.querySelector("[data-continue]") as HTMLButtonElement).hidden = (event as CustomEvent<boolean>).detail; });
